# Rules: 6196-6216

## Suspicious Google Doc Links

Use this query to find emails with message IDs that resemble IDs used in known attack emails and contain a link a document in Google Docs. These behaviors have
been observed leading to ransomware attacks.

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5b94411c-9311-48cd-8f7f-e35b42174e2d |
|DataTypes | EmailEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Suspicious%20Google%20Doc%20Links.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
EmailUrlInfo 
| where Url startswith "https://docs.google.com/document/" 
| join (EmailEvents 
| where EmailDirection == "Inbound" 
| where InternetMessageId matches regex "\\<\\w{ 38,42} \\@") on NetworkMessageId 

```

## Suspicious Google Doc Links

Use this query to find emails with message IDs that resemble IDs used in known attack emails and contain a link a document in Google Docs. These behaviors have
been observed leading to ransomware attacks.

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5b94411c-9311-48cd-8f7f-e35b42174e2d |
|DataTypes | EmailEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Suspicious%20Google%20Doc%20Links.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
EmailUrlInfo 
| where Url startswith "https://docs.google.com/document/" 
| join (EmailEvents 
| where EmailDirection == "Inbound" 
| where InternetMessageId matches regex "\\<\\w{ 38,42} \\@") on NetworkMessageId 

```

## Suspicious Bitlocker Encryption

Looks for potential instances of bitlocker modifying registry settings to allow encryption, where it's executed via a .bat file.

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 476c9326-c53d-495c-8a54-c304a43cb446 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Suspicious%20Bitlocker%20Encryption.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DeviceProcessEvents
| where FileName =~ "reg.exe" 
// Search for BitLocker encryption being enabled without the chip
    and ProcessCommandLine has "EnableBDEWithNoTPM"
    // Using contains due to variant forms of capturing 1: 1, 0x1
    and (ProcessCommandLine has "true" or ProcessCommandLine contains "1")
// Search for this activity being launched by batch scripts, typically as: C:\Windows\[name].bat
| where InitiatingProcessCommandLine has_all (@"C:\Windows\", ".bat")

```

## Suspicious Bitlocker Encryption

Looks for potential instances of bitlocker modifying registry settings to allow encryption, where it's executed via a .bat file.

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 476c9326-c53d-495c-8a54-c304a43cb446 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Suspicious%20Bitlocker%20Encryption.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DeviceProcessEvents
| where FileName =~ "reg.exe" 
// Search for BitLocker encryption being enabled without the chip
    and ProcessCommandLine has "EnableBDEWithNoTPM"
    // Using contains due to variant forms of capturing 1: 1, 0x1
    and (ProcessCommandLine has "true" or ProcessCommandLine contains "1")
// Search for this activity being launched by batch scripts, typically as: C:\Windows\[name].bat
| where InitiatingProcessCommandLine has_all (@"C:\Windows\", ".bat")

```

## Clearing of forensic evidence from event logs using wevtutil

This query checks for attempts to clear at least 10 log entries from event logs using wevtutil.

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 4c086156-63ea-469c-bc85-c57e2ed4ac32 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Clearing%20of%20forensic%20evidence%20from%20event%20logs%20using%20wevtutil.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for use of wevtutil to clear multiple logs
DeviceProcessEvents
| where Timestamp > ago(1d)
| where ProcessCommandLine has "WEVTUTIL" and ProcessCommandLine has "CL"
| summarize LogClearCount = dcount(ProcessCommandLine), ClearedLogList = make_set(ProcessCommandLine) by DeviceId, bin(Timestamp, 5m)
| where LogClearCount > 10

```

## Clearing of forensic evidence from event logs using wevtutil

This query checks for attempts to clear at least 10 log entries from event logs using wevtutil.

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 4c086156-63ea-469c-bc85-c57e2ed4ac32 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Clearing%20of%20forensic%20evidence%20from%20event%20logs%20using%20wevtutil.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for use of wevtutil to clear multiple logs
DeviceProcessEvents
| where Timestamp > ago(1d)
| where ProcessCommandLine has "WEVTUTIL" and ProcessCommandLine has "CL"
| summarize LogClearCount = dcount(ProcessCommandLine), ClearedLogList = make_set(ProcessCommandLine) by DeviceId, bin(Timestamp, 5m)
| where LogClearCount > 10

```

## Distribution from remote location

This query checks for alerts related to file drop and remote execution where the file name matches PsExec and similar tools used for distribution

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 4e070afe-7a9b-4313-a964-c3168fffc1e2 |
|DataTypes | AlertInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Distribution%20from%20remote%20location.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AlertInfo
| where Title == "File dropped and launched from remote location"
| join AlertEvidence on $left.AlertId == $right.AlertId
// Looking for tools involved in potential distribution of ransomware
| where FileName hasprefix "psexe" or (FileName matches regex @"^([a-z0-9]){7}\.exe$" and FileName matches regex "[0-9]{1,5}")
or ProcessCommandLine has "accepteula"

```

## Distribution from remote location

This query checks for alerts related to file drop and remote execution where the file name matches PsExec and similar tools used for distribution

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 4e070afe-7a9b-4313-a964-c3168fffc1e2 |
|DataTypes | AlertInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Distribution%20from%20remote%20location.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AlertInfo
| where Title == "File dropped and launched from remote location"
| join AlertEvidence on $left.AlertId == $right.AlertId
// Looking for tools involved in potential distribution of ransomware
| where FileName hasprefix "psexe" or (FileName matches regex @"^([a-z0-9]){7}\.exe$" and FileName matches regex "[0-9]{1,5}")
or ProcessCommandLine has "accepteula"

```

## Distribution from remote location

This query checks for alerts related to file drop and remote execution where the file name matches PsExec and similar tools used for distribution

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 4e070afe-7a9b-4313-a964-c3168fffc1e2 |
|DataTypes | AlertEvidence |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Distribution%20from%20remote%20location.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AlertInfo
| where Title == "File dropped and launched from remote location"
| join AlertEvidence on $left.AlertId == $right.AlertId
// Looking for tools involved in potential distribution of ransomware
| where FileName hasprefix "psexe" or (FileName matches regex @"^([a-z0-9]){7}\.exe$" and FileName matches regex "[0-9]{1,5}")
or ProcessCommandLine has "accepteula"

```

## Distribution from remote location

This query checks for alerts related to file drop and remote execution where the file name matches PsExec and similar tools used for distribution

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 4e070afe-7a9b-4313-a964-c3168fffc1e2 |
|DataTypes | AlertEvidence |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Distribution%20from%20remote%20location.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AlertInfo
| where Title == "File dropped and launched from remote location"
| join AlertEvidence on $left.AlertId == $right.AlertId
// Looking for tools involved in potential distribution of ransomware
| where FileName hasprefix "psexe" or (FileName matches regex @"^([a-z0-9]){7}\.exe$" and FileName matches regex "[0-9]{1,5}")
or ProcessCommandLine has "accepteula"

```

## Sticky Keys

A technique used in numerous ransomware attacks is a Sticky Keys hijack for privilege escalation/persistence. Surface realted alerts with this query.

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 3c82774a-df78-44eb-9ab3-13ef37c63ae4 |
|DataTypes | AlertInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Sticky%20Keys.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Checks for possible hijacking of Sticky Keys feature 
AlertInfo | where Title == "Sticky Keys binary hijack detected"

```

## Sticky Keys

A technique used in numerous ransomware attacks is a Sticky Keys hijack for privilege escalation/persistence. Surface realted alerts with this query.

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 3c82774a-df78-44eb-9ab3-13ef37c63ae4 |
|DataTypes | AlertInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Sticky%20Keys.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Checks for possible hijacking of Sticky Keys feature 
AlertInfo | where Title == "Sticky Keys binary hijack detected"

```

## Fake Replies

Use this query to find spoofed reply emails that contain certain keywords in the subject. The emails are also checked for a link to a document in Google Docs.
These attacks have been observed leading to ransomware

|Name | Value |
| --- | --- |
|Tactic | Initial access|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8c4da386-7a95-4927-b24c-a13137294e0c |
|DataTypes | EmailEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Fake%20Replies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let SubjectTerms = pack_array('onus','equired','all','urvey','eb', 'eport','you','nation','me','itting','book','ocument','ill'); 
EmailEvents 
| where EmailDirection == "Inbound" 
| where Subject startswith "RE:" 
| where Subject has_any(SubjectTerms) 
| join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where Url startswith "https://docs.google.com/document/" 

```

## Fake Replies

Use this query to find spoofed reply emails that contain certain keywords in the subject. The emails are also checked for a link to a document in Google Docs.
These attacks have been observed leading to ransomware

|Name | Value |
| --- | --- |
|Tactic | Initial access|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8c4da386-7a95-4927-b24c-a13137294e0c |
|DataTypes | EmailEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Fake%20Replies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let SubjectTerms = pack_array('onus','equired','all','urvey','eb', 'eport','you','nation','me','itting','book','ocument','ill'); 
EmailEvents 
| where EmailDirection == "Inbound" 
| where Subject startswith "RE:" 
| where Subject has_any(SubjectTerms) 
| join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where Url startswith "https://docs.google.com/document/" 

```

## Fake Replies

Use this query to find spoofed reply emails that contain certain keywords in the subject. The emails are also checked for a link to a document in Google Docs.
These attacks have been observed leading to ransomware

|Name | Value |
| --- | --- |
|Tactic | Initial access|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8c4da386-7a95-4927-b24c-a13137294e0c |
|DataTypes | EmailUrlInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Fake%20Replies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let SubjectTerms = pack_array('onus','equired','all','urvey','eb', 'eport','you','nation','me','itting','book','ocument','ill'); 
EmailEvents 
| where EmailDirection == "Inbound" 
| where Subject startswith "RE:" 
| where Subject has_any(SubjectTerms) 
| join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where Url startswith "https://docs.google.com/document/" 

```

## Fake Replies

Use this query to find spoofed reply emails that contain certain keywords in the subject. The emails are also checked for a link to a document in Google Docs.
These attacks have been observed leading to ransomware

|Name | Value |
| --- | --- |
|Tactic | Initial access|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8c4da386-7a95-4927-b24c-a13137294e0c |
|DataTypes | EmailUrlInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Fake%20Replies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let SubjectTerms = pack_array('onus','equired','all','urvey','eb', 'eport','you','nation','me','itting','book','ocument','ill'); 
EmailEvents 
| where EmailDirection == "Inbound" 
| where Subject startswith "RE:" 
| where Subject has_any(SubjectTerms) 
| join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where Url startswith "https://docs.google.com/document/" 

```

## Fake Replies

Use this query to find spoofed reply emails that contain certain keywords in the subject. The emails are also checked for a link to a document in Google Docs.
These attacks have been observed leading to ransomware

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8c4da386-7a95-4927-b24c-a13137294e0c |
|DataTypes | EmailEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Fake%20Replies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let SubjectTerms = pack_array('onus','equired','all','urvey','eb', 'eport','you','nation','me','itting','book','ocument','ill'); 
EmailEvents 
| where EmailDirection == "Inbound" 
| where Subject startswith "RE:" 
| where Subject has_any(SubjectTerms) 
| join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where Url startswith "https://docs.google.com/document/" 

```

## Fake Replies

Use this query to find spoofed reply emails that contain certain keywords in the subject. The emails are also checked for a link to a document in Google Docs.
These attacks have been observed leading to ransomware

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8c4da386-7a95-4927-b24c-a13137294e0c |
|DataTypes | EmailEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Fake%20Replies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let SubjectTerms = pack_array('onus','equired','all','urvey','eb', 'eport','you','nation','me','itting','book','ocument','ill'); 
EmailEvents 
| where EmailDirection == "Inbound" 
| where Subject startswith "RE:" 
| where Subject has_any(SubjectTerms) 
| join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where Url startswith "https://docs.google.com/document/" 

```

## Fake Replies

Use this query to find spoofed reply emails that contain certain keywords in the subject. The emails are also checked for a link to a document in Google Docs.
These attacks have been observed leading to ransomware

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8c4da386-7a95-4927-b24c-a13137294e0c |
|DataTypes | EmailUrlInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Fake%20Replies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let SubjectTerms = pack_array('onus','equired','all','urvey','eb', 'eport','you','nation','me','itting','book','ocument','ill'); 
EmailEvents 
| where EmailDirection == "Inbound" 
| where Subject startswith "RE:" 
| where Subject has_any(SubjectTerms) 
| join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where Url startswith "https://docs.google.com/document/" 

```

## Fake Replies

Use this query to find spoofed reply emails that contain certain keywords in the subject. The emails are also checked for a link to a document in Google Docs.
These attacks have been observed leading to ransomware

|Name | Value |
| --- | --- |
|Tactic | Ransomware|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8c4da386-7a95-4927-b24c-a13137294e0c |
|DataTypes | EmailUrlInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/Fake%20Replies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let SubjectTerms = pack_array('onus','equired','all','urvey','eb', 'eport','you','nation','me','itting','book','ocument','ill'); 
EmailEvents 
| where EmailDirection == "Inbound" 
| where Subject startswith "RE:" 
| where Subject has_any(SubjectTerms) 
| join EmailUrlInfo on $left.NetworkMessageId == $right.NetworkMessageId 
| where Url startswith "https://docs.google.com/document/" 

```
