# Rules: 1366-1386

## Mail redirect via ExO transport rule

'Identifies when Exchange Online transport rule configured to forward emails.
This could be an adversary mailbox configured to collect mail from multiple user accounts.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1020|
|Platform | Office 365|
|DetectionType | Analytics |
|ConnectorId | Office365 |
|DetectionId | 500415fb-bba7-4227-a08a-9857fb61b6a7 |
|DataTypes | OfficeActivity |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/OfficeActivity/Mail_redirect_via_ExO_transport_rule.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
OfficeActivity
| where OfficeWorkload == "Exchange"
| where Operation in~ ("New-TransportRule", "Set-TransportRule")
| mv-apply DynamicParameters = todynamic(Parameters) on (summarize ParsedParameters = make_bag(pack(tostring(DynamicParameters.Name), DynamicParameters.Value)))
| extend RuleName = case(
    Operation =~ "Set-TransportRule", OfficeObjectId,
    Operation =~ "New-TransportRule", ParsedParameters.Name,
    "Unknown")
| mv-expand ExpandedParameters = todynamic(Parameters)
| where ExpandedParameters.Name in~ ("BlindCopyTo", "RedirectMessageTo") and isnotempty(ExpandedParameters.Value)
| extend RedirectTo = ExpandedParameters.Value
| extend ClientIPValues = extract_all(@'\[?(::ffff:)?(?P<IPAddress>(\d+\.\d+\.\d+\.\d+)|[^\]]+)\]?([-:](?P<Port>\d+))?', dynamic(["IPAddress", "Port"]), ClientIP)[0]
| project TimeGenerated, RedirectTo, IPAddress = tostring(ClientIPValues[0]), Port = tostring(ClientIPValues[1]), UserId, Operation, RuleName, Parameters
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = IPAddress
    

```

## Mail redirect via ExO transport rule

'Identifies when Exchange Online transport rule configured to forward emails.
This could be an adversary mailbox configured to collect mail from multiple user accounts.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1114|
|Platform | Office 365|
|DetectionType | Analytics |
|ConnectorId | Office365 |
|DetectionId | 500415fb-bba7-4227-a08a-9857fb61b6a7 |
|DataTypes | OfficeActivity |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/OfficeActivity/Mail_redirect_via_ExO_transport_rule.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
OfficeActivity
| where OfficeWorkload == "Exchange"
| where Operation in~ ("New-TransportRule", "Set-TransportRule")
| mv-apply DynamicParameters = todynamic(Parameters) on (summarize ParsedParameters = make_bag(pack(tostring(DynamicParameters.Name), DynamicParameters.Value)))
| extend RuleName = case(
    Operation =~ "Set-TransportRule", OfficeObjectId,
    Operation =~ "New-TransportRule", ParsedParameters.Name,
    "Unknown")
| mv-expand ExpandedParameters = todynamic(Parameters)
| where ExpandedParameters.Name in~ ("BlindCopyTo", "RedirectMessageTo") and isnotempty(ExpandedParameters.Value)
| extend RedirectTo = ExpandedParameters.Value
| extend ClientIPValues = extract_all(@'\[?(::ffff:)?(?P<IPAddress>(\d+\.\d+\.\d+\.\d+)|[^\]]+)\]?([-:](?P<Port>\d+))?', dynamic(["IPAddress", "Port"]), ClientIP)[0]
| project TimeGenerated, RedirectTo, IPAddress = tostring(ClientIPValues[0]), Port = tostring(ClientIPValues[1]), UserId, Operation, RuleName, Parameters
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = IPAddress
    

```

## Mail redirect via ExO transport rule

'Identifies when Exchange Online transport rule configured to forward emails.
This could be an adversary mailbox configured to collect mail from multiple user accounts.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1020|
|Platform | Office 365|
|DetectionType | Analytics |
|ConnectorId | Office365 |
|DetectionId | 500415fb-bba7-4227-a08a-9857fb61b6a7 |
|DataTypes | OfficeActivity |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/OfficeActivity/Mail_redirect_via_ExO_transport_rule.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
OfficeActivity
| where OfficeWorkload == "Exchange"
| where Operation in~ ("New-TransportRule", "Set-TransportRule")
| mv-apply DynamicParameters = todynamic(Parameters) on (summarize ParsedParameters = make_bag(pack(tostring(DynamicParameters.Name), DynamicParameters.Value)))
| extend RuleName = case(
    Operation =~ "Set-TransportRule", OfficeObjectId,
    Operation =~ "New-TransportRule", ParsedParameters.Name,
    "Unknown")
| mv-expand ExpandedParameters = todynamic(Parameters)
| where ExpandedParameters.Name in~ ("BlindCopyTo", "RedirectMessageTo") and isnotempty(ExpandedParameters.Value)
| extend RedirectTo = ExpandedParameters.Value
| extend ClientIPValues = extract_all(@'\[?(::ffff:)?(?P<IPAddress>(\d+\.\d+\.\d+\.\d+)|[^\]]+)\]?([-:](?P<Port>\d+))?', dynamic(["IPAddress", "Port"]), ClientIP)[0]
| project TimeGenerated, RedirectTo, IPAddress = tostring(ClientIPValues[0]), Port = tostring(ClientIPValues[1]), UserId, Operation, RuleName, Parameters
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = IPAddress
    

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1195|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1195|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1059|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1059|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1546|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1546|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1195|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1195|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1059|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1059|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1546|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1546|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1195|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1195|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1059|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1059|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```

## SUNBURST network beacons

Identifies SolarWinds SUNBURST domain beacon IOCs in DeviceNetworkEvents
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1546|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | ce1e7025-866c-41f3-9b08-ec170e05e73e |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DeviceNetworkEvents/SolarWinds_SUNBURST_Network-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let SunburstURL=dynamic(["panhardware.com","databasegalore.com","avsvmcloud.com","freescanonline.com","thedoccloud.com","deftsecurity.com"]);
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess"
| where RemoteUrl in(SunburstURL)
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = iff(isnotempty(InitiatingProcessAccountUpn), InitiatingProcessAccountUpn, InitiatingProcessAccountName),
    HostCustomEntity = DeviceName,
    FileHashCustomEntity = InitiatingProcessMD5, 
    HashAlgorithm = 'MD5',
    URLCustomEntity = RemoteUrl,
    IPCustomEntity = RemoteIP

```
