# Rules: 7813-7833

## Azure Storage file upload from VPS Providers

'Looks for file uploads actions to Azure File and Blob Storage from known VPS provider network ranges.
This is not an exhaustive list of VPS provider ranges but covers some of the most prevalent providers observed.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1570|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 85e16874-72aa-4ebe-b36e-e45f8ba50f79 |
|DataTypes | AzureStorage_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AzureStorage/AzureStorageUploadFromVPS.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let IP_Data = (externaldata(network:string)
[@"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Sample%20Data/Feeds/VPS_Networks.csv"] with (format="csv"));
union
StorageFileLogs,
StorageBlobLogs
//File upload operations
| where StatusText =~ "Success"
| where OperationName =~ "PutBlob" or OperationName =~ "PutRange"
| evaluate ipv4_lookup(IP_Data, CallerIpAddress, network, return_unmatched = false)
| summarize make_set(OperationName), min(TimeGenerated), max(TimeGenerated) by IPCustomEntity=CallerIpAddress, URLCustomEntity=Uri  

```

## New domain added to Whitelist

'This hunting query identifies new domains added to the domain login whitelist in Zoom.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 29752996-e85d-4905-a0e1-a7dcdfcda283 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ZoomLogs/NewDomainAccess.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

ZoomLogs 
| where Event =~ "account.settings_updated"
| extend NewDomains = columnifexists("payload_object_enforce_logon_domains", "")
| where isnotempty(NewDomains)
| project TimeGenerated, Event, User, NewDomains
| extend timestamp = TimeGenerated, AccountCustomEntity = User

```

## Zoom room high CPU alerts

'This hunting query identifies Zoom room systems with high CPU alerts that may be a sign of device compromise.'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1542|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 79cf4646-0959-442f-9707-60fc66eb8145 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ZoomLogs/HighCPURoom.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

ZoomLogs 
| where Event =~ "zoomroom.alert" 
| extend AlertType = toint(parse_json(RoomEvents).AlertType), AlertKind = toint(parse_json(RoomEvents).AlertKind) 
| extend RoomName = payload_object_room_name_s, User = payload_object_email_s
| where AlertType == 1 and AlertKind == 1 
| extend timestamp = TimeGenerated, AccountCustomEntity = User
// Uncomment the lines below to analyse event over time
//| summarize count() by bin(TimeGenerated, 1h), RoomName
//| render timechart

```

## Zoom room high CPU alerts

'This hunting query identifies Zoom room systems with high CPU alerts that may be a sign of device compromise.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1542|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 79cf4646-0959-442f-9707-60fc66eb8145 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ZoomLogs/HighCPURoom.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

ZoomLogs 
| where Event =~ "zoomroom.alert" 
| extend AlertType = toint(parse_json(RoomEvents).AlertType), AlertKind = toint(parse_json(RoomEvents).AlertKind) 
| extend RoomName = payload_object_room_name_s, User = payload_object_email_s
| where AlertType == 1 and AlertKind == 1 
| extend timestamp = TimeGenerated, AccountCustomEntity = User
// Uncomment the lines below to analyse event over time
//| summarize count() by bin(TimeGenerated, 1h), RoomName
//| render timechart

```

## User denied multiple registration events successfully registering

'This hunting query identifies users that have attempted to register for multiple webinars or recordings and has been denied by the organizer but have also successfully register for at least one event. The number of events a user needs to be rejected from to be included in this query is adjusted with the threshold variable.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | e119c365-9213-45a1-bbd7-8faf6d103d30 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ZoomLogs/MultipleRegistrationDenies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 2; 
let failed_users = (
ZoomLogs 
| where Event =~ "webinar.registration_denied" or Event =~ "recording.registration_denied" 
| extend RegisteringUser = columnifexists('payload_object_registrant_email_s', payload_object_registrant_email_s)
| extend ItemId = columnifexists('tostring(parse_json(WebinarEvents).WebinarId)',payload_object_uuid_s)
| summarize dcount(ItemId) by RegisteringUser
| where dcount_ItemId > threshold
| project RegisteringUser);
ZoomLogs 
| where Event =~ "webinar.registration_approved" or Event =~ "recording.registration_approved" 
| extend RegisteringUser = columnifexists('payload_object_registrant_email_s', columnifexists('payload_object_registrant_email_s', "")) 
| extend ItemId = columnifexists('tostring(parse_json(WebinarEvents).WebinarId)',columnifexists('payload_object_uuid_s', ""))
| extend EventName = columnifexists('tostring(parse_json(WebinarEvents).WebinarName)',columnifexists('payload_object_topic_s', ""))
| extend EventHost = columnifexists('payload_object_host_id',"")
| extend EventStart = columnifexists('tostring(parse_json(WebinarEvents).Start)',columnifexists('payload_object_start_time_s' ,""))
| where RegisteringUser !in (failed_users)
| project TimeGenerated, RegisteringUser, EventName, ItemId, EventHost, EventStart
| extend timestamp = TimeGenerated, AccountCustomEntity = RegisteringUser

```

## New time zone observed

'This hunting query identifies users joining a meeting from a time zone that a user has not been observed from in the last 30 days.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 5ca3868b-9245-4573-894c-55a935736018 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ZoomLogs/NewTZ.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let previous_tz = (
  ZoomLogs
  | where Event =~ "meeting.participant_joined"
  | extend TimeZone = columnifexists('payload_object_timezone_s', "")
  | summarize by TimeZone
);
ZoomLogs
| where Event =~ "meeting.participant_joined"
| extend TimeZone = columnifexists('payload_object_timezone_s', "")
| where isnotempty(TimeZone) and TimeZone in (previous_tz)
| extend timestamp = TimeGenerated, AccountCustomEntity = User

```

## Microsoft Defender AV Platform up to date information

'Provides the Platform version and total count of up to date devices, not up to date devices and count of devices whose status is not available relevant to the Platform version.'

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 4EBA78B0-8E8E-4E9A-9AFF-160372BDD201 |
|DataTypes | TVM_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/Microsoft%20Defender%20Anti%20virus%20Platform%20details.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let expiringPublishdate = ago(8d);
DeviceTvmInfoGathering
| extend DataRefreshTimestamp = Timestamp,    
AvIsPlatformUpToDateTemp=tostring(AdditionalFields.AvIsPlatformUptodate),
AvSignatureDataRefreshTime = todatetime(AdditionalFields.AvSignatureDataRefreshTime), 
AvSignaturePublishTime = todatetime(AdditionalFields.AvSignaturePublishTime),
AvPlatformVersion =  tostring(AdditionalFields.AvPlatformVersion) 
| extend AvIsPlatformUpToDate = iif(((((isempty(AvIsPlatformUpToDateTemp)
or (isnull(AvSignatureDataRefreshTime)))
or (isnull(AvSignaturePublishTime)))
or (AvSignatureDataRefreshTime < expiringPublishdate))
or (AvSignaturePublishTime < expiringPublishdate)), "Unknown", tostring(AvIsPlatformUpToDateTemp)) 
| extend AvPlatformVersion = iif(AvPlatformVersion == "", "Unknown", AvPlatformVersion)
| project DeviceId, DeviceName,  OSPlatform, AvPlatformVersion, DataRefreshTimestamp, AvIsPlatformUpToDate, AvSignaturePublishTime, AvSignatureDataRefreshTime
| summarize DeviceCount = count(), DataRefreshTimestamp = max(DataRefreshTimestamp), PlatformUpToDateDeviceCount = countif(AvIsPlatformUpToDate == "true"),  PlatformNotUpToDateDeviceCount = countif(AvIsPlatformUpToDate == "false"),  PlatformNotAvailableDeviceCount = countif(AvIsPlatformUpToDate == "Unknown") by OSPlatform,AvPlatformVersion

```

## Microsoft Defender AV details

'This query will identify the Microsoft Defender Antivirus Security Intelligence version, Security Intelligence up to date value, Engine version, Engine up to date value,  Product version (aka Platform version),Product (aka Platform) up to date value, Security Intelligence publish/build timestamp, Security intel refresh timestamp and provide a list of devices with these details.'

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | FEE07B7B-E704-4216-BBFC-3B1344136E07 |
|DataTypes | TVM_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/Microsoft%20Defender%20AV%20details.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let expiringPublishdate = ago(8d);
DeviceTvmInfoGathering
| extend AvMode = iif(tostring(AdditionalFields.AvMode) == '0', 'Active', iif(tostring(AdditionalFields.AvMode) == '1', 'Passive',iif(tostring(AdditionalFields.AvMode) == '2', 'Disabled', iif(tostring(AdditionalFields.AvMode) == '5', 'PassiveAudit',iif(tostring(AdditionalFields.AvMode) == '4', 'EDR Blocked' ,'Unknown')))))  
| extend AvIsSignatureUpToDateTemp = tostring(AdditionalFields.AvIsSignatureUptoDate), DataRefreshTimestamp= Timestamp,
AvIsPlatformUptodateTemp=tostring(AdditionalFields.AvIsPlatformUptodate),
AvIsEngineUptodateTemp = tostring(AdditionalFields.AvIsEngineUptodate), 
AvSignatureDataRefreshTime = todatetime(AdditionalFields.AvSignatureDataRefreshTime), 
AvSignaturePublishTime = todatetime(AdditionalFields.AvSignaturePublishTime),
AvSignatureVersion =  tostring(AdditionalFields.AvSignatureVersion),
AvEngineVersion =  tostring(AdditionalFields.AvEngineVersion),
AvPlatformVersion =  tostring(AdditionalFields.AvPlatformVersion)
| extend AvIsSignatureUpToDate = iif(((((isnull(AvIsSignatureUpToDateTemp)
or (isnull(AvSignatureDataRefreshTime)))
or (isnull(AvSignaturePublishTime))))
or (AvIsSignatureUpToDateTemp == "true"
and AvSignaturePublishTime < expiringPublishdate)), "Unknown", tostring(AvIsSignatureUpToDateTemp))
| extend AvIsEngineUpToDate = iif(((((isnull(AvIsEngineUptodateTemp)
or (isnull(AvSignatureDataRefreshTime)))
or (isnull(AvSignaturePublishTime)))
or (AvSignatureDataRefreshTime < expiringPublishdate))
or (AvSignaturePublishTime < expiringPublishdate)), "Unknown", tostring(AvIsEngineUptodateTemp))
| extend AvIsPlatformUpToDate = iif(((((isnull(AvIsPlatformUptodateTemp)
or (isnull(AvSignatureDataRefreshTime)))
or (isnull(AvSignaturePublishTime)))
or (AvSignatureDataRefreshTime < expiringPublishdate))
or (AvSignaturePublishTime < expiringPublishdate)), "Unknown", tostring(AvIsPlatformUptodateTemp))
| project DeviceId, DeviceName, DataRefreshTimestamp, OSPlatform, AvMode, AvSignatureVersion, AvIsSignatureUpToDate, AvEngineVersion, AvIsEngineUpToDate, AvPlatformVersion , AvIsPlatformUpToDate, AvSignaturePublishTime, AvSignatureDataRefreshTime
//| where DataRefreshTimestamp between (datetime("2022-07-19 00:00:00") .. datetime("2022-07-19 18:01:00"))
| where DataRefreshTimestamp > ago(6h)
| order by DeviceName asc
| limit 10000

```

## Microsoft Defender AV Engine up to date info

'Provides the Engine version and total count of up to date devices, not up to date devices and count of devices whose status is not available relevant to the Engine version.'

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 02BE358B-8733-46B7-8E3D-624B1F918237 |
|DataTypes | TVM_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/Microsoft%20Defender%20Anti%20virus%20Engine%20details.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let expiringPublishdate = ago(8d);
DeviceTvmInfoGathering
| extend DataRefreshTimestamp = Timestamp,    
AvIsEngineUpToDateTemp = tostring(AdditionalFields.AvIsEngineUptodate),   
AvSignatureDataRefreshTime = todatetime(AdditionalFields.AvSignatureDataRefreshTime), 
AvSignaturePublishTime = todatetime(AdditionalFields.AvSignaturePublishTime),    
AvEngineVersion =  tostring(AdditionalFields.AvEngineVersion)
| extend AvIsEngineUpToDate = iif(((((isempty(AvIsEngineUpToDateTemp)
or (isnull(AvSignatureDataRefreshTime)))
or (isnull(AvSignaturePublishTime)))
or (AvSignatureDataRefreshTime < expiringPublishdate))
or (AvSignaturePublishTime < expiringPublishdate)), "Unknown", tostring(AvIsEngineUpToDateTemp))  
| extend AvEngineVersion = iif(AvEngineVersion == "", "Unknown", AvEngineVersion)
| project DeviceId, DeviceName,  OSPlatform, AvEngineVersion, DataRefreshTimestamp, AvIsEngineUpToDate, AvSignaturePublishTime, AvSignatureDataRefreshTime
| summarize DeviceCount = count(), DataRefreshTimestamp = max(DataRefreshTimestamp), EngineUpToDateDeviceCount = countif(AvIsEngineUpToDate == "true"), EngineNotUpToDateDeviceCount = countif(AvIsEngineUpToDate == "false"), EngineNotAvailableDeviceCount = countif(AvIsEngineUpToDate == "Unknown") by OSPlatform,AvEngineVersion

```

## Microsoft Defender AV mode device count

'Provides the Anti virus mode and device count falling under that AV mode.'

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 9FDDF2F5-88AC-4186-BA48-7A4187A4F755 |
|DataTypes | TVM_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/Microsoft%20Defender%20AV%20mode%20device%20count.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DeviceTvmInfoGathering
| extend AvMode = iif(tostring(AdditionalFields.AvMode) == '0', 'Active', iif(tostring(AdditionalFields.AvMode) == '1', 'Passive',iif(tostring(AdditionalFields.AvMode) == '2', 'Disabled', iif(tostring(AdditionalFields.AvMode) == '5', 'PassiveAudit',iif(tostring(AdditionalFields.AvMode) == '4', 'EDR Blocked' ,'Unknown')))))  
| summarize DeviceCount = count() by AvMode

```

## Microsoft Defender AV Security Intelligence up to date information

'Provides the Security Intelligence version and total count of up to date devices, not up to date devices and count of devices whose status is not available relevant to the security intelligence version.'

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 0F2179FB-BACC-4B71-80B3-29DE436E965C |
|DataTypes | TVM_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/Microsoft%20Defender%20Anti%20virus%20Security%20Intelligence%20details.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let expiringPublishdate = ago(8d);
DeviceTvmInfoGathering
| extend DataRefreshTimestamp = Timestamp, 
AvIsSignatureUpToDateTemp = tostring(AdditionalFields.AvIsSignatureUptoDate),
AvSignatureDataRefreshTime = todatetime(AdditionalFields.AvSignatureDataRefreshTime), 
AvSignaturePublishTime = todatetime(AdditionalFields.AvSignaturePublishTime),
AvSignatureVersion =  tostring(AdditionalFields.AvSignatureVersion)  
| extend AvIsSignatureUpToDate = iif(((((isempty(AvIsSignatureUpToDateTemp)
or (isnull(AvSignatureDataRefreshTime)))
or (isnull(AvSignaturePublishTime)))
or (AvSignaturePublishTime < expiringPublishdate))
or (AvIsSignatureUpToDateTemp == True
and AvSignaturePublishTime < expiringPublishdate)), "Unknown", tostring(AvIsSignatureUpToDateTemp))
| extend AvSecurityIntelVersion = iif(AvSignatureVersion == "", "Unknown", AvSignatureVersion)
| project DeviceId, DeviceName, OSPlatform, AvSecurityIntelVersion,  DataRefreshTimestamp, AvIsSignatureUpToDate, AvSignaturePublishTime, AvSignatureDataRefreshTime
| summarize DeviceCount = count(), DataRefreshTimestamp = max(DataRefreshTimestamp), SecurityIntelUpToDateDeviceCount = countif(AvIsSignatureUpToDate == "true"), SecurityIntelNotUpToDateDeviceCount = countif(AvIsSignatureUpToDate == "false"), SecurityIntelNotAvailableDeviceCount = countif(AvIsSignatureUpToDate == "Unknown") by OSPlatform,AvSecurityIntelVersion

```

## Crash dump disabled on host (ASIM Version)

'This detection looks the prevention of crash dumps being created. This can be used to limit reporting by malware, look for suspicious processes setting this registry key.'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1070|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 6cb193f3-7c6d-4b53-9153-49a09be830d7 |
|DataTypes | ASimRegistry_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimRegistry/Crashdumpdisabledonhost(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imRegistry
| where RegistryKey == "HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\CrashControl"
| where RegistryValue == "CrashDumpEnabled"
| where RegistryValueData == 0
| project-reorder TimeGenerated, RegistryKey, RegistryValue, RegistryValueData, Process, User, ParentProcessName

```
