# Rules: 7687-7707

## Azure DevOps Build Variable Modified by New User.

'Variables can be configured and used at any stage of the build process in Azure DevOps to inject values. An attacker with the required permissions could modify 
or add to these variables to conduct malicious activity such as changing paths or remote endpoints called during the build. As variables are often changed by users, 
just detecting these changes would have a high false positive rate. This detection looks for modifications to variable groups where that user has not been observed 
modifying them before.'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1578|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 3b9a44d7-c651-45ed-816c-eae583a6f2f1 |
|DataTypes | AzureDevOpsAuditing_CL |
|QueryFrequency | 1d |
|QueryPeriod | 14d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureDevOpsAuditing/ADOVariableModifiedByNewUser.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let lookback = 14d;
let timeframe = 1d;
let historical_data =
AzureDevOpsAuditing
| where TimeGenerated > ago(lookback) and TimeGenerated < ago(timeframe)
| where OperationName =~ "Library.VariableGroupModified"
| extend variables = Data.Variables
| extend VariableGroupId = tostring(Data.VariableGroupId)
| extend UserKey = strcat(VariableGroupId, "-", ActorUserId)
| project UserKey;
AzureDevOpsAuditing
| where TimeGenerated > ago(timeframe)
| where OperationName =~ "Library.VariableGroupModified"
| extend VariableGroupName = tostring(Data.VariableGroupName)
| extend VariableGroupId = tostring(Data.VariableGroupId)
| extend UserKey = strcat(VariableGroupId, "-", ActorUserId)
| where UserKey !in (historical_data)
| project-away UserKey
| project-reorder TimeGenerated, VariableGroupName, ActorUPN, IpAddress, UserAgent
| extend timestamp = TimeGenerated, AccountCustomEntity = ActorUPN, IPCustomEntity = IpAddress

```

## GitHub Activites from a New Country

'Detect activities from a location that was not recently or was never visited by the user or by any user in your organization.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | f041e01d-840d-43da-95c8-4188f6cef546 |
|DataTypes | GitHub_CL |
|QueryFrequency | 1d |
|QueryPeriod | 7d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/GitHub/GitHub%20Activities%20from%20Infrequent%20Country.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let LearningPeriod = 7d;
let RunTime = 1h;
let StartTime = 1h;
let EndRunTime = StartTime - RunTime;
let EndLearningTime = StartTime + LearningPeriod;
let GitHubCountryCodeLogs = (GitHubAudit
| where Country != "");
  GitHubCountryCodeLogs
| where TimeGenerated between (ago(EndLearningTime) .. ago(StartTime))
| summarize makeset(Country) by Actor
| join kind=innerunique (
  GitHubCountryCodeLogs
  | where TimeGenerated between (ago(StartTime) .. ago(EndRunTime))
  | distinct Country, Actor, TimeGenerated
) on Actor 
| where set_Country !contains Country
| extend AccountCustomEntity = Actor , timestamp = TimeGenerated

```

## GitHub Security Vulnerability in Repository

'This alerts when there is a new security vulnerability in a GitHub repository.'

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 5436f471-b03d-41cb-b333-65891f887c43 |
|DataTypes | GitHub_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Informational |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/GitHub/Security%20Vulnerability%20in%20Repo.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubRepo
| where Action == "vulnerabilityAlert"
| project TimeGenerated, DismmisedAt, Reason, vulnerableManifestFilename, Description, Link, PublishedAt, Severity, Summary

```

## NRT GitHub Two Factor Auth Disable

'Two-factor authentication is a process where a user is prompted during the sign-in process for an additional form of identification, such as to enter a code on their cellphone or to provide a fingerprint scan. Two factor authentication reduces the risk of account takeover. Attacker will want to disable such security tools in order to go undetected. '

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1562|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 594c653d-719a-4c23-b028-36e3413e632e |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/GitHub/NRT%20Two%20Factor%20Authentication%20Disabled.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where Action == "org.disable_two_factor_requirement"
| project TimeGenerated, Action, Actor, Country, IPaddress, Repository
| extend AccountCustomEntity = Actor, IPCustomEntity = IPaddress

```

## GitHub Two Factor Auth Disable

'Two-factor authentication is a process where a user is prompted during the sign-in process for an additional form of identification, such as to enter a code on their cellphone or to provide a fingerprint scan. Two factor authentication reduces the risk of account takeover. Attacker will want to disable such security tools in order to go undetected. '

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1562|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 3ff0fffb-d963-40c0-b235-3404f915add7 |
|DataTypes | GitHub_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/GitHub/Two%20Factor%20Authentication%20Disabled.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where Action == "org.disable_two_factor_requirement"
| project TimeGenerated, Action, Actor, Country, IPaddress, Repository
| extend AccountCustomEntity = Actor, IPCustomEntity = IPaddress

```

## Base64 encoded Windows process command-lines (Normalized Process Events)

'Identifies instances of a base64 encoded PE file header seen in the process command line parameter.
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1059|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | f8b3c49c-4087-499b-920f-0dcfaff0cbca |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_base64_encoded_pefile.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
  | where CommandLine contains "TVqQAAMAAAAEAAA"
  | where isnotempty(Process)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Dvc, ActorUsername, Process, CommandLine, ActingProcessName, EventVendor, EventProduct
  | extend timestamp = StartTimeUtc, AccountCustomEntity = ActorUsername, HostCustomEntity = Dvc

```

## Base64 encoded Windows process command-lines (Normalized Process Events)

'Identifies instances of a base64 encoded PE file header seen in the process command line parameter.
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1027|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | f8b3c49c-4087-499b-920f-0dcfaff0cbca |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_base64_encoded_pefile.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
  | where CommandLine contains "TVqQAAMAAAAEAAA"
  | where isnotempty(Process)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Dvc, ActorUsername, Process, CommandLine, ActingProcessName, EventVendor, EventProduct
  | extend timestamp = StartTimeUtc, AccountCustomEntity = ActorUsername, HostCustomEntity = Dvc

```

## Base64 encoded Windows process command-lines (Normalized Process Events)

'Identifies instances of a base64 encoded PE file header seen in the process command line parameter.
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1140|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | f8b3c49c-4087-499b-920f-0dcfaff0cbca |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_base64_encoded_pefile.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
  | where CommandLine contains "TVqQAAMAAAAEAAA"
  | where isnotempty(Process)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Dvc, ActorUsername, Process, CommandLine, ActingProcessName, EventVendor, EventProduct
  | extend timestamp = StartTimeUtc, AccountCustomEntity = ActorUsername, HostCustomEntity = Dvc

```

## Base64 encoded Windows process command-lines (Normalized Process Events)

'Identifies instances of a base64 encoded PE file header seen in the process command line parameter.
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1059|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | f8b3c49c-4087-499b-920f-0dcfaff0cbca |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_base64_encoded_pefile.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
  | where CommandLine contains "TVqQAAMAAAAEAAA"
  | where isnotempty(Process)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Dvc, ActorUsername, Process, CommandLine, ActingProcessName, EventVendor, EventProduct
  | extend timestamp = StartTimeUtc, AccountCustomEntity = ActorUsername, HostCustomEntity = Dvc

```

## Base64 encoded Windows process command-lines (Normalized Process Events)

'Identifies instances of a base64 encoded PE file header seen in the process command line parameter.
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1027|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | f8b3c49c-4087-499b-920f-0dcfaff0cbca |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_base64_encoded_pefile.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
  | where CommandLine contains "TVqQAAMAAAAEAAA"
  | where isnotempty(Process)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Dvc, ActorUsername, Process, CommandLine, ActingProcessName, EventVendor, EventProduct
  | extend timestamp = StartTimeUtc, AccountCustomEntity = ActorUsername, HostCustomEntity = Dvc

```

## Base64 encoded Windows process command-lines (Normalized Process Events)

'Identifies instances of a base64 encoded PE file header seen in the process command line parameter.
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1140|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | f8b3c49c-4087-499b-920f-0dcfaff0cbca |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_base64_encoded_pefile.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
  | where CommandLine contains "TVqQAAMAAAAEAAA"
  | where isnotempty(Process)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Dvc, ActorUsername, Process, CommandLine, ActingProcessName, EventVendor, EventProduct
  | extend timestamp = StartTimeUtc, AccountCustomEntity = ActorUsername, HostCustomEntity = Dvc

```

## Malware in the recycle bin (Normalized Process Events)

'Identifies malware that has been hidden in the recycle bin.
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1564|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 61988db3-0565-49b5-b8e3-747195baac6e |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_malware_in_recyclebin.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let procList = dynamic(["cmd.exe","ftp.exe","schtasks.exe","powershell.exe","rundll32.exe","regsvr32.exe","msiexec.exe"]);  
imProcessCreate
| where CommandLine has "recycler"
| where Process has_any (procList)
| extend FileName = tostring(split(Process, '\\')[-1])
| where FileName in~ (procList)
| project StartTimeUtc = TimeGenerated, Dvc, User, Process, FileName, CommandLine, ActingProcessName, EventVendor, EventProduct
| extend timestamp = StartTimeUtc, AccountCustomEntity = User, HostCustomEntity = Dvc

```

## Sdelete deployed via GPO and run recursively (ASIM Version)

'This query looks for the Sdelete process being run recursively after being deployed to a host via GPO. Attackers could use this technique to deploy Sdelete to multiple host and delete data on them.
  This query uses the Advanced Security Information Model. Parsers will need to be deployed before use: https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1485|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 30c8b802-ace1-4408-bc29-4c5c5afb49e1 |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/SdeletedeployedviaGPOandrunrecursively(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where EventType =~ "ProcessCreated"
  | where Process endswith "svchost.exe"
  | where CommandLine has "-k GPSvcGroup" or CommandLine has "-s gpsvc"
  | extend timekey = bin(TimeGenerated, 1m)
  | project timekey, ActingProcessId, Dvc
  | join kind=inner (imProcess
  | where EventType =~ "ProcessCreated"
  | where Process =~ "sdelete.exe" or CommandLine has "sdelete"
  | where ActingProcessName endswith "svchost.exe"
  | where CommandLine has_all ("-s", "-r")
  | extend timekey = bin(TimeGenerated, 1m)
  ) on $left.ActingProcessId == $right.ParentProcessId, timekey, Dvc

```

## Potential re-named sdelete usage (ASIM Version)

'This detection looks for command line parameters associated with the use of Sysinternals sdelete (https://docs.microsoft.com/sysinternals/downloads/sdelete) to delete multiple files on a host's C drive.
A threat actor may re-name the tool to avoid detection and then use it for destructive attacks on a host.
This detection uses the ASIM imProcess parser, this will need to be deployed before use - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1485|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 5b6ae038-f66e-4f74-9315-df52fd492be4 |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/Potentialre-namedsdeleteusage(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where CommandLine has_all ("accepteula", "-s", "-r", "-q")
  | where Process !endswith "sdelete.exe"
  | where CommandLine !has "sdelete"

```

## Potential re-named sdelete usage (ASIM Version)

'This detection looks for command line parameters associated with the use of Sysinternals sdelete (https://docs.microsoft.com/sysinternals/downloads/sdelete) to delete multiple files on a host's C drive.
A threat actor may re-name the tool to avoid detection and then use it for destructive attacks on a host.
This detection uses the ASIM imProcess parser, this will need to be deployed before use - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1036|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 5b6ae038-f66e-4f74-9315-df52fd492be4 |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/Potentialre-namedsdeleteusage(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where CommandLine has_all ("accepteula", "-s", "-r", "-q")
  | where Process !endswith "sdelete.exe"
  | where CommandLine !has "sdelete"

```

## Potential re-named sdelete usage (ASIM Version)

'This detection looks for command line parameters associated with the use of Sysinternals sdelete (https://docs.microsoft.com/sysinternals/downloads/sdelete) to delete multiple files on a host's C drive.
A threat actor may re-name the tool to avoid detection and then use it for destructive attacks on a host.
This detection uses the ASIM imProcess parser, this will need to be deployed before use - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1485|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 5b6ae038-f66e-4f74-9315-df52fd492be4 |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/Potentialre-namedsdeleteusage(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where CommandLine has_all ("accepteula", "-s", "-r", "-q")
  | where Process !endswith "sdelete.exe"
  | where CommandLine !has "sdelete"

```

## Potential re-named sdelete usage (ASIM Version)

'This detection looks for command line parameters associated with the use of Sysinternals sdelete (https://docs.microsoft.com/sysinternals/downloads/sdelete) to delete multiple files on a host's C drive.
A threat actor may re-name the tool to avoid detection and then use it for destructive attacks on a host.
This detection uses the ASIM imProcess parser, this will need to be deployed before use - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1036|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 5b6ae038-f66e-4f74-9315-df52fd492be4 |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/Potentialre-namedsdeleteusage(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where CommandLine has_all ("accepteula", "-s", "-r", "-q")
  | where Process !endswith "sdelete.exe"
  | where CommandLine !has "sdelete"

```

## Probable AdFind Recon Tool Usage (Normalized Process Events)

'Identifies the host and account that executed AdFind by hash and filename in addition to common and unique flags that are used by many threat actors in discovery.
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1018|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 45076281-35ae-45e0-b443-c32aa0baf965 |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_AdFind_Usage.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let args = dynamic(["objectcategory","domainlist","dcmodes","adinfo","trustdmp","computers_pwdnotreqd","Domain Admins", "objectcategory=person", "objectcategory=computer", "objectcategory=*","dclist"]);
let parentProcesses = dynamic(["pwsh.exe","powershell.exe","cmd.exe"]);
imProcessCreate
//looks for execution from a shell
| where ActingProcessName has_any (parentProcesses)
| extend ActingProcessFileName = tostring(split(ActingProcessName, '\\')[-1])
| where ActingProcessFileName in~ (parentProcesses)
// main filter
| where Process hassuffix "AdFind.exe" or TargetProcessSHA256 == "c92c158d7c37fea795114fa6491fe5f145ad2f8c08776b18ae79db811e8e36a3"
    // AdFind common Flags to check for from various threat actor TTPs
    or CommandLine has_any (args)
| extend AccountCustomEntity = User, HostCustomEntity = Dvc, ProcessCustomEntity = ActingProcessName, CommandLineCustomEntity = CommandLine, AlgorithmCustomEntity = "SHA256", FileHashCustomEntity = TargetProcessSHA256

```

## SUNBURST suspicious SolarWinds child processes (Normalized Process Events)

Identifies suspicious child processes of SolarWinds.Orion.Core.BusinessLayer.dll that may be evidence of the SUNBURST backdoor
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | |
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 631d02df-ab51-46c1-8d72-32d0cfec0720 |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_SolarWinds_SUNBURST_Process-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let excludeProcs = dynamic([@"\SolarWinds\Orion\APM\APMServiceControl.exe", @"\SolarWinds\Orion\ExportToPDFCmd.Exe", @"\SolarWinds.Credentials\SolarWinds.Credentials.Orion.WebApi.exe", @"\SolarWinds\Orion\Topology\SolarWinds.Orion.Topology.Calculator.exe", @"\SolarWinds\Orion\Database-Maint.exe", @"\SolarWinds.Orion.ApiPoller.Service\SolarWinds.Orion.ApiPoller.Service.exe", @"\Windows\SysWOW64\WerFault.exe"]);
imProcessCreate
| where Process hassuffix 'solarwinds.businesslayerhost.exe'
| where not(Process has_any (excludeProcs))
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = ActorUsername,
    HostCustomEntity = User,
    AlgorithmCustomEntity = "MD5",
    FileHashCustomEntity = TargetProcessMD5 // Change to *hash* once implemented

```

## SUNBURST suspicious SolarWinds child processes (Normalized Process Events)

Identifies suspicious child processes of SolarWinds.Orion.Core.BusinessLayer.dll that may be evidence of the SUNBURST backdoor
References:
- https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html
- https://gist.github.com/olafhartong/71ffdd4cab4b6acd5cbcd1a0691ff82f
To use this analytics rule, make sure you have deployed the [ASIM normalization parsers](https://aka.ms/ASimProcessEvent)'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | |
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 631d02df-ab51-46c1-8d72-32d0cfec0720 |
|DataTypes | ASimProcess_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimProcess/imProcess_SolarWinds_SUNBURST_Process-IOCs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let excludeProcs = dynamic([@"\SolarWinds\Orion\APM\APMServiceControl.exe", @"\SolarWinds\Orion\ExportToPDFCmd.Exe", @"\SolarWinds.Credentials\SolarWinds.Credentials.Orion.WebApi.exe", @"\SolarWinds\Orion\Topology\SolarWinds.Orion.Topology.Calculator.exe", @"\SolarWinds\Orion\Database-Maint.exe", @"\SolarWinds.Orion.ApiPoller.Service\SolarWinds.Orion.ApiPoller.Service.exe", @"\Windows\SysWOW64\WerFault.exe"]);
imProcessCreate
| where Process hassuffix 'solarwinds.businesslayerhost.exe'
| where not(Process has_any (excludeProcs))
| extend
    timestamp = TimeGenerated,
    AccountCustomEntity = ActorUsername,
    HostCustomEntity = User,
    AlgorithmCustomEntity = "MD5",
    FileHashCustomEntity = TargetProcessMD5 // Change to *hash* once implemented

```
