# Rules: 5776-5796

## Dev-0322 File Drop Activity November 2021 (ASIM Version)

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.
  This query uses the Microsoft Sentinel Information Model - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1219|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 9b72769e-6ab1-4736-988b-018d92dc5e62 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
imFileEvent
| where EventType =~ "FileCreated"
| where FileName endswith "elrs.exe" or FilePath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (imProcess
| where CommandLine contains "cmd /c elrs.exe") on DvcId
| extend RiskScore = iif(isnotempty(DvcId1), 1.0, 0.5)
| project-reorder TimeGenerated, DvcId, FileName, FilePath, CommandLine, RiskScore
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DvcId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DvcId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DvcId, AlertRiskScore) on DvcId
| extend AlertRiskScore = iif(isempty(AlertRiskScore), 0.0, AlertRiskScore)
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021 (ASIM Version)

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.
  This query uses the Microsoft Sentinel Information Model - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 9b72769e-6ab1-4736-988b-018d92dc5e62 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
imFileEvent
| where EventType =~ "FileCreated"
| where FileName endswith "elrs.exe" or FilePath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (imProcess
| where CommandLine contains "cmd /c elrs.exe") on DvcId
| extend RiskScore = iif(isnotempty(DvcId1), 1.0, 0.5)
| project-reorder TimeGenerated, DvcId, FileName, FilePath, CommandLine, RiskScore
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DvcId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DvcId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DvcId, AlertRiskScore) on DvcId
| extend AlertRiskScore = iif(isempty(AlertRiskScore), 0.0, AlertRiskScore)
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021 (ASIM Version)

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.
  This query uses the Microsoft Sentinel Information Model - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1078|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 9b72769e-6ab1-4736-988b-018d92dc5e62 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
imFileEvent
| where EventType =~ "FileCreated"
| where FileName endswith "elrs.exe" or FilePath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (imProcess
| where CommandLine contains "cmd /c elrs.exe") on DvcId
| extend RiskScore = iif(isnotempty(DvcId1), 1.0, 0.5)
| project-reorder TimeGenerated, DvcId, FileName, FilePath, CommandLine, RiskScore
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DvcId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DvcId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DvcId, AlertRiskScore) on DvcId
| extend AlertRiskScore = iif(isempty(AlertRiskScore), 0.0, AlertRiskScore)
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021 (ASIM Version)

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.
  This query uses the Microsoft Sentinel Information Model - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1219|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 9b72769e-6ab1-4736-988b-018d92dc5e62 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
imFileEvent
| where EventType =~ "FileCreated"
| where FileName endswith "elrs.exe" or FilePath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (imProcess
| where CommandLine contains "cmd /c elrs.exe") on DvcId
| extend RiskScore = iif(isnotempty(DvcId1), 1.0, 0.5)
| project-reorder TimeGenerated, DvcId, FileName, FilePath, CommandLine, RiskScore
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DvcId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DvcId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DvcId, AlertRiskScore) on DvcId
| extend AlertRiskScore = iif(isempty(AlertRiskScore), 0.0, AlertRiskScore)
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021 (ASIM Version)

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.
  This query uses the Microsoft Sentinel Information Model - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1219|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 9b72769e-6ab1-4736-988b-018d92dc5e62 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
imFileEvent
| where EventType =~ "FileCreated"
| where FileName endswith "elrs.exe" or FilePath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (imProcess
| where CommandLine contains "cmd /c elrs.exe") on DvcId
| extend RiskScore = iif(isnotempty(DvcId1), 1.0, 0.5)
| project-reorder TimeGenerated, DvcId, FileName, FilePath, CommandLine, RiskScore
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DvcId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DvcId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DvcId, AlertRiskScore) on DvcId
| extend AlertRiskScore = iif(isempty(AlertRiskScore), 0.0, AlertRiskScore)
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = AccountName

```

## Known NICKEL Registry modifications patterns

'This query identifies instances where malware intentionally configures the browser settings for its use by modifying the following registry entries by NICKEL threat actor.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1546.012|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | f090f8f4a-b986-42d2-b536-e0795c723e25 |
|DataTypes | SecurityEvent |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/NickelRegIOCPatterns.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let reg_paths = dynamic(["HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Main", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Recovery", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Privacy", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\ZoneMap"
                        ]);
let reg_keys = dynamic(["Start Page", "DisableFirstRunCustomize", "RunOnceComplete", "RunOnceHasShown", "Check_Associations", "AutoRecover", "ClearBrowsingHistoryOnExit", "Completed", "IEHarden"]);
(union isfuzzy=true
(
SecurityEvent
| where EventID == 4657
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
WindowsEvent
| where EventID == 4657 and EventData  has_any (reg_paths) and EventData has_any (reg_keys)
| extend ObjectName = tostring(EventData.ObjectName)
| extend ObjectValueName = tostring(EventData.ObjectValueName)
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
Event
| where Source == "Microsoft-Windows-Sysmon"
| where EventID in (12, 13)
| extend EventData = parse_xml(EventData).DataItem.EventData.Data
| mv-expand bagexpansion=array EventData
| evaluate bag_unpack(EventData)
| extend Key=tostring(['@Name']), Value=['#text']
| evaluate pivot(Key, any(Value), TimeGenerated, Source, EventLog, Computer, EventLevel, EventLevelName, EventID, UserName, RenderedDescription, MG, ManagementGroupName, Type, _ResourceId)
| where TargetObject has_any (reg_paths) and TargetObject has_any (reg_keys)
| summarize Count=count() by Computer, UserName, tostring(TargetObject)
| extend AccountCustomEntity = UserName, HostCustomEntity = Computer
),
(
imRegistry
| where RegistryKey has_any (reg_paths) and RegistryValue has_any (reg_keys)
| summarize Count=count() by Dvc, Username, RegistryKey
| extend AccountCustomEntity = Username, HostCustomEntity = Dvc
)
)

```

## Known NICKEL Registry modifications patterns

'This query identifies instances where malware intentionally configures the browser settings for its use by modifying the following registry entries by NICKEL threat actor.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1546.012|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | f090f8f4a-b986-42d2-b536-e0795c723e25 |
|DataTypes | DeviceRegistryEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/NickelRegIOCPatterns.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let reg_paths = dynamic(["HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Main", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Recovery", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Privacy", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\ZoneMap"
                        ]);
let reg_keys = dynamic(["Start Page", "DisableFirstRunCustomize", "RunOnceComplete", "RunOnceHasShown", "Check_Associations", "AutoRecover", "ClearBrowsingHistoryOnExit", "Completed", "IEHarden"]);
(union isfuzzy=true
(
SecurityEvent
| where EventID == 4657
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
WindowsEvent
| where EventID == 4657 and EventData  has_any (reg_paths) and EventData has_any (reg_keys)
| extend ObjectName = tostring(EventData.ObjectName)
| extend ObjectValueName = tostring(EventData.ObjectValueName)
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
Event
| where Source == "Microsoft-Windows-Sysmon"
| where EventID in (12, 13)
| extend EventData = parse_xml(EventData).DataItem.EventData.Data
| mv-expand bagexpansion=array EventData
| evaluate bag_unpack(EventData)
| extend Key=tostring(['@Name']), Value=['#text']
| evaluate pivot(Key, any(Value), TimeGenerated, Source, EventLog, Computer, EventLevel, EventLevelName, EventID, UserName, RenderedDescription, MG, ManagementGroupName, Type, _ResourceId)
| where TargetObject has_any (reg_paths) and TargetObject has_any (reg_keys)
| summarize Count=count() by Computer, UserName, tostring(TargetObject)
| extend AccountCustomEntity = UserName, HostCustomEntity = Computer
),
(
imRegistry
| where RegistryKey has_any (reg_paths) and RegistryValue has_any (reg_keys)
| summarize Count=count() by Dvc, Username, RegistryKey
| extend AccountCustomEntity = Username, HostCustomEntity = Dvc
)
)

```

## Known NICKEL Registry modifications patterns

'This query identifies instances where malware intentionally configures the browser settings for its use by modifying the following registry entries by NICKEL threat actor.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1546.012|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | f090f8f4a-b986-42d2-b536-e0795c723e25 |
|DataTypes | DeviceRegistryEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/NickelRegIOCPatterns.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let reg_paths = dynamic(["HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Main", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Recovery", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Privacy", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\ZoneMap"
                        ]);
let reg_keys = dynamic(["Start Page", "DisableFirstRunCustomize", "RunOnceComplete", "RunOnceHasShown", "Check_Associations", "AutoRecover", "ClearBrowsingHistoryOnExit", "Completed", "IEHarden"]);
(union isfuzzy=true
(
SecurityEvent
| where EventID == 4657
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
WindowsEvent
| where EventID == 4657 and EventData  has_any (reg_paths) and EventData has_any (reg_keys)
| extend ObjectName = tostring(EventData.ObjectName)
| extend ObjectValueName = tostring(EventData.ObjectValueName)
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
Event
| where Source == "Microsoft-Windows-Sysmon"
| where EventID in (12, 13)
| extend EventData = parse_xml(EventData).DataItem.EventData.Data
| mv-expand bagexpansion=array EventData
| evaluate bag_unpack(EventData)
| extend Key=tostring(['@Name']), Value=['#text']
| evaluate pivot(Key, any(Value), TimeGenerated, Source, EventLog, Computer, EventLevel, EventLevelName, EventID, UserName, RenderedDescription, MG, ManagementGroupName, Type, _ResourceId)
| where TargetObject has_any (reg_paths) and TargetObject has_any (reg_keys)
| summarize Count=count() by Computer, UserName, tostring(TargetObject)
| extend AccountCustomEntity = UserName, HostCustomEntity = Computer
),
(
imRegistry
| where RegistryKey has_any (reg_paths) and RegistryValue has_any (reg_keys)
| summarize Count=count() by Dvc, Username, RegistryKey
| extend AccountCustomEntity = Username, HostCustomEntity = Dvc
)
)

```

## Known NICKEL Registry modifications patterns

'This query identifies instances where malware intentionally configures the browser settings for its use by modifying the following registry entries by NICKEL threat actor.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1546.012|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | WindowsSecurityEvents |
|DetectionId | f090f8f4a-b986-42d2-b536-e0795c723e25 |
|DataTypes | SecurityEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/NickelRegIOCPatterns.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let reg_paths = dynamic(["HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Main", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Recovery", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Privacy", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\ZoneMap"
                        ]);
let reg_keys = dynamic(["Start Page", "DisableFirstRunCustomize", "RunOnceComplete", "RunOnceHasShown", "Check_Associations", "AutoRecover", "ClearBrowsingHistoryOnExit", "Completed", "IEHarden"]);
(union isfuzzy=true
(
SecurityEvent
| where EventID == 4657
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
WindowsEvent
| where EventID == 4657 and EventData  has_any (reg_paths) and EventData has_any (reg_keys)
| extend ObjectName = tostring(EventData.ObjectName)
| extend ObjectValueName = tostring(EventData.ObjectValueName)
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
Event
| where Source == "Microsoft-Windows-Sysmon"
| where EventID in (12, 13)
| extend EventData = parse_xml(EventData).DataItem.EventData.Data
| mv-expand bagexpansion=array EventData
| evaluate bag_unpack(EventData)
| extend Key=tostring(['@Name']), Value=['#text']
| evaluate pivot(Key, any(Value), TimeGenerated, Source, EventLog, Computer, EventLevel, EventLevelName, EventID, UserName, RenderedDescription, MG, ManagementGroupName, Type, _ResourceId)
| where TargetObject has_any (reg_paths) and TargetObject has_any (reg_keys)
| summarize Count=count() by Computer, UserName, tostring(TargetObject)
| extend AccountCustomEntity = UserName, HostCustomEntity = Computer
),
(
imRegistry
| where RegistryKey has_any (reg_paths) and RegistryValue has_any (reg_keys)
| summarize Count=count() by Dvc, Username, RegistryKey
| extend AccountCustomEntity = Username, HostCustomEntity = Dvc
)
)

```

## Known NICKEL Registry modifications patterns

'This query identifies instances where malware intentionally configures the browser settings for its use by modifying the following registry entries by NICKEL threat actor.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1546.012|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | WindowsForwardedEvents |
|DetectionId | f090f8f4a-b986-42d2-b536-e0795c723e25 |
|DataTypes | WindowsEvent |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/NickelRegIOCPatterns.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let reg_paths = dynamic(["HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Main", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Recovery", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Internet Explorer\\Privacy", 
                        "HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\ZoneMap"
                        ]);
let reg_keys = dynamic(["Start Page", "DisableFirstRunCustomize", "RunOnceComplete", "RunOnceHasShown", "Check_Associations", "AutoRecover", "ClearBrowsingHistoryOnExit", "Completed", "IEHarden"]);
(union isfuzzy=true
(
SecurityEvent
| where EventID == 4657
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
WindowsEvent
| where EventID == 4657 and EventData  has_any (reg_paths) and EventData has_any (reg_keys)
| extend ObjectName = tostring(EventData.ObjectName)
| extend ObjectValueName = tostring(EventData.ObjectValueName)
| where ObjectName has_any (reg_paths) and ObjectValueName has_any (reg_keys)
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
| summarize Count=count() by Computer, Account, ObjectName
| extend AccountCustomEntity = Account, HostCustomEntity = Computer
),
(
Event
| where Source == "Microsoft-Windows-Sysmon"
| where EventID in (12, 13)
| extend EventData = parse_xml(EventData).DataItem.EventData.Data
| mv-expand bagexpansion=array EventData
| evaluate bag_unpack(EventData)
| extend Key=tostring(['@Name']), Value=['#text']
| evaluate pivot(Key, any(Value), TimeGenerated, Source, EventLog, Computer, EventLevel, EventLevelName, EventID, UserName, RenderedDescription, MG, ManagementGroupName, Type, _ResourceId)
| where TargetObject has_any (reg_paths) and TargetObject has_any (reg_keys)
| summarize Count=count() by Computer, UserName, tostring(TargetObject)
| extend AccountCustomEntity = UserName, HostCustomEntity = Computer
),
(
imRegistry
| where RegistryKey has_any (reg_paths) and RegistryValue has_any (reg_keys)
| summarize Count=count() by Dvc, Username, RegistryKey
| extend AccountCustomEntity = Username, HostCustomEntity = Dvc
)
)

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1586|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1586|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1586|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActivity |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | AzureActivity |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1586|
|Platform | SaaS|
|DetectionType | Hunting |
|ConnectorId | AzureActivity |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | AzureActivity |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1586|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1586|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1570|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1570|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1570|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActivity |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | AzureActivity |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```

## Storage Account Key Enumeration

'This query identifies attackers trying to enumerate the Storage keys as well as updating roles using AzureActivity,SigninLogs 
and  AuditLogs'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1570|
|Platform | SaaS|
|DetectionType | Hunting |
|ConnectorId | AzureActivity |
|DetectionId | f19f913f-292a-41ed-9ac0-f3ea5e703d36 |
|DataTypes | AzureActivity |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/StorageAccountKeyEnumerationWithSigninandAuditlogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs 
 | where ResultType == "0" 
 | where AppDisplayName !in ("Office 365 Exchange Online", "Skype for Business Online", "Office 365 SharePoint Online")
 | project  SuccessLogonTime = TimeGenerated,UserPrincipalName, IPAddress,SuccessAppDisplayName = AppDisplayName
 |  join kind=inner
 (
 AzureActivity
 | where tolower(OperationNameValue) endswith "listkeys/action"
 | where ActivityStatus =~ "Succeeded"
 | project CallerIpAddress, _ResourceId, SubscriptionId, ActivityStatus, Category, Authorization,OperationName
 )
 on $left.IPAddress == $right. CallerIpAddress
 | project SubscriptionId, ActivityStatus, IPAddress, OperationName, UserPrincipalName
 | join kind=inner 
 (
 AuditLogs
 | where LoggedByService =~ "Core Directory"
 | where Category =~ "RoleManagement"
 | extend IpAddress = case(
  isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
 isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
 | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
   tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
 | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
 ) 
 on $left. IPAddress == $right. IpAddress
 | summarize count () by TimeGenerated,IPCustomEntity=IpAddress,UserRoles,AccountCustomEntity=InitiatedBy,TargetResourceName

```
