# Rules: 4852-4872

## DNS Full Name anomalous lookup increase

'Checking for a threefold increase or more of Full Name lookup per Client IP for the current day for today vs the daily average for the previous week.
This can potentially identify excessive traffic to a given location that could be indicative of data transfer out of your network.
This is only Name lookups, so it would be recommended to review the Firewall\Webproxy logs in relation to the ClientIP making the interesting requests.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1008|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 81b478a7-46e2-4f7f-a1aa-aba5e541232b |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_FullNameAnomalousLookupIncrease.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 7d;
//example of excluding Saturday and Sunday in Average as those are potentially low volume and decrease the average, feel free to change
let excludedDays = dynamic(["Saturday", "Sunday"]);
// average is across 5 days as we are dropping weekends, change as needed
let numDays = 5;
// limit to over 1000 lookups somewhat random but helps focus in on higher lookups, change as needed
let avglookupThreshold = 3;
let lookupThreshold = 1000;
DnsEvents
//Setting to startofday so we get 7 days prior to today
| where TimeGenerated >= startofday(lookback) and TimeGenerated <= startofday(starttime)
| where SubType =~ "LookupQuery"
//getting the associated number of the day of the week so we can map to a given day for later parsing if needed
| extend DayNumberofWeek = tostring(dayofweek(TimeGenerated))
//Setting the Day of the week value so that certain days could be excluded if needed
| extend DayofWeek = iff(DayNumberofWeek == "00:00:00", "Sunday",
(iff(DayNumberofWeek == "1.00:00:00", "Monday",
(iff(DayNumberofWeek == "2.00:00:00", "Tuesday",
(iff(DayNumberofWeek == "3.00:00:00", "Wednesday",
(iff(DayNumberofWeek == "4.00:00:00", "Thursday",
(iff(DayNumberofWeek == "5.00:00:00", "Friday",
(iff(DayNumberofWeek == "6.00:00:00", "Saturday", DayNumberofWeek)))))))))))))
| where DayofWeek !in~ (excludedDays)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by ClientIP, Name, IPAddresses
| project StartTime, EndTime, ClientIP, FullNameLookup = Name, IPAddresses, DailyAvgLookupCountOverLastWeek = count_/numDays
| join ( DnsEvents
| where TimeGenerated between(startofday(starttime)..endofday(endtime))
| where SubType =~ "LookupQuery"
| summarize count() by ClientIP, FullNameLookup = Name, IPAddresses
| project ClientIP, LookupCountToday = count_, FullNameLookup, IPAddresses
)
on ClientIP, FullNameLookup, IPAddresses
| where LookupCountToday > (DailyAvgLookupCountOverLastWeek * avglookupThreshold) and LookupCountToday >= lookupThreshold
| project StartTime, EndTime, ClientIP, LookupCountToday, DailyAvgLookupCountOverLastWeek, FullNameLookup, IPAddresses
| order by LookupCountToday desc nulls last
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = FullNameLookup

```

## DNS Full Name anomalous lookup increase

'Checking for a threefold increase or more of Full Name lookup per Client IP for the current day for today vs the daily average for the previous week.
This can potentially identify excessive traffic to a given location that could be indicative of data transfer out of your network.
This is only Name lookups, so it would be recommended to review the Firewall\Webproxy logs in relation to the ClientIP making the interesting requests.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1008|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 81b478a7-46e2-4f7f-a1aa-aba5e541232b |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_FullNameAnomalousLookupIncrease.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 7d;
//example of excluding Saturday and Sunday in Average as those are potentially low volume and decrease the average, feel free to change
let excludedDays = dynamic(["Saturday", "Sunday"]);
// average is across 5 days as we are dropping weekends, change as needed
let numDays = 5;
// limit to over 1000 lookups somewhat random but helps focus in on higher lookups, change as needed
let avglookupThreshold = 3;
let lookupThreshold = 1000;
DnsEvents
//Setting to startofday so we get 7 days prior to today
| where TimeGenerated >= startofday(lookback) and TimeGenerated <= startofday(starttime)
| where SubType =~ "LookupQuery"
//getting the associated number of the day of the week so we can map to a given day for later parsing if needed
| extend DayNumberofWeek = tostring(dayofweek(TimeGenerated))
//Setting the Day of the week value so that certain days could be excluded if needed
| extend DayofWeek = iff(DayNumberofWeek == "00:00:00", "Sunday",
(iff(DayNumberofWeek == "1.00:00:00", "Monday",
(iff(DayNumberofWeek == "2.00:00:00", "Tuesday",
(iff(DayNumberofWeek == "3.00:00:00", "Wednesday",
(iff(DayNumberofWeek == "4.00:00:00", "Thursday",
(iff(DayNumberofWeek == "5.00:00:00", "Friday",
(iff(DayNumberofWeek == "6.00:00:00", "Saturday", DayNumberofWeek)))))))))))))
| where DayofWeek !in~ (excludedDays)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by ClientIP, Name, IPAddresses
| project StartTime, EndTime, ClientIP, FullNameLookup = Name, IPAddresses, DailyAvgLookupCountOverLastWeek = count_/numDays
| join ( DnsEvents
| where TimeGenerated between(startofday(starttime)..endofday(endtime))
| where SubType =~ "LookupQuery"
| summarize count() by ClientIP, FullNameLookup = Name, IPAddresses
| project ClientIP, LookupCountToday = count_, FullNameLookup, IPAddresses
)
on ClientIP, FullNameLookup, IPAddresses
| where LookupCountToday > (DailyAvgLookupCountOverLastWeek * avglookupThreshold) and LookupCountToday >= lookupThreshold
| project StartTime, EndTime, ClientIP, LookupCountToday, DailyAvgLookupCountOverLastWeek, FullNameLookup, IPAddresses
| order by LookupCountToday desc nulls last
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = FullNameLookup

```

## DNS Full Name anomalous lookup increase

'Checking for a threefold increase or more of Full Name lookup per Client IP for the current day for today vs the daily average for the previous week.
This can potentially identify excessive traffic to a given location that could be indicative of data transfer out of your network.
This is only Name lookups, so it would be recommended to review the Firewall\Webproxy logs in relation to the ClientIP making the interesting requests.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1048|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 81b478a7-46e2-4f7f-a1aa-aba5e541232b |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_FullNameAnomalousLookupIncrease.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 7d;
//example of excluding Saturday and Sunday in Average as those are potentially low volume and decrease the average, feel free to change
let excludedDays = dynamic(["Saturday", "Sunday"]);
// average is across 5 days as we are dropping weekends, change as needed
let numDays = 5;
// limit to over 1000 lookups somewhat random but helps focus in on higher lookups, change as needed
let avglookupThreshold = 3;
let lookupThreshold = 1000;
DnsEvents
//Setting to startofday so we get 7 days prior to today
| where TimeGenerated >= startofday(lookback) and TimeGenerated <= startofday(starttime)
| where SubType =~ "LookupQuery"
//getting the associated number of the day of the week so we can map to a given day for later parsing if needed
| extend DayNumberofWeek = tostring(dayofweek(TimeGenerated))
//Setting the Day of the week value so that certain days could be excluded if needed
| extend DayofWeek = iff(DayNumberofWeek == "00:00:00", "Sunday",
(iff(DayNumberofWeek == "1.00:00:00", "Monday",
(iff(DayNumberofWeek == "2.00:00:00", "Tuesday",
(iff(DayNumberofWeek == "3.00:00:00", "Wednesday",
(iff(DayNumberofWeek == "4.00:00:00", "Thursday",
(iff(DayNumberofWeek == "5.00:00:00", "Friday",
(iff(DayNumberofWeek == "6.00:00:00", "Saturday", DayNumberofWeek)))))))))))))
| where DayofWeek !in~ (excludedDays)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by ClientIP, Name, IPAddresses
| project StartTime, EndTime, ClientIP, FullNameLookup = Name, IPAddresses, DailyAvgLookupCountOverLastWeek = count_/numDays
| join ( DnsEvents
| where TimeGenerated between(startofday(starttime)..endofday(endtime))
| where SubType =~ "LookupQuery"
| summarize count() by ClientIP, FullNameLookup = Name, IPAddresses
| project ClientIP, LookupCountToday = count_, FullNameLookup, IPAddresses
)
on ClientIP, FullNameLookup, IPAddresses
| where LookupCountToday > (DailyAvgLookupCountOverLastWeek * avglookupThreshold) and LookupCountToday >= lookupThreshold
| project StartTime, EndTime, ClientIP, LookupCountToday, DailyAvgLookupCountOverLastWeek, FullNameLookup, IPAddresses
| order by LookupCountToday desc nulls last
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = FullNameLookup

```

## DNS Full Name anomalous lookup increase

'Checking for a threefold increase or more of Full Name lookup per Client IP for the current day for today vs the daily average for the previous week.
This can potentially identify excessive traffic to a given location that could be indicative of data transfer out of your network.
This is only Name lookups, so it would be recommended to review the Firewall\Webproxy logs in relation to the ClientIP making the interesting requests.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1048|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 81b478a7-46e2-4f7f-a1aa-aba5e541232b |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_FullNameAnomalousLookupIncrease.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 7d;
//example of excluding Saturday and Sunday in Average as those are potentially low volume and decrease the average, feel free to change
let excludedDays = dynamic(["Saturday", "Sunday"]);
// average is across 5 days as we are dropping weekends, change as needed
let numDays = 5;
// limit to over 1000 lookups somewhat random but helps focus in on higher lookups, change as needed
let avglookupThreshold = 3;
let lookupThreshold = 1000;
DnsEvents
//Setting to startofday so we get 7 days prior to today
| where TimeGenerated >= startofday(lookback) and TimeGenerated <= startofday(starttime)
| where SubType =~ "LookupQuery"
//getting the associated number of the day of the week so we can map to a given day for later parsing if needed
| extend DayNumberofWeek = tostring(dayofweek(TimeGenerated))
//Setting the Day of the week value so that certain days could be excluded if needed
| extend DayofWeek = iff(DayNumberofWeek == "00:00:00", "Sunday",
(iff(DayNumberofWeek == "1.00:00:00", "Monday",
(iff(DayNumberofWeek == "2.00:00:00", "Tuesday",
(iff(DayNumberofWeek == "3.00:00:00", "Wednesday",
(iff(DayNumberofWeek == "4.00:00:00", "Thursday",
(iff(DayNumberofWeek == "5.00:00:00", "Friday",
(iff(DayNumberofWeek == "6.00:00:00", "Saturday", DayNumberofWeek)))))))))))))
| where DayofWeek !in~ (excludedDays)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by ClientIP, Name, IPAddresses
| project StartTime, EndTime, ClientIP, FullNameLookup = Name, IPAddresses, DailyAvgLookupCountOverLastWeek = count_/numDays
| join ( DnsEvents
| where TimeGenerated between(startofday(starttime)..endofday(endtime))
| where SubType =~ "LookupQuery"
| summarize count() by ClientIP, FullNameLookup = Name, IPAddresses
| project ClientIP, LookupCountToday = count_, FullNameLookup, IPAddresses
)
on ClientIP, FullNameLookup, IPAddresses
| where LookupCountToday > (DailyAvgLookupCountOverLastWeek * avglookupThreshold) and LookupCountToday >= lookupThreshold
| project StartTime, EndTime, ClientIP, LookupCountToday, DailyAvgLookupCountOverLastWeek, FullNameLookup, IPAddresses
| order by LookupCountToday desc nulls last
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = FullNameLookup

```

## DNS Full Name anomalous lookup increase

'Checking for a threefold increase or more of Full Name lookup per Client IP for the current day for today vs the daily average for the previous week.
This can potentially identify excessive traffic to a given location that could be indicative of data transfer out of your network.
This is only Name lookups, so it would be recommended to review the Firewall\Webproxy logs in relation to the ClientIP making the interesting requests.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1048|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 81b478a7-46e2-4f7f-a1aa-aba5e541232b |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_FullNameAnomalousLookupIncrease.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 7d;
//example of excluding Saturday and Sunday in Average as those are potentially low volume and decrease the average, feel free to change
let excludedDays = dynamic(["Saturday", "Sunday"]);
// average is across 5 days as we are dropping weekends, change as needed
let numDays = 5;
// limit to over 1000 lookups somewhat random but helps focus in on higher lookups, change as needed
let avglookupThreshold = 3;
let lookupThreshold = 1000;
DnsEvents
//Setting to startofday so we get 7 days prior to today
| where TimeGenerated >= startofday(lookback) and TimeGenerated <= startofday(starttime)
| where SubType =~ "LookupQuery"
//getting the associated number of the day of the week so we can map to a given day for later parsing if needed
| extend DayNumberofWeek = tostring(dayofweek(TimeGenerated))
//Setting the Day of the week value so that certain days could be excluded if needed
| extend DayofWeek = iff(DayNumberofWeek == "00:00:00", "Sunday",
(iff(DayNumberofWeek == "1.00:00:00", "Monday",
(iff(DayNumberofWeek == "2.00:00:00", "Tuesday",
(iff(DayNumberofWeek == "3.00:00:00", "Wednesday",
(iff(DayNumberofWeek == "4.00:00:00", "Thursday",
(iff(DayNumberofWeek == "5.00:00:00", "Friday",
(iff(DayNumberofWeek == "6.00:00:00", "Saturday", DayNumberofWeek)))))))))))))
| where DayofWeek !in~ (excludedDays)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by ClientIP, Name, IPAddresses
| project StartTime, EndTime, ClientIP, FullNameLookup = Name, IPAddresses, DailyAvgLookupCountOverLastWeek = count_/numDays
| join ( DnsEvents
| where TimeGenerated between(startofday(starttime)..endofday(endtime))
| where SubType =~ "LookupQuery"
| summarize count() by ClientIP, FullNameLookup = Name, IPAddresses
| project ClientIP, LookupCountToday = count_, FullNameLookup, IPAddresses
)
on ClientIP, FullNameLookup, IPAddresses
| where LookupCountToday > (DailyAvgLookupCountOverLastWeek * avglookupThreshold) and LookupCountToday >= lookupThreshold
| project StartTime, EndTime, ClientIP, LookupCountToday, DailyAvgLookupCountOverLastWeek, FullNameLookup, IPAddresses
| order by LookupCountToday desc nulls last
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = FullNameLookup

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1568|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1568|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1568|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1048|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1048|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1048|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1568|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1568|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1568|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1008|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1008|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```

## DNS lookups for commonly abused TLDs

'Some top level domains (TLDs) are more commonly associated with malware for a range of 
reasons - including how easy domains on these TLDs are to obtain. Many of these may be undesirable 
from an enterprise policy perspective. You can update and extend the list of TLD's  you wish to search for.
The NameCount column provides an initial insight into how widespread the domain usage is across the environment.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1008|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 8e9c4680-8c0b-4885-b183-3b09efd8fc2c |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_CommonlyAbusedTLDs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Add additional TLDs to this list are required.
let abusedTLD = dynamic(["click", "club", "download",  "xxx", "xyz"]);
DnsEvents
| where Name has "." 
| extend tld = tostring(split(Name, ".")[-1])
| where tld in~ (abusedTLD)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NameCount = count() by Name, ClientIP, tld
| order by NameCount desc
| extend timestamp = StartTime, IPCustomEntity = ClientIP, DomainCustomEntity = Name

```
