# Rules: 5755-5775

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1219|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1219|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1219|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1219|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1219|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1219|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1078|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1078|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1078|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1219|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1219|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1219|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1219|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1219|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1219|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 5bf2d4d8-ea03-4673-aaf8-716a61446022 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
DeviceFileEvents
| where FileName endswith "elrs.exe" or FolderPath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (DeviceProcessEvents
| where ProcessCommandLine contains "cmd /c elrs.exe") on DeviceId
| extend RiskScore = iif(isnotempty(DeviceId1), 1.0, 0.5)
| project-reorder TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, RiskScore, InitiatingProcessAccountName
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DeviceId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DeviceId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DeviceId, AlertRiskScore) on DeviceId
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = DeviceName, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021 (ASIM Version)

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.
  This query uses the Microsoft Sentinel Information Model - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 9b72769e-6ab1-4736-988b-018d92dc5e62 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
imFileEvent
| where EventType =~ "FileCreated"
| where FileName endswith "elrs.exe" or FilePath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (imProcess
| where CommandLine contains "cmd /c elrs.exe") on DvcId
| extend RiskScore = iif(isnotempty(DvcId1), 1.0, 0.5)
| project-reorder TimeGenerated, DvcId, FileName, FilePath, CommandLine, RiskScore
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DvcId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DvcId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DvcId, AlertRiskScore) on DvcId
| extend AlertRiskScore = iif(isempty(AlertRiskScore), 0.0, AlertRiskScore)
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = AccountName

```

## Dev-0322 File Drop Activity November 2021 (ASIM Version)

'This hunting query looks for file creation events related to activity observed by Dev-0322 relating to compromise of systems running the ZOHO ManageEngine ADSelfService Plus software.
  The files this query hunts for are dropped as part of the threat actors post exploitation activity. Some or all of the files may be dropped by the threat actor.
  The risk score associated with each result is based on a number of factors, hosts with higher risk events should be investigated first.
  This query uses the Microsoft Sentinel Information Model - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1078|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | MicrosoftDefenderAdvancedThreatProtection |
|DetectionId | 9b72769e-6ab1-4736-988b-018d92dc5e62 |
|DataTypes | SecurityAlert (MDATP) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/Dev-0322FileDropActivityNovember2021(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Look for the specific files dropped by threat actor
let files = dynamic(["C:\\ProgramData\\Microsoft\\Crypto\\RSA\\key.dat ", "c:\\windows\\temp\\ccc.exe"]);
imFileEvent
| where EventType =~ "FileCreated"
| where FileName endswith "elrs.exe" or FilePath has_any (files)
// Increase the risk score of command accessing file also seen
| join kind=leftouter (imProcess
| where CommandLine contains "cmd /c elrs.exe") on DvcId
| extend RiskScore = iif(isnotempty(DvcId1), 1.0, 0.5)
| project-reorder TimeGenerated, DvcId, FileName, FilePath, CommandLine, RiskScore
// Increase risk score if recent alerts for the host
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DvcId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DvcId)
// Higher risk score are for Defender alerts related to threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Zebracon", "Trojan:MSIL/Gacker.A!dha", "Backdoor:MSIL/Kokishell.A!dha"), 1.0, 0.5)
| project DvcId, AlertRiskScore) on DvcId
| extend AlertRiskScore = iif(isempty(AlertRiskScore), 0.0, AlertRiskScore)
// Create agregate risk score
| extend RiskScore = RiskScore + AlertRiskScore
| extend timestamp = TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = AccountName

```
