# Rules: 5860-5880

## Anomalous Role Assignment

'Adversaries may manipulate accounts to maintain access to victim systems. These actions include adding new accounts to high privilleged groups. Dragonfly 2.0, for example, added newly created accounts to the administrators group to maintain elevated access.  The query below generates an output of all high Blast Radius users performing Add member to priveleged role, or where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 5aa5083c-1de6-42bb-a128-2ec2aba1de39 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Role%20Assignment.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let critical = dynamic(['9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3','c4e39bd9-1100-46d3-8c65-fb160da0071f','158c047a-c907-4556-b7ef-446551a6b5f7','62e90394-69f5-4237-9190-012177145e10','d29b2b05-8046-44ba-8758-1e26182fcf32','729827e3-9c14-49f7-bb1b-9608f156bbb8','966707d0-3269-4727-9be2-8c3a10f19b9d','194ae4cb-b126-40b2-bd5b-6091b380977d','fe930be7-5e62-47db-91af-98c3a49a38b1']);
let high = dynamic(['cf1c38e5-3621-4004-a7cb-879624dced7c','7495fdc4-34c4-4d15-a289-98788ce399fd','aaf43236-0c0d-4d5f-883a-6955382ac081','3edaf663-341e-4475-9f94-5c398ef6c070','7698a772-787b-4ac8-901f-60d6b08affd2','b1be1c3e-b65d-4f19-8427-f6fa0d97feb9','9f06204d-73c1-4d4c-880a-6edb90606fd8','29232cdf-9323-42fd-ade2-1d097af3e4de','be2f45a1-457d-42af-a067-6ec1fa63bc45','7be44c8a-adaf-4e2a-84d6-ab2649e08a13','e8611ab8-c189-46e8-94e1-60213ab1f814']);
AuditLogs
| where OperationName == "Add member to role"
| mv-expand TargetResources
| extend RoleId = tostring(TargetResources.modifiedProperties[0].newValue)
| extend RoleName = tostring(TargetResources.modifiedProperties[1].newValue)
| where RoleId in (critical,high)
| extend TargetId = tostring(TargetResources.id)
| extend Target = tostring(TargetResources.userPrincipalName)
| where isnotempty(RoleId) or isnotempty(RoleName)
| join kind=inner ( BehaviorAnalytics
) on $left._ItemId == $right.SourceRecordId
| where UsersInsights.BlasrRadius == "High" or ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, RoleName, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Resource Access

'Adversary may be trying to move through the environment. APT29 and APT32, for example, has used PtH & PtT techniques to lateral move around the network. The query below generates an output of all users performing an resource access (4624:3) to devices for the first time.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | |
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 782f3bad-31f7-468f-8f58-3b74fc931914 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Resource%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActivityType == "LogOn"
| where ActionType == "ResourceAccess"
| where ActivityInsights has "True"
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by bin(TimeGenerated,1d), UserName, UserPrincipalName, tostring(UsersInsights), ActivityType, ActionType, tostring(ActivityInsights), SourceIPAddress, SourceIPLocation, SourceDevice, tostring(DevicesInsights)
| extend timestamp = StartTime, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Resource Access

'Adversary may be trying to move through the environment. APT29 and APT32, for example, has used PtH & PtT techniques to lateral move around the network. The query below generates an output of all users performing an resource access (4624:3) to devices for the first time.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 782f3bad-31f7-468f-8f58-3b74fc931914 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Resource%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActivityType == "LogOn"
| where ActionType == "ResourceAccess"
| where ActivityInsights has "True"
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by bin(TimeGenerated,1d), UserName, UserPrincipalName, tostring(UsersInsights), ActivityType, ActionType, tostring(ActivityInsights), SourceIPAddress, SourceIPLocation, SourceDevice, tostring(DevicesInsights)
| extend timestamp = StartTime, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Resource Access

'Adversary may be trying to move through the environment. APT29 and APT32, for example, has used PtH & PtT techniques to lateral move around the network. The query below generates an output of all users performing an resource access (4624:3) to devices for the first time.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 782f3bad-31f7-468f-8f58-3b74fc931914 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Resource%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActivityType == "LogOn"
| where ActionType == "ResourceAccess"
| where ActivityInsights has "True"
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by bin(TimeGenerated,1d), UserName, UserPrincipalName, tostring(UsersInsights), ActivityType, ActionType, tostring(ActivityInsights), SourceIPAddress, SourceIPLocation, SourceDevice, tostring(DevicesInsights)
| extend timestamp = StartTime, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous AAD Account Manipulation

'Adversaries may manipulate accounts to maintain access to victim systems. These actions include adding new accounts to high privilleged groups. 
 Dragonfly 2.0, for example, added newly created accounts to the administrators group to maintain elevated access. The query below generates an 
 output of all high Blast Radius users performing "Update user" (name change) to priveleged role, or where one or more features of the activitiy 
 deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 8741deeb-332e-4061-8873-5086040920e3 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20AAD%20Account%20Manipulation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

//Critical Roles can impersonate any user or app, can update passwords for users or service principals (if the role can let a user update passwords for privileged users, if an attacker compromises this user then attacker can update passwords for privileged users hence gaining more privileges so users with this role are equally critical)
//High Roles are Administrators that can manage all aspects or permissions of important products but can't update credentials and impersonate another user/app
let critical = dynamic(['9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3','c4e39bd9-1100-46d3-8c65-fb160da0071f','158c047a-c907-4556-b7ef-446551a6b5f7','62e90394-69f5-4237-9190-012177145e10',
'd29b2b05-8046-44ba-8758-1e26182fcf32','729827e3-9c14-49f7-bb1b-9608f156bbb8','966707d0-3269-4727-9be2-8c3a10f19b9d','194ae4cb-b126-40b2-bd5b-6091b380977d','fe930be7-5e62-47db-91af-98c3a49a38b1']);
let high = dynamic(['cf1c38e5-3621-4004-a7cb-879624dced7c','7495fdc4-34c4-4d15-a289-98788ce399fd','aaf43236-0c0d-4d5f-883a-6955382ac081','3edaf663-341e-4475-9f94-5c398ef6c070',
'7698a772-787b-4ac8-901f-60d6b08affd2','b1be1c3e-b65d-4f19-8427-f6fa0d97feb9','9f06204d-73c1-4d4c-880a-6edb90606fd8','29232cdf-9323-42fd-ade2-1d097af3e4de','be2f45a1-457d-42af-a067-6ec1fa63bc45',
'7be44c8a-adaf-4e2a-84d6-ab2649e08a13','e8611ab8-c189-46e8-94e1-60213ab1f814']);
AuditLogs
| where OperationName == "Update user"
| mv-expand AdditionalDetails
| mv-expand TargetResources
| where AdditionalDetails.key == "UserPrincipalName"
| mv-expand TargetResources
| extend RoleId = tostring(TargetResources.modifiedProperties[0].newValue)
| extend RoleName = tostring(TargetResources.modifiedProperties[1].newValue)
| where RoleId in (critical,high)
| where isnotempty(RoleId) or isnotempty(RoleName)
| extend TargetId = tostring(TargetResources.id)
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| join kind=inner ( BehaviorAnalytics
) on $left._ItemId == $right.SourceRecordId
| where UsersInsights.BlastRadius == "High" or ActivityInsights has "True"
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName), UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName) 
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, RoleName, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous AAD Account Manipulation

'Adversaries may manipulate accounts to maintain access to victim systems. These actions include adding new accounts to high privilleged groups. 
 Dragonfly 2.0, for example, added newly created accounts to the administrators group to maintain elevated access. The query below generates an 
 output of all high Blast Radius users performing "Update user" (name change) to priveleged role, or where one or more features of the activitiy 
 deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 8741deeb-332e-4061-8873-5086040920e3 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20AAD%20Account%20Manipulation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

//Critical Roles can impersonate any user or app, can update passwords for users or service principals (if the role can let a user update passwords for privileged users, if an attacker compromises this user then attacker can update passwords for privileged users hence gaining more privileges so users with this role are equally critical)
//High Roles are Administrators that can manage all aspects or permissions of important products but can't update credentials and impersonate another user/app
let critical = dynamic(['9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3','c4e39bd9-1100-46d3-8c65-fb160da0071f','158c047a-c907-4556-b7ef-446551a6b5f7','62e90394-69f5-4237-9190-012177145e10',
'd29b2b05-8046-44ba-8758-1e26182fcf32','729827e3-9c14-49f7-bb1b-9608f156bbb8','966707d0-3269-4727-9be2-8c3a10f19b9d','194ae4cb-b126-40b2-bd5b-6091b380977d','fe930be7-5e62-47db-91af-98c3a49a38b1']);
let high = dynamic(['cf1c38e5-3621-4004-a7cb-879624dced7c','7495fdc4-34c4-4d15-a289-98788ce399fd','aaf43236-0c0d-4d5f-883a-6955382ac081','3edaf663-341e-4475-9f94-5c398ef6c070',
'7698a772-787b-4ac8-901f-60d6b08affd2','b1be1c3e-b65d-4f19-8427-f6fa0d97feb9','9f06204d-73c1-4d4c-880a-6edb90606fd8','29232cdf-9323-42fd-ade2-1d097af3e4de','be2f45a1-457d-42af-a067-6ec1fa63bc45',
'7be44c8a-adaf-4e2a-84d6-ab2649e08a13','e8611ab8-c189-46e8-94e1-60213ab1f814']);
AuditLogs
| where OperationName == "Update user"
| mv-expand AdditionalDetails
| mv-expand TargetResources
| where AdditionalDetails.key == "UserPrincipalName"
| mv-expand TargetResources
| extend RoleId = tostring(TargetResources.modifiedProperties[0].newValue)
| extend RoleName = tostring(TargetResources.modifiedProperties[1].newValue)
| where RoleId in (critical,high)
| where isnotempty(RoleId) or isnotempty(RoleName)
| extend TargetId = tostring(TargetResources.id)
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| join kind=inner ( BehaviorAnalytics
) on $left._ItemId == $right.SourceRecordId
| where UsersInsights.BlastRadius == "High" or ActivityInsights has "True"
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName), UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName) 
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, RoleName, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous AAD Account Manipulation

'Adversaries may manipulate accounts to maintain access to victim systems. These actions include adding new accounts to high privilleged groups. 
 Dragonfly 2.0, for example, added newly created accounts to the administrators group to maintain elevated access. The query below generates an 
 output of all high Blast Radius users performing "Update user" (name change) to priveleged role, or where one or more features of the activitiy 
 deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 8741deeb-332e-4061-8873-5086040920e3 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20AAD%20Account%20Manipulation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

//Critical Roles can impersonate any user or app, can update passwords for users or service principals (if the role can let a user update passwords for privileged users, if an attacker compromises this user then attacker can update passwords for privileged users hence gaining more privileges so users with this role are equally critical)
//High Roles are Administrators that can manage all aspects or permissions of important products but can't update credentials and impersonate another user/app
let critical = dynamic(['9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3','c4e39bd9-1100-46d3-8c65-fb160da0071f','158c047a-c907-4556-b7ef-446551a6b5f7','62e90394-69f5-4237-9190-012177145e10',
'd29b2b05-8046-44ba-8758-1e26182fcf32','729827e3-9c14-49f7-bb1b-9608f156bbb8','966707d0-3269-4727-9be2-8c3a10f19b9d','194ae4cb-b126-40b2-bd5b-6091b380977d','fe930be7-5e62-47db-91af-98c3a49a38b1']);
let high = dynamic(['cf1c38e5-3621-4004-a7cb-879624dced7c','7495fdc4-34c4-4d15-a289-98788ce399fd','aaf43236-0c0d-4d5f-883a-6955382ac081','3edaf663-341e-4475-9f94-5c398ef6c070',
'7698a772-787b-4ac8-901f-60d6b08affd2','b1be1c3e-b65d-4f19-8427-f6fa0d97feb9','9f06204d-73c1-4d4c-880a-6edb90606fd8','29232cdf-9323-42fd-ade2-1d097af3e4de','be2f45a1-457d-42af-a067-6ec1fa63bc45',
'7be44c8a-adaf-4e2a-84d6-ab2649e08a13','e8611ab8-c189-46e8-94e1-60213ab1f814']);
AuditLogs
| where OperationName == "Update user"
| mv-expand AdditionalDetails
| mv-expand TargetResources
| where AdditionalDetails.key == "UserPrincipalName"
| mv-expand TargetResources
| extend RoleId = tostring(TargetResources.modifiedProperties[0].newValue)
| extend RoleName = tostring(TargetResources.modifiedProperties[1].newValue)
| where RoleId in (critical,high)
| where isnotempty(RoleId) or isnotempty(RoleName)
| extend TargetId = tostring(TargetResources.id)
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| join kind=inner ( BehaviorAnalytics
) on $left._ItemId == $right.SourceRecordId
| where UsersInsights.BlastRadius == "High" or ActivityInsights has "True"
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName), UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName) 
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, RoleName, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous AAD Account Manipulation

'Adversaries may manipulate accounts to maintain access to victim systems. These actions include adding new accounts to high privilleged groups. 
 Dragonfly 2.0, for example, added newly created accounts to the administrators group to maintain elevated access. The query below generates an 
 output of all high Blast Radius users performing "Update user" (name change) to priveleged role, or where one or more features of the activitiy 
 deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 8741deeb-332e-4061-8873-5086040920e3 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20AAD%20Account%20Manipulation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

//Critical Roles can impersonate any user or app, can update passwords for users or service principals (if the role can let a user update passwords for privileged users, if an attacker compromises this user then attacker can update passwords for privileged users hence gaining more privileges so users with this role are equally critical)
//High Roles are Administrators that can manage all aspects or permissions of important products but can't update credentials and impersonate another user/app
let critical = dynamic(['9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3','c4e39bd9-1100-46d3-8c65-fb160da0071f','158c047a-c907-4556-b7ef-446551a6b5f7','62e90394-69f5-4237-9190-012177145e10',
'd29b2b05-8046-44ba-8758-1e26182fcf32','729827e3-9c14-49f7-bb1b-9608f156bbb8','966707d0-3269-4727-9be2-8c3a10f19b9d','194ae4cb-b126-40b2-bd5b-6091b380977d','fe930be7-5e62-47db-91af-98c3a49a38b1']);
let high = dynamic(['cf1c38e5-3621-4004-a7cb-879624dced7c','7495fdc4-34c4-4d15-a289-98788ce399fd','aaf43236-0c0d-4d5f-883a-6955382ac081','3edaf663-341e-4475-9f94-5c398ef6c070',
'7698a772-787b-4ac8-901f-60d6b08affd2','b1be1c3e-b65d-4f19-8427-f6fa0d97feb9','9f06204d-73c1-4d4c-880a-6edb90606fd8','29232cdf-9323-42fd-ade2-1d097af3e4de','be2f45a1-457d-42af-a067-6ec1fa63bc45',
'7be44c8a-adaf-4e2a-84d6-ab2649e08a13','e8611ab8-c189-46e8-94e1-60213ab1f814']);
AuditLogs
| where OperationName == "Update user"
| mv-expand AdditionalDetails
| mv-expand TargetResources
| where AdditionalDetails.key == "UserPrincipalName"
| mv-expand TargetResources
| extend RoleId = tostring(TargetResources.modifiedProperties[0].newValue)
| extend RoleName = tostring(TargetResources.modifiedProperties[1].newValue)
| where RoleId in (critical,high)
| where isnotempty(RoleId) or isnotempty(RoleName)
| extend TargetId = tostring(TargetResources.id)
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| join kind=inner ( BehaviorAnalytics
) on $left._ItemId == $right.SourceRecordId
| where UsersInsights.BlastRadius == "High" or ActivityInsights has "True"
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName), UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName) 
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, RoleName, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous AAD Account Manipulation

'Adversaries may manipulate accounts to maintain access to victim systems. These actions include adding new accounts to high privilleged groups. 
 Dragonfly 2.0, for example, added newly created accounts to the administrators group to maintain elevated access. The query below generates an 
 output of all high Blast Radius users performing "Update user" (name change) to priveleged role, or where one or more features of the activitiy 
 deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 8741deeb-332e-4061-8873-5086040920e3 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20AAD%20Account%20Manipulation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

//Critical Roles can impersonate any user or app, can update passwords for users or service principals (if the role can let a user update passwords for privileged users, if an attacker compromises this user then attacker can update passwords for privileged users hence gaining more privileges so users with this role are equally critical)
//High Roles are Administrators that can manage all aspects or permissions of important products but can't update credentials and impersonate another user/app
let critical = dynamic(['9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3','c4e39bd9-1100-46d3-8c65-fb160da0071f','158c047a-c907-4556-b7ef-446551a6b5f7','62e90394-69f5-4237-9190-012177145e10',
'd29b2b05-8046-44ba-8758-1e26182fcf32','729827e3-9c14-49f7-bb1b-9608f156bbb8','966707d0-3269-4727-9be2-8c3a10f19b9d','194ae4cb-b126-40b2-bd5b-6091b380977d','fe930be7-5e62-47db-91af-98c3a49a38b1']);
let high = dynamic(['cf1c38e5-3621-4004-a7cb-879624dced7c','7495fdc4-34c4-4d15-a289-98788ce399fd','aaf43236-0c0d-4d5f-883a-6955382ac081','3edaf663-341e-4475-9f94-5c398ef6c070',
'7698a772-787b-4ac8-901f-60d6b08affd2','b1be1c3e-b65d-4f19-8427-f6fa0d97feb9','9f06204d-73c1-4d4c-880a-6edb90606fd8','29232cdf-9323-42fd-ade2-1d097af3e4de','be2f45a1-457d-42af-a067-6ec1fa63bc45',
'7be44c8a-adaf-4e2a-84d6-ab2649e08a13','e8611ab8-c189-46e8-94e1-60213ab1f814']);
AuditLogs
| where OperationName == "Update user"
| mv-expand AdditionalDetails
| mv-expand TargetResources
| where AdditionalDetails.key == "UserPrincipalName"
| mv-expand TargetResources
| extend RoleId = tostring(TargetResources.modifiedProperties[0].newValue)
| extend RoleName = tostring(TargetResources.modifiedProperties[1].newValue)
| where RoleId in (critical,high)
| where isnotempty(RoleId) or isnotempty(RoleName)
| extend TargetId = tostring(TargetResources.id)
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| join kind=inner ( BehaviorAnalytics
) on $left._ItemId == $right.SourceRecordId
| where UsersInsights.BlastRadius == "High" or ActivityInsights has "True"
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName), UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName) 
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, RoleName, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Defensive Mechanism Modification

'Adversaries may disable security tools to avoid possible detection of their tools and activities. DarkComet, for example, can disable Security Center functions like anti-virus. The query below generates an output of all users performing a "delete" operation regarding a security policy, where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1562|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | fcb704ae-ac17-400a-9ed9-3c46bd0a3960 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Defensive%20Mechanism%20Modification.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let operations = dynamic(['Remove database vulnerability assessment rule baseline']);
BehaviorAnalytics
| where ActionType in(operations)
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Defensive Mechanism Modification

'Adversaries may disable security tools to avoid possible detection of their tools and activities. DarkComet, for example, can disable Security Center functions like anti-virus. The query below generates an output of all users performing a "delete" operation regarding a security policy, where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1562|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | fcb704ae-ac17-400a-9ed9-3c46bd0a3960 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Defensive%20Mechanism%20Modification.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let operations = dynamic(['Remove database vulnerability assessment rule baseline']);
BehaviorAnalytics
| where ActionType in(operations)
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Defensive Mechanism Modification

'Adversaries may disable security tools to avoid possible detection of their tools and activities. DarkComet, for example, can disable Security Center functions like anti-virus. The query below generates an output of all users performing a "delete" operation regarding a security policy, where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1562|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | fcb704ae-ac17-400a-9ed9-3c46bd0a3960 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Defensive%20Mechanism%20Modification.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let operations = dynamic(['Remove database vulnerability assessment rule baseline']);
BehaviorAnalytics
| where ActionType in(operations)
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous RDP Activity

'Adversaries may use Valid Accounts to log into a computer using the Remote Desktop Protocol (RDP). 
The adversary may then perform actions as the logged-on user. FIN10, for example, has used RDP to move laterally to systems in the victim environment.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | |
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | c01d95d3-ee85-4e7f-9aed-e62356f1de76 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20RDP%20Activity.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActivityType == "LogOn"
| where ActionType == "RemoteInteractiveLogon"
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous RDP Activity

'Adversaries may use Valid Accounts to log into a computer using the Remote Desktop Protocol (RDP). 
The adversary may then perform actions as the logged-on user. FIN10, for example, has used RDP to move laterally to systems in the victim environment.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | c01d95d3-ee85-4e7f-9aed-e62356f1de76 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20RDP%20Activity.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActivityType == "LogOn"
| where ActionType == "RemoteInteractiveLogon"
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous RDP Activity

'Adversaries may use Valid Accounts to log into a computer using the Remote Desktop Protocol (RDP). 
The adversary may then perform actions as the logged-on user. FIN10, for example, has used RDP to move laterally to systems in the victim environment.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | c01d95d3-ee85-4e7f-9aed-e62356f1de76 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20RDP%20Activity.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActivityType == "LogOn"
| where ActionType == "RemoteInteractiveLogon"
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Code Execution

'Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. APT19, for example, used PowerShell commands to execute payloads. The query below generates an output of all users performing an "action" operation regarding "runCommand" in virtual machines, where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1059|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | f8ab176c-1f3f-4cb5-8dc1-f50d30bcae0d |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Code%20Execution.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let operations = dynamic(['Run Command on Virtual Machine']);
BehaviorAnalytics
| where ActionType in(operations)
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Code Execution

'Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. APT19, for example, used PowerShell commands to execute payloads. The query below generates an output of all users performing an "action" operation regarding "runCommand" in virtual machines, where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1059|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | f8ab176c-1f3f-4cb5-8dc1-f50d30bcae0d |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Code%20Execution.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let operations = dynamic(['Run Command on Virtual Machine']);
BehaviorAnalytics
| where ActionType in(operations)
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Code Execution

'Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. APT19, for example, used PowerShell commands to execute payloads. The query below generates an output of all users performing an "action" operation regarding "runCommand" in virtual machines, where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1059|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | f8ab176c-1f3f-4cb5-8dc1-f50d30bcae0d |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Code%20Execution.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let operations = dynamic(['Run Command on Virtual Machine']);
BehaviorAnalytics
| where ActionType in(operations)
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Appspot Phishing Abuse

This query helps surface phishing campaigns associated with Appspot abuse. These emails frequently contain phishing links that utilize the recipients' own email address as a unique identifier in the URI.
This campaign was published on Twitter by @MsftSecIntel at this link: https://twitter.com/MsftSecIntel/status/1374148156301004800
Reference - https://twitter.com/MsftSecIntel

|Name | Value |
| --- | --- |
|Tactic | Initial access|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | cdac93ef-56c0-45bf-9e7f-9cbf0ad06808 |
|DataTypes | EmailUrlInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Email%20Queries/Appspot%20Phishing%20Abuse.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
EmailUrlInfo
// Detect URLs with a subdomain on appspot.com
| where UrlDomain matches regex @'\b[\w\-]+-dot-[\w\-\.]+\.appspot\.com\b'
// Enrich results with sender and recipient data
| join kind=inner EmailEvents on $left.NetworkMessageId==$right.NetworkMessageId
// Phishing attempts from Appspot related campaigns typically contain the recipient's email address in the URI
// Example 1: https://example-dot-example.appspot.com/#recipient@domain.com
// Example 2: https://example-dot-example.appspot.com/index.html?user=recipient@domain.com
| where Url has RecipientEmailAddress
    // Some phishing campaigns pass recipient email as a Base64 encoded string in the URI
    or Url has base64_encode_tostring(RecipientEmailAddress)
| project-away Timestamp1, NetworkMessageId1, ReportId1 

```

## Appspot Phishing Abuse

This query helps surface phishing campaigns associated with Appspot abuse. These emails frequently contain phishing links that utilize the recipients' own email address as a unique identifier in the URI.
This campaign was published on Twitter by @MsftSecIntel at this link: https://twitter.com/MsftSecIntel/status/1374148156301004800
Reference - https://twitter.com/MsftSecIntel

|Name | Value |
| --- | --- |
|Tactic | Initial access|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | cdac93ef-56c0-45bf-9e7f-9cbf0ad06808 |
|DataTypes | EmailUrlInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Email%20Queries/Appspot%20Phishing%20Abuse.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
EmailUrlInfo
// Detect URLs with a subdomain on appspot.com
| where UrlDomain matches regex @'\b[\w\-]+-dot-[\w\-\.]+\.appspot\.com\b'
// Enrich results with sender and recipient data
| join kind=inner EmailEvents on $left.NetworkMessageId==$right.NetworkMessageId
// Phishing attempts from Appspot related campaigns typically contain the recipient's email address in the URI
// Example 1: https://example-dot-example.appspot.com/#recipient@domain.com
// Example 2: https://example-dot-example.appspot.com/index.html?user=recipient@domain.com
| where Url has RecipientEmailAddress
    // Some phishing campaigns pass recipient email as a Base64 encoded string in the URI
    or Url has base64_encode_tostring(RecipientEmailAddress)
| project-away Timestamp1, NetworkMessageId1, ReportId1 

```
