# Rules: 5041-5061

## Hosts running a rare process

Looking for hosts running a rare process. Less than 1% of the average for 30 days and less than a count of 100 on a given host or less than a 14 count on a given host from the last 7 days

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 82e04ff9-a289-4005-9fcd-f1deec72e3fc |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/RareProcess_forWinHost.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 30d;
let basic=materialize(
  SecurityEvent
    | where TimeGenerated between(lookback..endtime)
    | where EventID == 4688
    | summarize FullCount = count()
                , Count= countif(TimeGenerated between (starttime .. endtime))
                , min_TimeGenerated=min(TimeGenerated)
                , max_TimeGenerated=max(TimeGenerated)
                      by Computer, NewProcessName
    | where Count > 0 and Count < 100);
let basic_avg = basic
    | summarize Avg = avg(FullCount) by  NewProcessName;
basic | project-away FullCount
  | join kind=inner
basic_avg
  on NewProcessName | project-away NewProcessName1
  | where Count < 14 or (Count <= Avg*0.01 and Count < 100)
  | extend HostCustomEntity=Computer
```

## Hosts running a rare process

Looking for hosts running a rare process. Less than 1% of the average for 30 days and less than a count of 100 on a given host or less than a 14 count on a given host from the last 7 days

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 82e04ff9-a289-4005-9fcd-f1deec72e3fc |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/RareProcess_forWinHost.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 30d;
let basic=materialize(
  SecurityEvent
    | where TimeGenerated between(lookback..endtime)
    | where EventID == 4688
    | summarize FullCount = count()
                , Count= countif(TimeGenerated between (starttime .. endtime))
                , min_TimeGenerated=min(TimeGenerated)
                , max_TimeGenerated=max(TimeGenerated)
                      by Computer, NewProcessName
    | where Count > 0 and Count < 100);
let basic_avg = basic
    | summarize Avg = avg(FullCount) by  NewProcessName;
basic | project-away FullCount
  | join kind=inner
basic_avg
  on NewProcessName | project-away NewProcessName1
  | where Count < 14 or (Count <= Avg*0.01 and Count < 100)
  | extend HostCustomEntity=Computer
```

## Hosts running a rare process

Looking for hosts running a rare process. Less than 1% of the average for 30 days and less than a count of 100 on a given host or less than a 14 count on a given host from the last 7 days

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 82e04ff9-a289-4005-9fcd-f1deec72e3fc |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/RareProcess_forWinHost.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 30d;
let basic=materialize(
  SecurityEvent
    | where TimeGenerated between(lookback..endtime)
    | where EventID == 4688
    | summarize FullCount = count()
                , Count= countif(TimeGenerated between (starttime .. endtime))
                , min_TimeGenerated=min(TimeGenerated)
                , max_TimeGenerated=max(TimeGenerated)
                      by Computer, NewProcessName
    | where Count > 0 and Count < 100);
let basic_avg = basic
    | summarize Avg = avg(FullCount) by  NewProcessName;
basic | project-away FullCount
  | join kind=inner
basic_avg
  on NewProcessName | project-away NewProcessName1
  | where Count < 14 or (Count <= Avg*0.01 and Count < 100)
  | extend HostCustomEntity=Computer
```

## User created by unauthorized user

'User account created by an unauthorized user, pass in a list'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 42ae9690-89ce-4063-9a90-465badad5395 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/UserCreatedByUnauthorizedUser.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Create DataTable with your own values, example below shows dummy usernames that are authorized and for what domain
let List = datatable(AuthorizedUser:string, Domain:string)["Bob", "Domain", "joe", "domain", "MATT", "DOMAIN"];
SecurityEvent
| where EventID == 4720
| where AccountType == "User"
| join kind= leftanti (
    List
    | project SubjectUserName = tolower(AuthorizedUser), SubjectDomainName = toupper(Domain)
) on SubjectUserName, SubjectDomainName
| project TimeGenerated, Computer, Account, SubjectUserName, SubjectDomainName, TargetAccount, EventID, Activity
| extend timestamp = TimeGenerated, HostCustomEntity = Computer, AccountCustomEntity = Account

```

## User created by unauthorized user

'User account created by an unauthorized user, pass in a list'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 42ae9690-89ce-4063-9a90-465badad5395 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/UserCreatedByUnauthorizedUser.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Create DataTable with your own values, example below shows dummy usernames that are authorized and for what domain
let List = datatable(AuthorizedUser:string, Domain:string)["Bob", "Domain", "joe", "domain", "MATT", "DOMAIN"];
SecurityEvent
| where EventID == 4720
| where AccountType == "User"
| join kind= leftanti (
    List
    | project SubjectUserName = tolower(AuthorizedUser), SubjectDomainName = toupper(Domain)
) on SubjectUserName, SubjectDomainName
| project TimeGenerated, Computer, Account, SubjectUserName, SubjectDomainName, TargetAccount, EventID, Activity
| extend timestamp = TimeGenerated, HostCustomEntity = Computer, AccountCustomEntity = Account

```

## User created by unauthorized user

'User account created by an unauthorized user, pass in a list'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1098|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 42ae9690-89ce-4063-9a90-465badad5395 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/UserCreatedByUnauthorizedUser.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Create DataTable with your own values, example below shows dummy usernames that are authorized and for what domain
let List = datatable(AuthorizedUser:string, Domain:string)["Bob", "Domain", "joe", "domain", "MATT", "DOMAIN"];
SecurityEvent
| where EventID == 4720
| where AccountType == "User"
| join kind= leftanti (
    List
    | project SubjectUserName = tolower(AuthorizedUser), SubjectDomainName = toupper(Domain)
) on SubjectUserName, SubjectDomainName
| project TimeGenerated, Computer, Account, SubjectUserName, SubjectDomainName, TargetAccount, EventID, Activity
| extend timestamp = TimeGenerated, HostCustomEntity = Computer, AccountCustomEntity = Account

```

## User created by unauthorized user

'User account created by an unauthorized user, pass in a list'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 42ae9690-89ce-4063-9a90-465badad5395 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/UserCreatedByUnauthorizedUser.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Create DataTable with your own values, example below shows dummy usernames that are authorized and for what domain
let List = datatable(AuthorizedUser:string, Domain:string)["Bob", "Domain", "joe", "domain", "MATT", "DOMAIN"];
SecurityEvent
| where EventID == 4720
| where AccountType == "User"
| join kind= leftanti (
    List
    | project SubjectUserName = tolower(AuthorizedUser), SubjectDomainName = toupper(Domain)
) on SubjectUserName, SubjectDomainName
| project TimeGenerated, Computer, Account, SubjectUserName, SubjectDomainName, TargetAccount, EventID, Activity
| extend timestamp = TimeGenerated, HostCustomEntity = Computer, AccountCustomEntity = Account

```

## Exchange PowerShell Snapin Added

'The Exchange Powershell Snapin was loaded on a host, this allows for a Exchange server management via PowerShell. Whilst this is a legitimate administrative tool it is abused by attackers to performs actions on a compromised Exchange server. Hunt for unusual activity related to this Snapin including it being added on new hosts or by new accounts.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1119|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 8afd1086-fc9a-4d26-b3ff-5c794c79a59a |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/ExchangePowerShellSnapin.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
| where EventID == 4688
| where Process has_any ("cmd.exe", "powershell.exe", "PowerShell_ISE.exe")
| where isnotempty(CommandLine)
| where CommandLine contains "Add-PSSnapin Microsoft.Exchange.Management.Powershell.Snapin"
| summarize FirstSeen = min(TimeGenerated), LastSeen = max(TimeGenerated) by Computer, Account, CommandLine 
| extend timestamp = FirstSeen, AccountCustomEntity = Account, HostCustomEntity = Computer

```

## Remote Login Performed with WMI

'It detects authentication attempts performed with WMI. Adversaries may abuse WMI to execute malicious commands and payloads.
Ref: https://www.mandiant.com/resources/bypassing-network-restrictions-through-rdp-tunneling'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1047|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 8f658a80-7fa9-4524-a95b-d9ab608e8850 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/RemoteLoginPerformedwithWMI.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
   | where EventID in (4624,4625) and ProcessName endswith_cs "WmiPrvSE.exe"
   | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, TargetUserName, TargetLogonId, LogonTypeName, IpAddress, ProcessName

```

## Uncommon processes - bottom 5%

'Shows the rarest processes seen running for the first time. (Performs best over longer time ranges - eg 3+ days rather than 24 hours!)
These new processes could be benign new programs installed on hosts; 
However, especially in normally stable environments, these new processes could provide an indication of an unauthorized/malicious binary that has been installed and run. 
Reviewing the wider context of the logon sessions in which these binaries ran can provide a good starting point for identifying possible attacks.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 2ff4b10c-7056-4898-83fd-774104189fd5 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/uncommon_processes.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let ProcessCreationEvents=() {
let processEvents=SecurityEvent
| where EventID==4688
// filter out common randomly named files related to MSI installers and browsers
| where not(NewProcessName matches regex @"\\TRA[0-9A-Fa-f]{3}\.tmp")
| where not(NewProcessName matches regex @"\\TRA[0-9A-Fa-f]{4}\.tmp")
| where not(NewProcessName matches regex @"Installer\\MSI[0-9A-Fa-f]{3}\.tmp")
| where not(NewProcessName matches regex @"Installer\\MSI[0-9A-Fa-f]{4}\.tmp")
| project TimeGenerated, ComputerName=Computer, AccountName=SubjectUserName, AccountDomain=SubjectDomainName,
FileName=tostring(split(NewProcessName, '\\')[-1]), ProcessCommandLine = CommandLine, 
InitiatingProcessFileName=ParentProcessName, InitiatingProcessCommandLine="", InitiatingProcessParentFileName="";
processEvents;
};
let normalizedProcesses = ProcessCreationEvents 
// normalize guids
| project TimeGenerated, FileName = replace("[0-9A-Fa-f]{8}[-][0-9A-Fa-f]{4}[-][0-9A-Fa-f]{4}[-][0-9A-Fa-f]{4}[-][0-9A-Fa-f]{12}", "<guid>", FileName)
// normalize digits away
| project TimeGenerated, FileName=replace(@'\d', 'n', FileName); 
let freqs = normalizedProcesses
| summarize frequency=count() by FileName
| join kind= leftouter (
normalizedProcesses
| summarize Since=min(TimeGenerated), LastSeen=max(TimeGenerated) by FileName
) on FileName;
freqs 
| where frequency <= toscalar( freqs | serialize | project frequency | summarize percentiles(frequency, 5))
| order by frequency asc
| project FileName, frequency, Since, LastSeen 
// restrict results to unusual processes seen in last day 
| where LastSeen >= ago(1d)
| extend timestamp = LastSeen 

```

## Commands executed by WMI on new hosts - potential Impacket

'This query looks for hosts where commands are run via WMI, where this has not happened in the preceding 7 days. 
  It also filters to command line arguments associated with Impacket wmiexec. These filters can be adjusted to broaden or narrow hunting as required.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1047|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 9ce755c1-d2e6-4e2f-82d5-7871ec1aef91 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/CommandsexecutedbyWMIonnewhosts-potentialImpacket.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Remove items from the artifacts list in order to expand hunting
  let impacket_artifacts = dynamic(["cmd.exe", "/c", "2>&1", "127.0.0.1\\ADMIN$"]);
  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = starttime - 7d;
  let wmi_hosts = (SecurityEvent
  | where TimeGenerated between(lookback..starttime)
  | where EventID == 4688
  | where ParentProcessName endswith "wmiprvse.exe"
  | where CommandLine has_all (impacket_artifacts)
  | summarize by Computer);
  SecurityEvent
  | where TimeGenerated between(starttime..endtime)
  | where EventID == 4688
  | where Computer !in (wmi_hosts)
  | where ParentProcessName endswith "wmiprvse.exe"
  | where CommandLine has_all (impacket_artifacts)
  | project-reorder TimeGenerated, Computer, CommandLine, Account

```

## Commands executed by WMI on new hosts - potential Impacket

'This query looks for hosts where commands are run via WMI, where this has not happened in the preceding 7 days. 
  It also filters to command line arguments associated with Impacket wmiexec. These filters can be adjusted to broaden or narrow hunting as required.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1021.006|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 9ce755c1-d2e6-4e2f-82d5-7871ec1aef91 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/CommandsexecutedbyWMIonnewhosts-potentialImpacket.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Remove items from the artifacts list in order to expand hunting
  let impacket_artifacts = dynamic(["cmd.exe", "/c", "2>&1", "127.0.0.1\\ADMIN$"]);
  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = starttime - 7d;
  let wmi_hosts = (SecurityEvent
  | where TimeGenerated between(lookback..starttime)
  | where EventID == 4688
  | where ParentProcessName endswith "wmiprvse.exe"
  | where CommandLine has_all (impacket_artifacts)
  | summarize by Computer);
  SecurityEvent
  | where TimeGenerated between(starttime..endtime)
  | where EventID == 4688
  | where Computer !in (wmi_hosts)
  | where ParentProcessName endswith "wmiprvse.exe"
  | where CommandLine has_all (impacket_artifacts)
  | project-reorder TimeGenerated, Computer, CommandLine, Account

```

## Commands executed by WMI on new hosts - potential Impacket

'This query looks for hosts where commands are run via WMI, where this has not happened in the preceding 7 days. 
  It also filters to command line arguments associated with Impacket wmiexec. These filters can be adjusted to broaden or narrow hunting as required.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1047|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 9ce755c1-d2e6-4e2f-82d5-7871ec1aef91 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/CommandsexecutedbyWMIonnewhosts-potentialImpacket.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Remove items from the artifacts list in order to expand hunting
  let impacket_artifacts = dynamic(["cmd.exe", "/c", "2>&1", "127.0.0.1\\ADMIN$"]);
  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = starttime - 7d;
  let wmi_hosts = (SecurityEvent
  | where TimeGenerated between(lookback..starttime)
  | where EventID == 4688
  | where ParentProcessName endswith "wmiprvse.exe"
  | where CommandLine has_all (impacket_artifacts)
  | summarize by Computer);
  SecurityEvent
  | where TimeGenerated between(starttime..endtime)
  | where EventID == 4688
  | where Computer !in (wmi_hosts)
  | where ParentProcessName endswith "wmiprvse.exe"
  | where CommandLine has_all (impacket_artifacts)
  | project-reorder TimeGenerated, Computer, CommandLine, Account

```

## Commands executed by WMI on new hosts - potential Impacket

'This query looks for hosts where commands are run via WMI, where this has not happened in the preceding 7 days. 
  It also filters to command line arguments associated with Impacket wmiexec. These filters can be adjusted to broaden or narrow hunting as required.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1021.006|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 9ce755c1-d2e6-4e2f-82d5-7871ec1aef91 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/CommandsexecutedbyWMIonnewhosts-potentialImpacket.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Remove items from the artifacts list in order to expand hunting
  let impacket_artifacts = dynamic(["cmd.exe", "/c", "2>&1", "127.0.0.1\\ADMIN$"]);
  let starttime = todatetime('{{StartTimeISO}}');
  let endtime = todatetime('{{EndTimeISO}}');
  let lookback = starttime - 7d;
  let wmi_hosts = (SecurityEvent
  | where TimeGenerated between(lookback..starttime)
  | where EventID == 4688
  | where ParentProcessName endswith "wmiprvse.exe"
  | where CommandLine has_all (impacket_artifacts)
  | summarize by Computer);
  SecurityEvent
  | where TimeGenerated between(starttime..endtime)
  | where EventID == 4688
  | where Computer !in (wmi_hosts)
  | where ParentProcessName endswith "wmiprvse.exe"
  | where CommandLine has_all (impacket_artifacts)
  | project-reorder TimeGenerated, Computer, CommandLine, Account

```

## VIP account more than 6 failed logons in 10

'VIP Account with more than 6 failed logon attempts in 10 minutes, include your own VIP list in the table below'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1110|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | e8d36582-c403-4466-bd44-ebede5b6fa6e |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/VIPAccountFailedLogons.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Create DataTable with your own values, example below shows dummy usernames that are authorized and for what domain
let List = datatable(VIPUser:string, Domain:string)["Bob", "Domain", "joe", "domain", "MATT", "DOMAIN"];
List | extend Account = strcat(Domain,"\\",VIPUser) | join kind= inner (
SecurityEvent 
| where EventID == "4625"
| where AccountType == "User"
| where LogonType == "2" or LogonType == "3"
) on Account 
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), FailedVIPLogons = count() by LogonType, Account
| where FailedVIPLogons >= 6
| extend timestamp = StartTimeUtc, AccountCustomEntity = Account

```

## Long lookback User Account Created and Deleted within 10mins

'User account created and then deleted within 10 minutes across last 14 days'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 6135a90e-ba30-4f36-9b6a-3a350050704b |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/UserAccountCreatedDeleted.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// TimeDelta is the difference between when the account was created and when it was deleted, default is set to 10min or less
let timedelta = 10m;
SecurityEvent 
// A user account was created
| where EventID == "4720"
| where AccountType == "User"
| project creationTime = TimeGenerated, CreateEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, 
AccountUsedToCreate = SubjectUserName, TargetSid, SubjectUserSid 
| join kind= inner (
   SecurityEvent
   // A user account was deleted 
   | where EventID == "4726" 
| where AccountType == "User"
| project deletionTime = TimeGenerated, DeleteEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, 
AccountUsedToDelete = SubjectUserName, TargetSid, SubjectUserSid 
) on Computer, TargetUserName
| where deletionTime - creationTime < timedelta
| extend TimeDelta = deletionTime - creationTime
| where tolong(TimeDelta) >= 0
| project TimeDelta, creationTime, CreateEventID, Computer, TargetUserName, UserPrincipalName, AccountUsedToCreate, 
deletionTime, DeleteEventID, AccountUsedToDelete
| extend timestamp = creationTime, HostCustomEntity = Computer, AccountCustomEntity = UserPrincipalName

```

## Long lookback User Account Created and Deleted within 10mins

'User account created and then deleted within 10 minutes across last 14 days'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 6135a90e-ba30-4f36-9b6a-3a350050704b |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/UserAccountCreatedDeleted.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// TimeDelta is the difference between when the account was created and when it was deleted, default is set to 10min or less
let timedelta = 10m;
SecurityEvent 
// A user account was created
| where EventID == "4720"
| where AccountType == "User"
| project creationTime = TimeGenerated, CreateEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, 
AccountUsedToCreate = SubjectUserName, TargetSid, SubjectUserSid 
| join kind= inner (
   SecurityEvent
   // A user account was deleted 
   | where EventID == "4726" 
| where AccountType == "User"
| project deletionTime = TimeGenerated, DeleteEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, 
AccountUsedToDelete = SubjectUserName, TargetSid, SubjectUserSid 
) on Computer, TargetUserName
| where deletionTime - creationTime < timedelta
| extend TimeDelta = deletionTime - creationTime
| where tolong(TimeDelta) >= 0
| project TimeDelta, creationTime, CreateEventID, Computer, TargetUserName, UserPrincipalName, AccountUsedToCreate, 
deletionTime, DeleteEventID, AccountUsedToDelete
| extend timestamp = creationTime, HostCustomEntity = Computer, AccountCustomEntity = UserPrincipalName

```

## Long lookback User Account Created and Deleted within 10mins

'User account created and then deleted within 10 minutes across last 14 days'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1098|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 6135a90e-ba30-4f36-9b6a-3a350050704b |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/UserAccountCreatedDeleted.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// TimeDelta is the difference between when the account was created and when it was deleted, default is set to 10min or less
let timedelta = 10m;
SecurityEvent 
// A user account was created
| where EventID == "4720"
| where AccountType == "User"
| project creationTime = TimeGenerated, CreateEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, 
AccountUsedToCreate = SubjectUserName, TargetSid, SubjectUserSid 
| join kind= inner (
   SecurityEvent
   // A user account was deleted 
   | where EventID == "4726" 
| where AccountType == "User"
| project deletionTime = TimeGenerated, DeleteEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, 
AccountUsedToDelete = SubjectUserName, TargetSid, SubjectUserSid 
) on Computer, TargetUserName
| where deletionTime - creationTime < timedelta
| extend TimeDelta = deletionTime - creationTime
| where tolong(TimeDelta) >= 0
| project TimeDelta, creationTime, CreateEventID, Computer, TargetUserName, UserPrincipalName, AccountUsedToCreate, 
deletionTime, DeleteEventID, AccountUsedToDelete
| extend timestamp = creationTime, HostCustomEntity = Computer, AccountCustomEntity = UserPrincipalName

```

## Long lookback User Account Created and Deleted within 10mins

'User account created and then deleted within 10 minutes across last 14 days'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 6135a90e-ba30-4f36-9b6a-3a350050704b |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/UserAccountCreatedDeleted.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// TimeDelta is the difference between when the account was created and when it was deleted, default is set to 10min or less
let timedelta = 10m;
SecurityEvent 
// A user account was created
| where EventID == "4720"
| where AccountType == "User"
| project creationTime = TimeGenerated, CreateEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, 
AccountUsedToCreate = SubjectUserName, TargetSid, SubjectUserSid 
| join kind= inner (
   SecurityEvent
   // A user account was deleted 
   | where EventID == "4726" 
| where AccountType == "User"
| project deletionTime = TimeGenerated, DeleteEventID = EventID, Activity, Computer, TargetUserName, UserPrincipalName, 
AccountUsedToDelete = SubjectUserName, TargetSid, SubjectUserSid 
) on Computer, TargetUserName
| where deletionTime - creationTime < timedelta
| extend TimeDelta = deletionTime - creationTime
| where tolong(TimeDelta) >= 0
| project TimeDelta, creationTime, CreateEventID, Computer, TargetUserName, UserPrincipalName, AccountUsedToCreate, 
deletionTime, DeleteEventID, AccountUsedToDelete
| extend timestamp = creationTime, HostCustomEntity = Computer, AccountCustomEntity = UserPrincipalName

```

## Least Common Parent And Child Process Pairs

'Looks across your environment for least common Parent/Child process combinations.
Will possibly find some malicious activity disguised as well known process names.
By ZanCo'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 3712595d-6f47-416b-963a-605201ed2764 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Least_Common_Parent_Child_Process.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 7d;
let Allowlist = dynamic (['foo.exe', 'baz.exe']);
let Sensitivity = 5;
SecurityEvent
| where TimeGenerated between(lookback..endtime)
| where EventID == 4688 and isnotnull(ParentProcessName)
| extend ProcArray = split(NewProcessName, '\\'), ParentProcArray = split(ParentProcessName, '\\')
// ProcArrayLength is Folder Depth
| extend ProcArrayLength = arraylength(ProcArray), ParentProcArrayLength = arraylength(ParentProcArray)
| extend LastIndex = ProcArrayLength - 1, ParentLastIndex = ParentProcArrayLength - 1
| extend Proc = ProcArray[LastIndex], ParentProc = ParentProcArray[ParentLastIndex]
| where Proc !in (Allowlist)
| extend ParentChildPair = strcat(ParentProc , ' > ', Proc)
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), TimesSeen = count(), HostCount = dcount(Computer), Hosts = makeset(Computer), UserCount = dcount(SubjectUserName), Users = makeset(SubjectUserName) by ParentChildPair
| where TimesSeen < Sensitivity
| extend timestamp = StartTimeUtc

```
