# Rules: 5062-5082

## Service installation from user writable directory

'This query detects a service installation that is originated from a user writable directory.
Ref: https://attack.mitre.org/techniques/T1569/002/'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1569.002|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 5a9ccb48-1316-46e1-89d1-aca0355c305e |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/ServiceInstallationFromUsersWritableDirectory.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Enter a reference list for writable user paths"
let WritableUserPaths = dynamic (["\"C:\\Users\\","\"C:\\ProgramData\\"]);
Event
| where Source == "Service Control Manager" and EventID == 7045
| parse EventData with * 'ServiceName">' ServiceName "<" * 'ImagePath">' ImagePath "<" *
| where ImagePath has_any (WritableUserPaths)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, ImagePath, ServiceName, UserName

```

## Summary of failed user logons by reason of failure

'A summary of failed logons can be used to infer lateral movement with the intention of discovering credentials and sensitive data'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1110|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | e7642e6e-cf27-46ec-a4b9-e4475228fead |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/FailedUserLogons.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

SecurityEvent
| where AccountType == 'User' and EventID == 4625
| extend Reason = case(
SubStatus == '0xc000005e', 'No logon servers available to service the logon request',
SubStatus == '0xc0000062', 'Account name is not properly formatted',
SubStatus == '0xc0000064', 'Account name does not exist',
SubStatus == '0xc000006a', 'Incorrect password',    SubStatus == '0xc000006d', 'Bad user name or password',
SubStatus == '0xc000006f', 'User logon blocked by account restriction',
SubStatus == '0xc000006f', 'User logon outside of restricted logon hours',
SubStatus == '0xc0000070', 'User logon blocked by workstation restriction',
SubStatus == '0xc0000071', 'Password has expired',
SubStatus == '0xc0000072', 'Account is disabled',
SubStatus == '0xc0000133', 'Clocks between DC and other computer too far out of sync',
SubStatus == '0xc000015b', 'The user has not been granted the requested logon right at this machine',
SubStatus == '0xc0000193', 'Account has expirated',
SubStatus == '0xc0000224', 'User is required to change password at next logon',
SubStatus == '0xc0000234', 'Account is currently locked out',
strcat('Unknown reason substatus: ', SubStatus))
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Reason
| extend timestamp = StartTimeUtc

```

## Summary of failed user logons by reason of failure

'A summary of failed logons can be used to infer lateral movement with the intention of discovering credentials and sensitive data'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1110|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | e7642e6e-cf27-46ec-a4b9-e4475228fead |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/FailedUserLogons.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

SecurityEvent
| where AccountType == 'User' and EventID == 4625
| extend Reason = case(
SubStatus == '0xc000005e', 'No logon servers available to service the logon request',
SubStatus == '0xc0000062', 'Account name is not properly formatted',
SubStatus == '0xc0000064', 'Account name does not exist',
SubStatus == '0xc000006a', 'Incorrect password',    SubStatus == '0xc000006d', 'Bad user name or password',
SubStatus == '0xc000006f', 'User logon blocked by account restriction',
SubStatus == '0xc000006f', 'User logon outside of restricted logon hours',
SubStatus == '0xc0000070', 'User logon blocked by workstation restriction',
SubStatus == '0xc0000071', 'Password has expired',
SubStatus == '0xc0000072', 'Account is disabled',
SubStatus == '0xc0000133', 'Clocks between DC and other computer too far out of sync',
SubStatus == '0xc000015b', 'The user has not been granted the requested logon right at this machine',
SubStatus == '0xc0000193', 'Account has expirated',
SubStatus == '0xc0000224', 'User is required to change password at next logon',
SubStatus == '0xc0000234', 'Account is currently locked out',
strcat('Unknown reason substatus: ', SubStatus))
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Reason
| extend timestamp = StartTimeUtc

```

## Powercat Download

'Powercat is a PowerShell implementation of netcat. Whilst it can be used as a legitimate administrative tool it can be abused by attackers to exfiltrate data. This query looks for command line activity downloading PowerCat.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1011|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 58fe8fc8-54fa-48cd-bac3-197f8d862429 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/PowerCatDownload.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
| where EventID == 4688
| where Process has_any ("cmd.exe", "powershell.exe", "PowerShell_ISE.exe")
| where CommandLine hassuffix "powercat.ps1"
| extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer

```

## Summary of user logons by logon type

'Comparing succesful and nonsuccessful logon attempts can be used to identify attempts to move laterally within the 
environment with the intention of discovering credentials and sensitive data.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1110|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | d0f13bb9-e713-4f89-b610-1806326a1dea |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/User%20Logons%20By%20Logon%20Type.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

SecurityEvent
| where EventID in (4624, 4625)
| where AccountType == 'User' 
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), Amount = count() by LogonTypeName
| extend timestamp = StartTimeUtc
```

## Summary of user logons by logon type

'Comparing succesful and nonsuccessful logon attempts can be used to identify attempts to move laterally within the 
environment with the intention of discovering credentials and sensitive data.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1110|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | d0f13bb9-e713-4f89-b610-1806326a1dea |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/User%20Logons%20By%20Logon%20Type.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

SecurityEvent
| where EventID in (4624, 4625)
| where AccountType == 'User' 
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), Amount = count() by LogonTypeName
| extend timestamp = StartTimeUtc
```

## Potential Impacket Execution

'This hunting query identifies execution of Impacket tool. Impacket is a popular tool used by attackers for remote service execution, Kerberos manipulation and Windows credential dumping.
 Refrence: https://twitter.com/SBousseaden/status/1286750095296335883'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1003|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 24ae555c-5e33-4b5d-827a-44206e39f6b4 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/PotentialImpacketExecution.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
(union isfuzzy=true
(SecurityEvent
| where EventID == '5145'
| where RelativeTargetName has 'SYSTEM32' and RelativeTargetName endswith @".tmp"
| where ShareName has "\\\\*\\ADMIN$"
),
(WindowsEvent
| where EventID == '5145' 
| extend RelativeTargetName= tostring(EventData.RelativeTargetName)
| extend ShareName= tostring(EventData.ShareName)
| where RelativeTargetName has 'SYSTEM32' and RelativeTargetName endswith @".tmp"
| where ShareName has "\\\\*\\ADMIN$"
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
)
)
| extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer

```

## Potential Impacket Execution

'This hunting query identifies execution of Impacket tool. Impacket is a popular tool used by attackers for remote service execution, Kerberos manipulation and Windows credential dumping.
 Refrence: https://twitter.com/SBousseaden/status/1286750095296335883'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1003|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | WindowsSecurityEvents |
|DetectionId | 24ae555c-5e33-4b5d-827a-44206e39f6b4 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/PotentialImpacketExecution.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
(union isfuzzy=true
(SecurityEvent
| where EventID == '5145'
| where RelativeTargetName has 'SYSTEM32' and RelativeTargetName endswith @".tmp"
| where ShareName has "\\\\*\\ADMIN$"
),
(WindowsEvent
| where EventID == '5145' 
| extend RelativeTargetName= tostring(EventData.RelativeTargetName)
| extend ShareName= tostring(EventData.ShareName)
| where RelativeTargetName has 'SYSTEM32' and RelativeTargetName endswith @".tmp"
| where ShareName has "\\\\*\\ADMIN$"
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
)
)
| extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer

```

## External IP address in Command Line

'This query looks for command lines that contain a public IP address. Attackers may use a hard coded IP for C2 or exfiltration.
  This query can be filtered to exclude network prefixes that are known to be legitimate.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1041|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 2f6032ac-bb18-48b0-855a-7b05cf074957 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/ExternalIPaddressinCommandLine.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Add any expected range prefixes here
  let exclusion_ranges = dynamic([""]);
  let ipv4_regex = "([^ ](\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}|(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ])";
  let processes = dynamic(["cmd.exe", "powershell"]);
  SecurityEvent
  | where EventID == 4688
  | where Process has_any(processes)
  | extend IP = extract(ipv4_regex, 1, CommandLine)
  | where isnotempty(IP)
  | where not(ipv4_is_private(IP))
  | where not(has_any_ipv4_prefix(IP, exclusion_ranges))
  | summarize FirstSeen=min(TimeGenerated), LastSeen=max(TimeGenerated), Hosts=makeset(Computer), Accounts=makeset(Account) by IP, CommandLine, Process
  | extend Host_count = array_length(Hosts)
  | sort by Host_count desc
  | project-reorder Host_count, IP, Process, CommandLine

```

## External IP address in Command Line

'This query looks for command lines that contain a public IP address. Attackers may use a hard coded IP for C2 or exfiltration.
  This query can be filtered to exclude network prefixes that are known to be legitimate.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 2f6032ac-bb18-48b0-855a-7b05cf074957 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/ExternalIPaddressinCommandLine.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Add any expected range prefixes here
  let exclusion_ranges = dynamic([""]);
  let ipv4_regex = "([^ ](\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}|(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ])";
  let processes = dynamic(["cmd.exe", "powershell"]);
  SecurityEvent
  | where EventID == 4688
  | where Process has_any(processes)
  | extend IP = extract(ipv4_regex, 1, CommandLine)
  | where isnotempty(IP)
  | where not(ipv4_is_private(IP))
  | where not(has_any_ipv4_prefix(IP, exclusion_ranges))
  | summarize FirstSeen=min(TimeGenerated), LastSeen=max(TimeGenerated), Hosts=makeset(Computer), Accounts=makeset(Account) by IP, CommandLine, Process
  | extend Host_count = array_length(Hosts)
  | sort by Host_count desc
  | project-reorder Host_count, IP, Process, CommandLine

```

## External IP address in Command Line

'This query looks for command lines that contain a public IP address. Attackers may use a hard coded IP for C2 or exfiltration.
  This query can be filtered to exclude network prefixes that are known to be legitimate.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1041|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 2f6032ac-bb18-48b0-855a-7b05cf074957 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/ExternalIPaddressinCommandLine.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Add any expected range prefixes here
  let exclusion_ranges = dynamic([""]);
  let ipv4_regex = "([^ ](\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}|(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ])";
  let processes = dynamic(["cmd.exe", "powershell"]);
  SecurityEvent
  | where EventID == 4688
  | where Process has_any(processes)
  | extend IP = extract(ipv4_regex, 1, CommandLine)
  | where isnotempty(IP)
  | where not(ipv4_is_private(IP))
  | where not(has_any_ipv4_prefix(IP, exclusion_ranges))
  | summarize FirstSeen=min(TimeGenerated), LastSeen=max(TimeGenerated), Hosts=makeset(Computer), Accounts=makeset(Account) by IP, CommandLine, Process
  | extend Host_count = array_length(Hosts)
  | sort by Host_count desc
  | project-reorder Host_count, IP, Process, CommandLine

```

## External IP address in Command Line

'This query looks for command lines that contain a public IP address. Attackers may use a hard coded IP for C2 or exfiltration.
  This query can be filtered to exclude network prefixes that are known to be legitimate.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1071|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 2f6032ac-bb18-48b0-855a-7b05cf074957 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/ExternalIPaddressinCommandLine.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Add any expected range prefixes here
  let exclusion_ranges = dynamic([""]);
  let ipv4_regex = "([^ ](\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}|(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ])";
  let processes = dynamic(["cmd.exe", "powershell"]);
  SecurityEvent
  | where EventID == 4688
  | where Process has_any(processes)
  | extend IP = extract(ipv4_regex, 1, CommandLine)
  | where isnotempty(IP)
  | where not(ipv4_is_private(IP))
  | where not(has_any_ipv4_prefix(IP, exclusion_ranges))
  | summarize FirstSeen=min(TimeGenerated), LastSeen=max(TimeGenerated), Hosts=makeset(Computer), Accounts=makeset(Account) by IP, CommandLine, Process
  | extend Host_count = array_length(Hosts)
  | sort by Host_count desc
  | project-reorder Host_count, IP, Process, CommandLine

```

## Risky base64 encoded command in URL

'This hunting query will detect risky base64 encoded commands are seen in web requests. Some threat actors transmit base64 commands from the target host
back to the C2 servers so they know which command has been executed. This query also reguarly illumniates base64 encoded webshells being injected.
The limitation of this query is that base64 is case sensitive, so different case versions of each command need generating for full coverage. This query
computes base64 permutations for each command, resulting in 3 possible permutations depending on padding.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071.001|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | Zscaler |
|DetectionId | c46eeb45-c324-4a84-9df1-248c6d1507bb |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/RiskyCommandB64EncodedInUrl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let mapping = datatable (CommandFound:string, match_list:dynamic) [
"whoami", dynamic(['d2hvYW1p', 'dob2Fta', '3aG9hbW']),
"net share", dynamic(['bmV0IHNoYXJl', '5ldCBzaGFyZ', 'uZXQgc2hhcm']),
"net use", dynamic(['bmV0IHVzZ', '5ldCB1c2', 'uZXQgdXNl']),
"net view", dynamic(['bmV0IHZpZX', '5ldCB2aWV3', 'uZXQgdmlld']),
"ipconfig", dynamic(['aXBjb25maWc', 'lwY29uZmln', 'pcGNvbmZpZ']),
"net sh", dynamic(['bmV0c2gg', '5ldHNoI', 'uZXRzaC']),
"schtasks", dynamic(['2NodGFza3', 'NjaHRhc2tz', 'zY2h0YXNrc']),
"Invoke- ", dynamic(['SW52b2tlL', 'ludm9rZS', 'JbnZva2Ut']),
];
let riskyCommandRegex = @"(d2hvYW1p|dob2Fta|3aG9hbW|bmV0IHNoYXJl|5ldCBzaGFyZ|uZXQgc2hhcm|bmV0IHVzZ|5ldCB1c2|uZXQgdXNl|bmV0IHZpZX|5ldCB2aWV3|uZXQgdmlld|aXBjb25maWc|lwY29uZmln|pcGNvbmZpZ|bmV0c2gg|5ldHNoI|uZXRzaC|2NodGFza3|NjaHRhc2tz|zY2h0YXNrc|SW52b2tlL|ludm9rZS|JbnZva2Ut)";
CommonSecurityLog
| where TimeGenerated > ago(3d)
| where RequestURL matches regex riskyCommandRegex
| extend B64MatchData = extract_all(riskyCommandRegex, RequestURL)
| where isnotempty(B64MatchData)
| mv-expand B64MatchData to typeof(string)
| join kind=leftouter ( 
    mapping
    | mv-expand match_list to typeof(string)
) on $left.B64MatchData == $right.match_list
| project TimeGenerated, B64MatchData, CommandFound, RequestURL, RequestMethod, DestinationHostName, DestinationIP, SourceIP, DeviceVendor, DeviceProduct, Activity
| extend timestamp = TimeGenerated, DomainCustomEntity = DestinationHostName, IPCustomEntity = DestinationIP

```

## Risky base64 encoded command in URL

'This hunting query will detect risky base64 encoded commands are seen in web requests. Some threat actors transmit base64 commands from the target host
back to the C2 servers so they know which command has been executed. This query also reguarly illumniates base64 encoded webshells being injected.
The limitation of this query is that base64 is case sensitive, so different case versions of each command need generating for full coverage. This query
computes base64 permutations for each command, resulting in 3 possible permutations depending on padding.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071.001|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | Zscaler |
|DetectionId | c46eeb45-c324-4a84-9df1-248c6d1507bb |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/RiskyCommandB64EncodedInUrl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let mapping = datatable (CommandFound:string, match_list:dynamic) [
"whoami", dynamic(['d2hvYW1p', 'dob2Fta', '3aG9hbW']),
"net share", dynamic(['bmV0IHNoYXJl', '5ldCBzaGFyZ', 'uZXQgc2hhcm']),
"net use", dynamic(['bmV0IHVzZ', '5ldCB1c2', 'uZXQgdXNl']),
"net view", dynamic(['bmV0IHZpZX', '5ldCB2aWV3', 'uZXQgdmlld']),
"ipconfig", dynamic(['aXBjb25maWc', 'lwY29uZmln', 'pcGNvbmZpZ']),
"net sh", dynamic(['bmV0c2gg', '5ldHNoI', 'uZXRzaC']),
"schtasks", dynamic(['2NodGFza3', 'NjaHRhc2tz', 'zY2h0YXNrc']),
"Invoke- ", dynamic(['SW52b2tlL', 'ludm9rZS', 'JbnZva2Ut']),
];
let riskyCommandRegex = @"(d2hvYW1p|dob2Fta|3aG9hbW|bmV0IHNoYXJl|5ldCBzaGFyZ|uZXQgc2hhcm|bmV0IHVzZ|5ldCB1c2|uZXQgdXNl|bmV0IHZpZX|5ldCB2aWV3|uZXQgdmlld|aXBjb25maWc|lwY29uZmln|pcGNvbmZpZ|bmV0c2gg|5ldHNoI|uZXRzaC|2NodGFza3|NjaHRhc2tz|zY2h0YXNrc|SW52b2tlL|ludm9rZS|JbnZva2Ut)";
CommonSecurityLog
| where TimeGenerated > ago(3d)
| where RequestURL matches regex riskyCommandRegex
| extend B64MatchData = extract_all(riskyCommandRegex, RequestURL)
| where isnotempty(B64MatchData)
| mv-expand B64MatchData to typeof(string)
| join kind=leftouter ( 
    mapping
    | mv-expand match_list to typeof(string)
) on $left.B64MatchData == $right.match_list
| project TimeGenerated, B64MatchData, CommandFound, RequestURL, RequestMethod, DestinationHostName, DestinationIP, SourceIP, DeviceVendor, DeviceProduct, Activity
| extend timestamp = TimeGenerated, DomainCustomEntity = DestinationHostName, IPCustomEntity = DestinationIP

```

## Risky base64 encoded command in URL

'This hunting query will detect risky base64 encoded commands are seen in web requests. Some threat actors transmit base64 commands from the target host
back to the C2 servers so they know which command has been executed. This query also reguarly illumniates base64 encoded webshells being injected.
The limitation of this query is that base64 is case sensitive, so different case versions of each command need generating for full coverage. This query
computes base64 permutations for each command, resulting in 3 possible permutations depending on padding.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071.001|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | Zscaler |
|DetectionId | c46eeb45-c324-4a84-9df1-248c6d1507bb |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/RiskyCommandB64EncodedInUrl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let mapping = datatable (CommandFound:string, match_list:dynamic) [
"whoami", dynamic(['d2hvYW1p', 'dob2Fta', '3aG9hbW']),
"net share", dynamic(['bmV0IHNoYXJl', '5ldCBzaGFyZ', 'uZXQgc2hhcm']),
"net use", dynamic(['bmV0IHVzZ', '5ldCB1c2', 'uZXQgdXNl']),
"net view", dynamic(['bmV0IHZpZX', '5ldCB2aWV3', 'uZXQgdmlld']),
"ipconfig", dynamic(['aXBjb25maWc', 'lwY29uZmln', 'pcGNvbmZpZ']),
"net sh", dynamic(['bmV0c2gg', '5ldHNoI', 'uZXRzaC']),
"schtasks", dynamic(['2NodGFza3', 'NjaHRhc2tz', 'zY2h0YXNrc']),
"Invoke- ", dynamic(['SW52b2tlL', 'ludm9rZS', 'JbnZva2Ut']),
];
let riskyCommandRegex = @"(d2hvYW1p|dob2Fta|3aG9hbW|bmV0IHNoYXJl|5ldCBzaGFyZ|uZXQgc2hhcm|bmV0IHVzZ|5ldCB1c2|uZXQgdXNl|bmV0IHZpZX|5ldCB2aWV3|uZXQgdmlld|aXBjb25maWc|lwY29uZmln|pcGNvbmZpZ|bmV0c2gg|5ldHNoI|uZXRzaC|2NodGFza3|NjaHRhc2tz|zY2h0YXNrc|SW52b2tlL|ludm9rZS|JbnZva2Ut)";
CommonSecurityLog
| where TimeGenerated > ago(3d)
| where RequestURL matches regex riskyCommandRegex
| extend B64MatchData = extract_all(riskyCommandRegex, RequestURL)
| where isnotempty(B64MatchData)
| mv-expand B64MatchData to typeof(string)
| join kind=leftouter ( 
    mapping
    | mv-expand match_list to typeof(string)
) on $left.B64MatchData == $right.match_list
| project TimeGenerated, B64MatchData, CommandFound, RequestURL, RequestMethod, DestinationHostName, DestinationIP, SourceIP, DeviceVendor, DeviceProduct, Activity
| extend timestamp = TimeGenerated, DomainCustomEntity = DestinationHostName, IPCustomEntity = DestinationIP

```

## Risky base64 encoded command in URL

'This hunting query will detect risky base64 encoded commands are seen in web requests. Some threat actors transmit base64 commands from the target host
back to the C2 servers so they know which command has been executed. This query also reguarly illumniates base64 encoded webshells being injected.
The limitation of this query is that base64 is case sensitive, so different case versions of each command need generating for full coverage. This query
computes base64 permutations for each command, resulting in 3 possible permutations depending on padding.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071.001|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | Fortinet |
|DetectionId | c46eeb45-c324-4a84-9df1-248c6d1507bb |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/RiskyCommandB64EncodedInUrl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let mapping = datatable (CommandFound:string, match_list:dynamic) [
"whoami", dynamic(['d2hvYW1p', 'dob2Fta', '3aG9hbW']),
"net share", dynamic(['bmV0IHNoYXJl', '5ldCBzaGFyZ', 'uZXQgc2hhcm']),
"net use", dynamic(['bmV0IHVzZ', '5ldCB1c2', 'uZXQgdXNl']),
"net view", dynamic(['bmV0IHZpZX', '5ldCB2aWV3', 'uZXQgdmlld']),
"ipconfig", dynamic(['aXBjb25maWc', 'lwY29uZmln', 'pcGNvbmZpZ']),
"net sh", dynamic(['bmV0c2gg', '5ldHNoI', 'uZXRzaC']),
"schtasks", dynamic(['2NodGFza3', 'NjaHRhc2tz', 'zY2h0YXNrc']),
"Invoke- ", dynamic(['SW52b2tlL', 'ludm9rZS', 'JbnZva2Ut']),
];
let riskyCommandRegex = @"(d2hvYW1p|dob2Fta|3aG9hbW|bmV0IHNoYXJl|5ldCBzaGFyZ|uZXQgc2hhcm|bmV0IHVzZ|5ldCB1c2|uZXQgdXNl|bmV0IHZpZX|5ldCB2aWV3|uZXQgdmlld|aXBjb25maWc|lwY29uZmln|pcGNvbmZpZ|bmV0c2gg|5ldHNoI|uZXRzaC|2NodGFza3|NjaHRhc2tz|zY2h0YXNrc|SW52b2tlL|ludm9rZS|JbnZva2Ut)";
CommonSecurityLog
| where TimeGenerated > ago(3d)
| where RequestURL matches regex riskyCommandRegex
| extend B64MatchData = extract_all(riskyCommandRegex, RequestURL)
| where isnotempty(B64MatchData)
| mv-expand B64MatchData to typeof(string)
| join kind=leftouter ( 
    mapping
    | mv-expand match_list to typeof(string)
) on $left.B64MatchData == $right.match_list
| project TimeGenerated, B64MatchData, CommandFound, RequestURL, RequestMethod, DestinationHostName, DestinationIP, SourceIP, DeviceVendor, DeviceProduct, Activity
| extend timestamp = TimeGenerated, DomainCustomEntity = DestinationHostName, IPCustomEntity = DestinationIP

```

## Risky base64 encoded command in URL

'This hunting query will detect risky base64 encoded commands are seen in web requests. Some threat actors transmit base64 commands from the target host
back to the C2 servers so they know which command has been executed. This query also reguarly illumniates base64 encoded webshells being injected.
The limitation of this query is that base64 is case sensitive, so different case versions of each command need generating for full coverage. This query
computes base64 permutations for each command, resulting in 3 possible permutations depending on padding.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071.001|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | Fortinet |
|DetectionId | c46eeb45-c324-4a84-9df1-248c6d1507bb |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/RiskyCommandB64EncodedInUrl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let mapping = datatable (CommandFound:string, match_list:dynamic) [
"whoami", dynamic(['d2hvYW1p', 'dob2Fta', '3aG9hbW']),
"net share", dynamic(['bmV0IHNoYXJl', '5ldCBzaGFyZ', 'uZXQgc2hhcm']),
"net use", dynamic(['bmV0IHVzZ', '5ldCB1c2', 'uZXQgdXNl']),
"net view", dynamic(['bmV0IHZpZX', '5ldCB2aWV3', 'uZXQgdmlld']),
"ipconfig", dynamic(['aXBjb25maWc', 'lwY29uZmln', 'pcGNvbmZpZ']),
"net sh", dynamic(['bmV0c2gg', '5ldHNoI', 'uZXRzaC']),
"schtasks", dynamic(['2NodGFza3', 'NjaHRhc2tz', 'zY2h0YXNrc']),
"Invoke- ", dynamic(['SW52b2tlL', 'ludm9rZS', 'JbnZva2Ut']),
];
let riskyCommandRegex = @"(d2hvYW1p|dob2Fta|3aG9hbW|bmV0IHNoYXJl|5ldCBzaGFyZ|uZXQgc2hhcm|bmV0IHVzZ|5ldCB1c2|uZXQgdXNl|bmV0IHZpZX|5ldCB2aWV3|uZXQgdmlld|aXBjb25maWc|lwY29uZmln|pcGNvbmZpZ|bmV0c2gg|5ldHNoI|uZXRzaC|2NodGFza3|NjaHRhc2tz|zY2h0YXNrc|SW52b2tlL|ludm9rZS|JbnZva2Ut)";
CommonSecurityLog
| where TimeGenerated > ago(3d)
| where RequestURL matches regex riskyCommandRegex
| extend B64MatchData = extract_all(riskyCommandRegex, RequestURL)
| where isnotempty(B64MatchData)
| mv-expand B64MatchData to typeof(string)
| join kind=leftouter ( 
    mapping
    | mv-expand match_list to typeof(string)
) on $left.B64MatchData == $right.match_list
| project TimeGenerated, B64MatchData, CommandFound, RequestURL, RequestMethod, DestinationHostName, DestinationIP, SourceIP, DeviceVendor, DeviceProduct, Activity
| extend timestamp = TimeGenerated, DomainCustomEntity = DestinationHostName, IPCustomEntity = DestinationIP

```

## Risky base64 encoded command in URL

'This hunting query will detect risky base64 encoded commands are seen in web requests. Some threat actors transmit base64 commands from the target host
back to the C2 servers so they know which command has been executed. This query also reguarly illumniates base64 encoded webshells being injected.
The limitation of this query is that base64 is case sensitive, so different case versions of each command need generating for full coverage. This query
computes base64 permutations for each command, resulting in 3 possible permutations depending on padding.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071.001|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | Fortinet |
|DetectionId | c46eeb45-c324-4a84-9df1-248c6d1507bb |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/RiskyCommandB64EncodedInUrl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let mapping = datatable (CommandFound:string, match_list:dynamic) [
"whoami", dynamic(['d2hvYW1p', 'dob2Fta', '3aG9hbW']),
"net share", dynamic(['bmV0IHNoYXJl', '5ldCBzaGFyZ', 'uZXQgc2hhcm']),
"net use", dynamic(['bmV0IHVzZ', '5ldCB1c2', 'uZXQgdXNl']),
"net view", dynamic(['bmV0IHZpZX', '5ldCB2aWV3', 'uZXQgdmlld']),
"ipconfig", dynamic(['aXBjb25maWc', 'lwY29uZmln', 'pcGNvbmZpZ']),
"net sh", dynamic(['bmV0c2gg', '5ldHNoI', 'uZXRzaC']),
"schtasks", dynamic(['2NodGFza3', 'NjaHRhc2tz', 'zY2h0YXNrc']),
"Invoke- ", dynamic(['SW52b2tlL', 'ludm9rZS', 'JbnZva2Ut']),
];
let riskyCommandRegex = @"(d2hvYW1p|dob2Fta|3aG9hbW|bmV0IHNoYXJl|5ldCBzaGFyZ|uZXQgc2hhcm|bmV0IHVzZ|5ldCB1c2|uZXQgdXNl|bmV0IHZpZX|5ldCB2aWV3|uZXQgdmlld|aXBjb25maWc|lwY29uZmln|pcGNvbmZpZ|bmV0c2gg|5ldHNoI|uZXRzaC|2NodGFza3|NjaHRhc2tz|zY2h0YXNrc|SW52b2tlL|ludm9rZS|JbnZva2Ut)";
CommonSecurityLog
| where TimeGenerated > ago(3d)
| where RequestURL matches regex riskyCommandRegex
| extend B64MatchData = extract_all(riskyCommandRegex, RequestURL)
| where isnotempty(B64MatchData)
| mv-expand B64MatchData to typeof(string)
| join kind=leftouter ( 
    mapping
    | mv-expand match_list to typeof(string)
) on $left.B64MatchData == $right.match_list
| project TimeGenerated, B64MatchData, CommandFound, RequestURL, RequestMethod, DestinationHostName, DestinationIP, SourceIP, DeviceVendor, DeviceProduct, Activity
| extend timestamp = TimeGenerated, DomainCustomEntity = DestinationHostName, IPCustomEntity = DestinationIP

```

## Risky base64 encoded command in URL

'This hunting query will detect risky base64 encoded commands are seen in web requests. Some threat actors transmit base64 commands from the target host
back to the C2 servers so they know which command has been executed. This query also reguarly illumniates base64 encoded webshells being injected.
The limitation of this query is that base64 is case sensitive, so different case versions of each command need generating for full coverage. This query
computes base64 permutations for each command, resulting in 3 possible permutations depending on padding.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071.001|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | CheckPoint |
|DetectionId | c46eeb45-c324-4a84-9df1-248c6d1507bb |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/RiskyCommandB64EncodedInUrl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let mapping = datatable (CommandFound:string, match_list:dynamic) [
"whoami", dynamic(['d2hvYW1p', 'dob2Fta', '3aG9hbW']),
"net share", dynamic(['bmV0IHNoYXJl', '5ldCBzaGFyZ', 'uZXQgc2hhcm']),
"net use", dynamic(['bmV0IHVzZ', '5ldCB1c2', 'uZXQgdXNl']),
"net view", dynamic(['bmV0IHZpZX', '5ldCB2aWV3', 'uZXQgdmlld']),
"ipconfig", dynamic(['aXBjb25maWc', 'lwY29uZmln', 'pcGNvbmZpZ']),
"net sh", dynamic(['bmV0c2gg', '5ldHNoI', 'uZXRzaC']),
"schtasks", dynamic(['2NodGFza3', 'NjaHRhc2tz', 'zY2h0YXNrc']),
"Invoke- ", dynamic(['SW52b2tlL', 'ludm9rZS', 'JbnZva2Ut']),
];
let riskyCommandRegex = @"(d2hvYW1p|dob2Fta|3aG9hbW|bmV0IHNoYXJl|5ldCBzaGFyZ|uZXQgc2hhcm|bmV0IHVzZ|5ldCB1c2|uZXQgdXNl|bmV0IHZpZX|5ldCB2aWV3|uZXQgdmlld|aXBjb25maWc|lwY29uZmln|pcGNvbmZpZ|bmV0c2gg|5ldHNoI|uZXRzaC|2NodGFza3|NjaHRhc2tz|zY2h0YXNrc|SW52b2tlL|ludm9rZS|JbnZva2Ut)";
CommonSecurityLog
| where TimeGenerated > ago(3d)
| where RequestURL matches regex riskyCommandRegex
| extend B64MatchData = extract_all(riskyCommandRegex, RequestURL)
| where isnotempty(B64MatchData)
| mv-expand B64MatchData to typeof(string)
| join kind=leftouter ( 
    mapping
    | mv-expand match_list to typeof(string)
) on $left.B64MatchData == $right.match_list
| project TimeGenerated, B64MatchData, CommandFound, RequestURL, RequestMethod, DestinationHostName, DestinationIP, SourceIP, DeviceVendor, DeviceProduct, Activity
| extend timestamp = TimeGenerated, DomainCustomEntity = DestinationHostName, IPCustomEntity = DestinationIP

```

## Risky base64 encoded command in URL

'This hunting query will detect risky base64 encoded commands are seen in web requests. Some threat actors transmit base64 commands from the target host
back to the C2 servers so they know which command has been executed. This query also reguarly illumniates base64 encoded webshells being injected.
The limitation of this query is that base64 is case sensitive, so different case versions of each command need generating for full coverage. This query
computes base64 permutations for each command, resulting in 3 possible permutations depending on padding.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071.001|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | CheckPoint |
|DetectionId | c46eeb45-c324-4a84-9df1-248c6d1507bb |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/RiskyCommandB64EncodedInUrl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let mapping = datatable (CommandFound:string, match_list:dynamic) [
"whoami", dynamic(['d2hvYW1p', 'dob2Fta', '3aG9hbW']),
"net share", dynamic(['bmV0IHNoYXJl', '5ldCBzaGFyZ', 'uZXQgc2hhcm']),
"net use", dynamic(['bmV0IHVzZ', '5ldCB1c2', 'uZXQgdXNl']),
"net view", dynamic(['bmV0IHZpZX', '5ldCB2aWV3', 'uZXQgdmlld']),
"ipconfig", dynamic(['aXBjb25maWc', 'lwY29uZmln', 'pcGNvbmZpZ']),
"net sh", dynamic(['bmV0c2gg', '5ldHNoI', 'uZXRzaC']),
"schtasks", dynamic(['2NodGFza3', 'NjaHRhc2tz', 'zY2h0YXNrc']),
"Invoke- ", dynamic(['SW52b2tlL', 'ludm9rZS', 'JbnZva2Ut']),
];
let riskyCommandRegex = @"(d2hvYW1p|dob2Fta|3aG9hbW|bmV0IHNoYXJl|5ldCBzaGFyZ|uZXQgc2hhcm|bmV0IHVzZ|5ldCB1c2|uZXQgdXNl|bmV0IHZpZX|5ldCB2aWV3|uZXQgdmlld|aXBjb25maWc|lwY29uZmln|pcGNvbmZpZ|bmV0c2gg|5ldHNoI|uZXRzaC|2NodGFza3|NjaHRhc2tz|zY2h0YXNrc|SW52b2tlL|ludm9rZS|JbnZva2Ut)";
CommonSecurityLog
| where TimeGenerated > ago(3d)
| where RequestURL matches regex riskyCommandRegex
| extend B64MatchData = extract_all(riskyCommandRegex, RequestURL)
| where isnotempty(B64MatchData)
| mv-expand B64MatchData to typeof(string)
| join kind=leftouter ( 
    mapping
    | mv-expand match_list to typeof(string)
) on $left.B64MatchData == $right.match_list
| project TimeGenerated, B64MatchData, CommandFound, RequestURL, RequestMethod, DestinationHostName, DestinationIP, SourceIP, DeviceVendor, DeviceProduct, Activity
| extend timestamp = TimeGenerated, DomainCustomEntity = DestinationHostName, IPCustomEntity = DestinationIP

```
