# Rules: 4936-4956

## Powershell or non-browser mailbox login activity

'This will help you determine if mailbox login was done from Exchange Powershell session. 
By default, all accounts you create in Office 365 are allowed to use Exchange Online PowerShell. 
Administrators can use Exchange Online PowerShell to enable or disable a user's ability to connect to Exchange Online PowerShell.
Whitelist any benign scheduled activities using exchange powershell if applicable in your environment.
References: https://docs.microsoft.com/powershell/exchange/exchange-online/connect-to-exchange-online-powershell/connect-to-exchange-online-powershell?view=exchange-ps'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1114|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 49a4f65a-fe18-408e-afec-042fde93d3ce |
|DataTypes | OfficeActivity (Exchange) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/powershell_or_nonbrowser_MailboxLogin.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity
| where Operation == "MailboxLogin"
| where ClientInfoString == "Client=Microsoft.Exchange.Powershell; Microsoft WinRM Client"
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by Operation, OrganizationName, UserType, UserId, MailboxOwnerUPN, Logon_Type, ClientInfoString
| extend timestamp = StartTime, AccountCustomEntity = UserId

```

## User added to Team and immediately uploads file

'This hunting queries identifies users who are added to a Team or Teams chat
and within 1 minute of being added upload a file via the chat. This might be
an indicator of suspicious activity.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1566|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 3d6d0c04-7337-40cf-ace6-c471d442356d |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/UserAddToTeamsAndUploadsFile.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1m;
OfficeActivity
| where OfficeWorkload =~ "MicrosoftTeams"
| where Operation == "MemberAdded"
| extend TeamName = iff(isempty(TeamName), Members[0].UPN, TeamName)
| project TimeGenerated, UploaderID=UserId, TeamName
| join (
  OfficeActivity
  | where RecordType == "SharePointFileOperation"
  | where SourceRelativeUrl has "Microsoft Teams Chat Files"
  | where Operation == "FileUploaded"
  | project UploadTime=TimeGenerated, UploaderID=UserId, FileLocation=OfficeObjectId, FileName=SourceFileName
  ) on UploaderID
| where UploadTime > TimeGenerated and UploadTime < TimeGenerated+threshold
| project-away UploaderID1
| extend timestamp=TimeGenerated, AccountCustomEntity = UploaderID 

```

## SharePointFileOperation via devices with previously unseen user agents

'Tracking via user agent is one way to differentiate between types of connecting device.
In homogeneous enterprise environments the user agent associated with an attacker device may stand out as unusual.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1030|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | f2367171-1514-4c67-88ef-27434b6a1093 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/new_sharepoint_downloads_by_UserAgent.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let MINIMUM_BLOCKS = 10;
let SUCCESS_THRESHOLD = 0.2;
let HistoricalActivity = 
SigninLogs
| where TimeGenerated > lookback
| where isnotempty(UserAgent)
| summarize SuccessfulSignins=countif(ResultType=="0"), BlockedSignins=countif(ResultType=="50053") by UserAgent
| extend SuccessBlockRatio = 1.00 * SuccessfulSignins / BlockedSignins
| where SuccessBlockRatio < SUCCESS_THRESHOLD
| where BlockedSignins > MINIMUM_BLOCKS 
;
OfficeActivity
| where TimeGenerated between (starttime .. endtime)
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), RecentFileActivities=count() by UserAgent
| join (HistoricalActivity) on UserAgent
| project-away UserAgent1
| extend timestamp = StartTime, UserAgentCustomEntity = UserAgent

```

## SharePointFileOperation via devices with previously unseen user agents

'Tracking via user agent is one way to differentiate between types of connecting device.
In homogeneous enterprise environments the user agent associated with an attacker device may stand out as unusual.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1030|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | f2367171-1514-4c67-88ef-27434b6a1093 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/new_sharepoint_downloads_by_UserAgent.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let MINIMUM_BLOCKS = 10;
let SUCCESS_THRESHOLD = 0.2;
let HistoricalActivity = 
SigninLogs
| where TimeGenerated > lookback
| where isnotempty(UserAgent)
| summarize SuccessfulSignins=countif(ResultType=="0"), BlockedSignins=countif(ResultType=="50053") by UserAgent
| extend SuccessBlockRatio = 1.00 * SuccessfulSignins / BlockedSignins
| where SuccessBlockRatio < SUCCESS_THRESHOLD
| where BlockedSignins > MINIMUM_BLOCKS 
;
OfficeActivity
| where TimeGenerated between (starttime .. endtime)
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), RecentFileActivities=count() by UserAgent
| join (HistoricalActivity) on UserAgent
| project-away UserAgent1
| extend timestamp = StartTime, UserAgentCustomEntity = UserAgent

```

## SharePointFileOperation via devices with previously unseen user agents

'Tracking via user agent is one way to differentiate between types of connecting device.
In homogeneous enterprise environments the user agent associated with an attacker device may stand out as unusual.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1030|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | f2367171-1514-4c67-88ef-27434b6a1093 |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/new_sharepoint_downloads_by_UserAgent.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let MINIMUM_BLOCKS = 10;
let SUCCESS_THRESHOLD = 0.2;
let HistoricalActivity = 
SigninLogs
| where TimeGenerated > lookback
| where isnotempty(UserAgent)
| summarize SuccessfulSignins=countif(ResultType=="0"), BlockedSignins=countif(ResultType=="50053") by UserAgent
| extend SuccessBlockRatio = 1.00 * SuccessfulSignins / BlockedSignins
| where SuccessBlockRatio < SUCCESS_THRESHOLD
| where BlockedSignins > MINIMUM_BLOCKS 
;
OfficeActivity
| where TimeGenerated between (starttime .. endtime)
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), RecentFileActivities=count() by UserAgent
| join (HistoricalActivity) on UserAgent
| project-away UserAgent1
| extend timestamp = StartTime, UserAgentCustomEntity = UserAgent

```

## Exes with double file extension and access summary

'Provides a summary of executable files with double file extensions in SharePoint 
 and the users and IP addresses that have accessed them.'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1036|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | d12580c2-1474-4125-a8a3-553f50d91215 |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/double_file_ext_exes.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let known_ext = dynamic(["lnk","log","option","config", "manifest", "partial"]);
let excluded_users = dynamic(["app@sharepoint"]);
OfficeActivity
| where RecordType =~ "SharePointFileOperation" and isnotempty(SourceFileName)
| where OfficeObjectId has ".exe." and SourceFileExtension !in~ (known_ext)
| extend Extension = extract("[^.]*.[^.]*$",0, OfficeObjectId)
| join kind= leftouter ( 
  OfficeActivity
    | where RecordType =~ "SharePointFileOperation" and (Operation =~ "FileDownloaded" or Operation =~ "FileAccessed") 
    | where SourceFileExtension !in~ (known_ext)
) on OfficeObjectId 
| where UserId1 !in~ (excluded_users)
| extend userBag = pack(UserId1, ClientIP1) 
| summarize makeset(UserId1), make_bag(userBag), Start=max(TimeGenerated), End=min(TimeGenerated) by UserId, OfficeObjectId, SourceFileName, Extension 
| extend NumberOfUsers = array_length(bag_keys(bag_userBag))
| project UploadTime=Start, Uploader=UserId, FileLocation=OfficeObjectId, FileName=SourceFileName, AccessedBy=bag_userBag, Extension, NumberOfUsers
| extend timestamp = UploadTime, AccountCustomEntity = Uploader

```

## Previously unseen bot or application added to Teams

'This hunting query helps identify new, and potentially unapproved applications or bots being added to Teams.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1176|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | bf76e508-9282-4cf1-9cc1-5c20c3dea2ee |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/NewBotAddedToTeams.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let historical_bots = (
OfficeActivity
| where TimeGenerated between(lookback..starttime)
| where OfficeWorkload =~ "MicrosoftTeams"
| where isnotempty(AddonName)
| project AddonName);
OfficeActivity
| where TimeGenerated between(starttime..endtime)
| where OfficeWorkload =~ "MicrosoftTeams"
// Look for add-ins we have never seen before
| where AddonName in (historical_bots)
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId

```

## Previously unseen bot or application added to Teams

'This hunting query helps identify new, and potentially unapproved applications or bots being added to Teams.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1119|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | bf76e508-9282-4cf1-9cc1-5c20c3dea2ee |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/NewBotAddedToTeams.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let historical_bots = (
OfficeActivity
| where TimeGenerated between(lookback..starttime)
| where OfficeWorkload =~ "MicrosoftTeams"
| where isnotempty(AddonName)
| project AddonName);
OfficeActivity
| where TimeGenerated between(starttime..endtime)
| where OfficeWorkload =~ "MicrosoftTeams"
// Look for add-ins we have never seen before
| where AddonName in (historical_bots)
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId

```

## Previously unseen bot or application added to Teams

'This hunting query helps identify new, and potentially unapproved applications or bots being added to Teams.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1176|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | bf76e508-9282-4cf1-9cc1-5c20c3dea2ee |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/NewBotAddedToTeams.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let historical_bots = (
OfficeActivity
| where TimeGenerated between(lookback..starttime)
| where OfficeWorkload =~ "MicrosoftTeams"
| where isnotempty(AddonName)
| project AddonName);
OfficeActivity
| where TimeGenerated between(starttime..endtime)
| where OfficeWorkload =~ "MicrosoftTeams"
// Look for add-ins we have never seen before
| where AddonName in (historical_bots)
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId

```

## Previously unseen bot or application added to Teams

'This hunting query helps identify new, and potentially unapproved applications or bots being added to Teams.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1119|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | bf76e508-9282-4cf1-9cc1-5c20c3dea2ee |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/NewBotAddedToTeams.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let historical_bots = (
OfficeActivity
| where TimeGenerated between(lookback..starttime)
| where OfficeWorkload =~ "MicrosoftTeams"
| where isnotempty(AddonName)
| project AddonName);
OfficeActivity
| where TimeGenerated between(starttime..endtime)
| where OfficeWorkload =~ "MicrosoftTeams"
// Look for add-ins we have never seen before
| where AddonName in (historical_bots)
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId

```

## Windows Reserved Filenames staged on Office file services

'Identifies when Windows Reserved Filenames show up on Office services such as SharePoint and OneDrive.
List currently includes 'CON', 'PRN', 'AUX', 'NUL', 'COM1', 'COM2', 'COM3', 'COM4', 'COM5', 'COM6', 
'COM7', 'COM8', 'COM9', 'LPT1', 'LPT2', 'LPT3', 'LPT4', 'LPT5', 'LPT6', 'LPT7', 'LPT8', 'LPT9' file extensions.
Additionally, identifies when a given user is uploading these files to another users workspace.
This may be indication of a staging location for malware or other malicious activity.
References: https://docs.microsoft.com/windows/win32/fileio/naming-a-file'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1105|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 61c28cd7-3139-4731-8ea7-2cbbeabb4684 |
|DataTypes | OfficeActivity |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/WindowsReservedFileNamesOnOfficeFileServices.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Reserved FileNames/Extension for Windows
let Reserved = dynamic(['CON', 'PRN', 'AUX', 'NUL', 'COM1', 'COM2', 'COM3', 'COM4', 'COM5', 'COM6', 'COM7', 'COM8', 'COM9', 'LPT1', 'LPT2', 'LPT3', 'LPT4', 'LPT5', 'LPT6', 'LPT7', 'LPT8', 'LPT9']);
OfficeActivity
| where isnotempty(SourceFileExtension)
| where SourceFileExtension in~ (Reserved) or SourceFileName in~ (Reserved)
| where UserAgent !has "Mac OS" 
| extend SiteUrlUserFolder = tolower(split(Site_Url, '/')[-2])
| extend UserIdUserFolderFormat = tolower(replace('@|\\.', '_',UserId))
// identify when UserId is not a match to the specific site url personal folder reference
| extend UserIdDiffThanUserFolder = iff(Site_Url has '/personal/' and SiteUrlUserFolder != UserIdUserFolderFormat, true , false ) 
| summarize TimeGenerated = make_list(TimeGenerated), StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), Operations = make_list(Operation), UserAgents = make_list(UserAgent), 
OfficeIds = make_list(OfficeId), SourceRelativeUrls = make_list(SourceRelativeUrl), FileNames = make_list(SourceFileName)
by OfficeWorkload, RecordType, UserType, UserKey, UserId, ClientIP, Site_Url, SourceFileExtension,SiteUrlUserFolder, UserIdUserFolderFormat, UserIdDiffThanUserFolder
// Use mvexpand on any list items and you can expand out the exact time and other metadata about the hit
| extend timestamp = StartTime, AccountCustomEntity = UserId, IPCustomEntity = ClientIP

```

## Bots added to multiple teams

'This hunting query helps identify bots added to multiple Teams in a short space of time.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1176|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 9eb64924-ec8d-44d0-b1f2-10665150fb74 |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/MultiTeamBot.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Adjust these thresholds to suit your environment.
let threshold = 2;
let time_threshold = timespan(5m);
OfficeActivity
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "BotAddedToTeam"
  | summarize Start=max(TimeGenerated), End=min(TimeGenerated), Teams = makeset(TeamName)
  | extend CountOfTeams = array_length(Teams)
  | extend TimeDelta = End - Start 
  | where CountOfTeams > threshold
  | where TimeDelta >= time_threshold
  | project Start, End, Teams, CountOfTeams
  | extend timestamp = Start
```

## Bots added to multiple teams

'This hunting query helps identify bots added to multiple Teams in a short space of time.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1119|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 9eb64924-ec8d-44d0-b1f2-10665150fb74 |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/MultiTeamBot.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Adjust these thresholds to suit your environment.
let threshold = 2;
let time_threshold = timespan(5m);
OfficeActivity
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "BotAddedToTeam"
  | summarize Start=max(TimeGenerated), End=min(TimeGenerated), Teams = makeset(TeamName)
  | extend CountOfTeams = array_length(Teams)
  | extend TimeDelta = End - Start 
  | where CountOfTeams > threshold
  | where TimeDelta >= time_threshold
  | project Start, End, Teams, CountOfTeams
  | extend timestamp = Start
```

## Bots added to multiple teams

'This hunting query helps identify bots added to multiple Teams in a short space of time.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1176|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 9eb64924-ec8d-44d0-b1f2-10665150fb74 |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/MultiTeamBot.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Adjust these thresholds to suit your environment.
let threshold = 2;
let time_threshold = timespan(5m);
OfficeActivity
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "BotAddedToTeam"
  | summarize Start=max(TimeGenerated), End=min(TimeGenerated), Teams = makeset(TeamName)
  | extend CountOfTeams = array_length(Teams)
  | extend TimeDelta = End - Start 
  | where CountOfTeams > threshold
  | where TimeDelta >= time_threshold
  | project Start, End, Teams, CountOfTeams
  | extend timestamp = Start
```

## Bots added to multiple teams

'This hunting query helps identify bots added to multiple Teams in a short space of time.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1119|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 9eb64924-ec8d-44d0-b1f2-10665150fb74 |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/MultiTeamBot.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Adjust these thresholds to suit your environment.
let threshold = 2;
let time_threshold = timespan(5m);
OfficeActivity
  | where OfficeWorkload =~ "MicrosoftTeams"
  | where Operation =~ "BotAddedToTeam"
  | summarize Start=max(TimeGenerated), End=min(TimeGenerated), Teams = makeset(TeamName)
  | extend CountOfTeams = array_length(Teams)
  | extend TimeDelta = End - Start 
  | where CountOfTeams > threshold
  | where TimeDelta >= time_threshold
  | project Start, End, Teams, CountOfTeams
  | extend timestamp = Start
```

## Certutil (LOLBins and LOLScripts)

'This detection uses Sysmon telemetry to hunt Certutil activities'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1105|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 0e429446-2798-49e4-924d-c37338f24e23 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Certutil-LOLBins.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
Event
//This query uses sysmon data depending on table name used this may need updataing
| where Source == "Microsoft-Windows-Sysmon"
| where EventID == 1
| extend RenderedDescription = tostring(split(RenderedDescription, ":")[0])
| extend EventData = parse_xml(EventData).DataItem.EventData.Data
| mv-expand bagexpansion=array EventData
| evaluate bag_unpack(EventData)
| extend Key=tostring(['@Name']), Value=['#text']
| evaluate pivot(Key, any(Value), TimeGenerated, Source, EventLog, Computer, EventLevel, EventLevelName, EventID, UserName, RenderedDescription, MG, ManagementGroupName, Type, _ResourceId)
| extend RuleName = column_ifexists("RuleName", ""), TechniqueId = column_ifexists("TechniqueId", ""),  TechniqueName = column_ifexists("TechniqueName", "")
| parse RuleName with * 'technique_id=' TechniqueId ',' * 'technique_name=' TechniqueName
| where Image has "certutil.exe"
// Uncomment the next line and add your commandLine Whitelisted/ignore terms.For example "urlcache"
// | where CommandLine !contains ("urlcache") 
| extend HostCustomEntity = Computer, AccountCustomEntity = UserName

```

## Decoy User Account Authentication Attempt

'The query detects authentication attempts from a decoy user account. 
A decoy user account is explicitly created and monitored to alert the SOC, indicating a malicious activity when the account is in use.
Ref: https://fidelissecurity.com/threatgeek/deception/best-deception-protection-for-active-directory'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1021|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | a4dbc292-87eb-11ec-a8a3-0242ac120002 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/DecoyUserAccountAuthenticationAttempt.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Enter a reference list of decoy users (usernames) "Case Sensitive"
   let DecoyUserNameList = dynamic (["DecoyUser1","DecoyUser2"]);
SecurityEvent
 | where TargetUserName in (DecoyUserNameList)
 | where EventID in (4624,4625)
 | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, TargetUserName, LogonTypeName, IpAddress

```

## Potential Exploitation of MS-RPRN printer bug

'This query detects potential attempts to remotely access to the print spooler service on Active Directory Domain Controllers which could indicate an exploitation of MS-RPRN printer bug from a server that is configured with unconstrained delegation.
 This query searches for the event id 5145 on Domain Controllers where the ShareName is "\\\*\IPC$" and the RelativeTargetName is "spoolss".
 Ref: https://medium.com/@riccardo.ancarani94/exploiting-unconstrained-delegation-a81eabbd6976#:~:text=The%20exploitation%20of%20unconstrained%20delegation,system%20with%20the%20delegation%20enabled.&text=but%20before%20doing%20that%20we,listen%20for%20incoming%20authenticated%20connections.'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1134|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | c29a03c6-d074-4934-afae-df1aeb30da70 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/MSRPRN_Printer_Bug_Exploitation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Enter a reference list of hostnames for your DC servers
// let DCServersList = dynamic (["DC01.domain.local","DC02.domain.local"]);
// Enter a reference list of IP addresses for your unconstrained delegation servers
// let UnconstrainedServersIPList = dynamic (["10.1.0.7","10.1.0.45"]);
SecurityEvent
// | where Computer in (DCServersList)
// | where IpAddress  in (UnconstrainedServersIPList)
| where EventID == 5145 and ShareName == "\\\\*\\IPC$" and RelativeTargetName == "spoolss"
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Computer, SubjectUserName, IpAddress, ShareName, RelativeTargetName, Type, SubjectUserSid

```

## Crash dump disabled on host

'This detection looks the prevention of crash dumps being created. This can be used to limit reporting by malware, look for suspicious processes setting this registry key.'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1070|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 5a3615af-21c9-427e-8bf1-ed2350992bb4 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Crashdumpdisabledonhost.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
  | where EventID == 4657
  | parse ObjectName with "\\REGISTRY\\" KeyPrefix "\\" RegistryKey
  | project-reorder RegistryKey
  | where RegistryKey has "SYSTEM\\CurrentControlSet\\Control\\CrashControl"
  | where ObjectValueName =~ "CrashDumpEnabled"
  | extend  RegistryValueData = iff (OperationType == "%%1906", OldValue, NewValue)
  | where RegistryValueData == 0

```

## VIP account more than 6 failed logons in 10

'VIP Account with more than 6 failed logon attempts in 10 minutes, include your own VIP list in the table below
 NTSTATUS codes - https://docs.microsoft.com/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 892cd37e-f9e1-49c3-b0b2-d74f52ac7b71 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/CustomUserList_FailedLogons.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Create DataTable with your own values, example below shows dummy usernames and domain
let List = datatable(VIPUser:string, Domain:string)["Bob", "Domain", "joe", "domain", "MATT", "DOMAIN", "administrator", ""];
let timeframe = 10m;
List
| project TargetUserName = tolower(VIPUser), TargetDomainName = toupper(Domain)
| join kind= rightsemi ( 
SecurityEvent 
| where TimeGenerated > ago(2*timeframe) 
| where EventID == "4625"
| where AccountType == "User"
) on TargetUserName, TargetDomainName
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), FailedVIPLogons = count() by EventID, Activity, WorkstationName, Account, TargetAccount, TargetUserName, TargetDomainName, LogonType, LogonTypeName, LogonProcessName, Status, SubStatus
| where FailedVIPLogons >= 6
// map the most common ntstatus codes
| extend StatusDesc = case(
Status =~ "0x80090302", "SEC_E_UNSUPPORTED_FUNCTION",
Status =~ "0x80090308", "SEC_E_INVALID_TOKEN",
Status =~ "0x8009030E", "SEC_E_NO_CREDENTIALS",
Status =~ "0xC0000008", "STATUS_INVALID_HANDLE",
Status =~ "0xC0000017", "STATUS_NO_MEMORY",
Status =~ "0xC0000022", "STATUS_ACCESS_DENIED",
Status =~ "0xC0000034", "STATUS_OBJECT_NAME_NOT_FOUND",
Status =~ "0xC000005E", "STATUS_NO_LOGON_SERVERS",
Status =~ "0xC000006A", "STATUS_WRONG_PASSWORD",
Status =~ "0xC000006D", "STATUS_LOGON_FAILURE",
Status =~ "0xC000006E", "STATUS_ACCOUNT_RESTRICTION",
Status =~ "0xC0000073", "STATUS_NONE_MAPPED",
Status =~ "0xC00000FE", "STATUS_NO_SUCH_PACKAGE",
Status =~ "0xC000009A", "STATUS_INSUFFICIENT_RESOURCES",
Status =~ "0xC00000DC", "STATUS_INVALID_SERVER_STATE",
Status =~ "0xC0000106", "STATUS_NAME_TOO_LONG",
Status =~ "0xC000010B", "STATUS_INVALID_LOGON_TYPE",
Status =~ "0xC000015B", "STATUS_LOGON_TYPE_NOT_GRANTED",
Status =~ "0xC000018B", "STATUS_NO_TRUST_SAM_ACCOUNT",
Status =~ "0xC0000224", "STATUS_PASSWORD_MUST_CHANGE",
Status =~ "0xC0000234", "STATUS_ACCOUNT_LOCKED_OUT",
Status =~ "0xC00002EE", "STATUS_UNFINISHED_CONTEXT_DELETED",
"See - https://docs.microsoft.com/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55"
)
| extend SubStatusDesc = case(
SubStatus =~ "0x80090325", "SEC_E_UNTRUSTED_ROOT",
SubStatus =~ "0xC0000008", "STATUS_INVALID_HANDLE",
SubStatus =~ "0xC0000022", "STATUS_ACCESS_DENIED",
SubStatus =~ "0xC0000064", "STATUS_NO_SUCH_USER",
SubStatus =~ "0xC000006A", "STATUS_WRONG_PASSWORD",
SubStatus =~ "0xC000006D", "STATUS_LOGON_FAILURE",
SubStatus =~ "0xC000006E", "STATUS_ACCOUNT_RESTRICTION",
SubStatus =~ "0xC000006F", "STATUS_INVALID_LOGON_HOURS",
SubStatus =~ "0xC0000070", "STATUS_INVALID_WORKSTATION",
SubStatus =~ "0xC0000071", "STATUS_PASSWORD_EXPIRED",
SubStatus =~ "0xC0000072", "STATUS_ACCOUNT_DISABLED",
SubStatus =~ "0xC0000073", "STATUS_NONE_MAPPED",
SubStatus =~ "0xC00000DC", "STATUS_INVALID_SERVER_STATE",
SubStatus =~ "0xC0000133", "STATUS_TIME_DIFFERENCE_AT_DC",
SubStatus =~ "0xC000018D", "STATUS_TRUSTED_RELATIONSHIP_FAILURE",
SubStatus =~ "0xC0000193", "STATUS_ACCOUNT_EXPIRED",
SubStatus =~ "0xC0000380", "STATUS_SMARTCARD_WRONG_PIN",
SubStatus =~ "0xC0000381", "STATUS_SMARTCARD_CARD_BLOCKED",
SubStatus =~ "0xC0000382", "STATUS_SMARTCARD_CARD_NOT_AUTHENTICATED",
SubStatus =~ "0xC0000383", "STATUS_SMARTCARD_NO_CARD",
SubStatus =~ "0xC0000384", "STATUS_SMARTCARD_NO_KEY_CONTAINER",
SubStatus =~ "0xC0000385", "STATUS_SMARTCARD_NO_CERTIFICATE",
SubStatus =~ "0xC0000386", "STATUS_SMARTCARD_NO_KEYSET",
SubStatus =~ "0xC0000387", "STATUS_SMARTCARD_IO_ERROR",
SubStatus =~ "0xC0000388", "STATUS_DOWNGRADE_DETECTED",
SubStatus =~ "0xC0000389", "STATUS_SMARTCARD_CERT_REVOKED",
"See - https://docs.microsoft.com/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55"
)
| project StartTimeUtc, EndTimeUtc, FailedVIPLogons, EventID, Activity, WorkstationName, Account, TargetAccount, TargetUserName, TargetDomainName, LogonType, LogonTypeName, LogonProcessName, Status, StatusDesc, SubStatus, SubStatusDesc
| extend timestamp = StartTimeUtc, AccountCustomEntity = Account

```
