# Rules: 7792-7812

## Enumeration of users and groups (Normalized Process Events)

'Finds attempts to list users or groups using the built-in Windows 'net' tool '

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 7b3ed03a-7474-4dad-9c6a-92e7b69f6584 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_enumeration_user_and_group.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

imProcessCreate
| where (CommandLine has ' user ' or CommandLine has ' group ') and (CommandLine hassuffix ' /do' or CommandLine hassuffix ' /domain') 
| where Process has 'net.exe' // performance pre-filtering
| extend FileName=tostring(split(Process, '\\')[-1])
| where FileName == 'net.exe' and ActorUsername != "" and CommandLine !contains '\\'  and CommandLine !contains '/add' 
| extend Target = extract("(?i)[user|group] (\"*[a-zA-Z0-9-_ ]+\"*)", 1, CommandLine) 
| where Target  != '' 
| summarize minTimeGenerated=min(TimeGenerated), maxTimeGenerated=max(TimeGenerated), count() by ActorUsername, Target, CommandLine, Dvc, EventVendor, EventProduct
| sort by ActorUsername, Target
| extend timestamp = minTimeGenerated, AccountCustomEntity = ActorUsername, HostCustomEntity = Dvc

```

## Certutil (LOLBins and LOLScripts, Normalized Process Events)

'This detection uses Normalized Process Events to hunt Certutil activities'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1105|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 28233666-c235-4d55-b456-5cfdda29d62d |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_Certutil-LOLBins.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
| where Process has "certutil.exe"
// Uncomment the next line and add your commandLine Whitelisted/ignore terms.For example "urlcache"
// | where CommandLine !contains ("urlcache") 
| extend HostCustomEntity = Dvc, AccountCustomEntity = User

```

## Summary of users created using uncommon/undocumented commandline switches (Normalized Process Events)

'Summarizes uses of uncommon & undocumented commandline switches to create persistence
User accounts may be created to achieve persistence on a machine.
Read more here: https://attack.mitre.org/wiki/Technique/T1136
Query for users being created using "net user" command
"net user" commands are noisy, so needs to be joined with another signal -
e.g. in this example we look for some undocumented variations (e.g. /ad instead of /add)'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1110|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 374a40ba-73fc-4d70-95ac-524b5765ffa2 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_persistence_create_account.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
| where Process has_any ("net.exe", "net1.exe") // preformance pre-filtering
| extend FileName = tostring(split(Process, '\\')[-1]) 
| extend ActingProcessFileName= tostring(split(ActingProcessName, '\\')[-1]) 
| where FileName in~ ("net.exe", "net1.exe")
| parse kind=regex flags=iU CommandLine with * "user " CreatedUser " " * "/ad"
| where not(FileName =~ "net1.exe" and ActingProcessFileName =~ "net.exe" and replace("net", "net1", ActingProcessCommandLine) =~ CommandLine)
| extend CreatedOnLocalMachine=(CommandLine !has "/do")
| where CommandLine has "/add" or (CreatedOnLocalMachine == 0 and CommandLine !has "/domain")
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), MachineCount=dcount(Dvc) by CreatedUser, CreatedOnLocalMachine, ActingProcessFileName, FileName, CommandLine, ActingProcessCommandLine, EventVendor, EventProduct
| extend timestamp = StartTimeUtc, AccountCustomEntity = CreatedUser

```

## Summary of users created using uncommon/undocumented commandline switches (Normalized Process Events)

'Summarizes uses of uncommon & undocumented commandline switches to create persistence
User accounts may be created to achieve persistence on a machine.
Read more here: https://attack.mitre.org/wiki/Technique/T1136
Query for users being created using "net user" command
"net user" commands are noisy, so needs to be joined with another signal -
e.g. in this example we look for some undocumented variations (e.g. /ad instead of /add)'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1110|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 374a40ba-73fc-4d70-95ac-524b5765ffa2 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_persistence_create_account.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
| where Process has_any ("net.exe", "net1.exe") // preformance pre-filtering
| extend FileName = tostring(split(Process, '\\')[-1]) 
| extend ActingProcessFileName= tostring(split(ActingProcessName, '\\')[-1]) 
| where FileName in~ ("net.exe", "net1.exe")
| parse kind=regex flags=iU CommandLine with * "user " CreatedUser " " * "/ad"
| where not(FileName =~ "net1.exe" and ActingProcessFileName =~ "net.exe" and replace("net", "net1", ActingProcessCommandLine) =~ CommandLine)
| extend CreatedOnLocalMachine=(CommandLine !has "/do")
| where CommandLine has "/add" or (CreatedOnLocalMachine == 0 and CommandLine !has "/domain")
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), MachineCount=dcount(Dvc) by CreatedUser, CreatedOnLocalMachine, ActingProcessFileName, FileName, CommandLine, ActingProcessCommandLine, EventVendor, EventProduct
| extend timestamp = StartTimeUtc, AccountCustomEntity = CreatedUser

```

## Dev-0056 Command Line Activity November 2021 (ASIM Version)

' This hunting query looks for process command line activity related to activity observed by Dev-0056.The command lines this query hunts for are used as part of the threat actor's post exploitation activity.
  This query uses the Microsoft Sentinel Information Model - https://docs.microsoft.com/azure/sentinel/normalization'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 98fdd28d-9c13-431b-aca9-e6cfbb90a5a9 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_Dev-0056CommandLineActivityNovember2021(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
| where ( CommandLine has_any("/q /c color f7&", "Net.We$()bClient", "$b,15,$b.Length-15")) or (CommandLine has "FromBase64String" and CommandLine has_all("-nop", "iex", "(iex"))
| summarize count(), FirstSeen=min(TimeGenerated), LastSeen = max(TimeGenerated) by DvcId, Dvc, CommandLine, AccountName, FilePath
// Base risk score on number of command lines seen for each host
| extend RiskScore = count_
// Increase risk score if host has recent security alerts
| join kind=leftouter (SecurityAlert
| where ProviderName =~ "MDATP"
| extend ThreatName = tostring(parse_json(ExtendedProperties).ThreatName)
| mv-expand todynamic(Entities)
| extend DvcId = tostring(parse_json(Entities).MdatpDeviceId)
| where isnotempty(DvcId)
// Increase risk score further if alerts relate to malware assocaited with threat actor
| extend AlertRiskScore = iif(ThreatName has_any ("Backdoor:MSIL/ShellClient.A", "Backdoor:MSIL/ShellClient.A!dll", "Trojan:MSIL/Mimikatz.BA!MTB"), 1.0, 0.5)) on DvcId
// Create aggregate risk score
| extend AlertRiskScore = iif(isempty(AlertRiskScore), 0.0 , AlertRiskScore)
| extend RiskScore = RiskScore + AlertRiskScore
| project-reorder  FirstSeen, LastSeen, RiskScore, Dvc, DvcId, CommandLine, AccountName
| extend timestamp = FirstSeen, AccountCustomEntity = AccountName, HostCustomEntity = Dvc

```

## Discord download invoked from cmd line (ASIM Version)

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1204|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3169dc83-9e97-452c-afcc-baebdb0ddf7c |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/Discorddownloadinvokedfromcmdline(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
  | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
  | project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line (ASIM Version)

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1102|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3169dc83-9e97-452c-afcc-baebdb0ddf7c |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/Discorddownloadinvokedfromcmdline(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
  | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
  | project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line (ASIM Version)

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1567|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3169dc83-9e97-452c-afcc-baebdb0ddf7c |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/Discorddownloadinvokedfromcmdline(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
  | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
  | project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line (ASIM Version)

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1204|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3169dc83-9e97-452c-afcc-baebdb0ddf7c |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/Discorddownloadinvokedfromcmdline(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
  | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
  | project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line (ASIM Version)

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3169dc83-9e97-452c-afcc-baebdb0ddf7c |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/Discorddownloadinvokedfromcmdline(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
  | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
  | project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line (ASIM Version)

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1567|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3169dc83-9e97-452c-afcc-baebdb0ddf7c |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/Discorddownloadinvokedfromcmdline(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
  | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
  | project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line (ASIM Version)

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1204|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3169dc83-9e97-452c-afcc-baebdb0ddf7c |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/Discorddownloadinvokedfromcmdline(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
  | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
  | project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line (ASIM Version)

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1102|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3169dc83-9e97-452c-afcc-baebdb0ddf7c |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/Discorddownloadinvokedfromcmdline(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
  | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
  | project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line (ASIM Version)

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1567|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3169dc83-9e97-452c-afcc-baebdb0ddf7c |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/Discorddownloadinvokedfromcmdline(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcess
  | where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
  | where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
  | project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## PowerShell downloads (Normalized Process Events)

'Finds PowerShell execution events that could involve a download'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 93a4ed6c-83e6-4202-8df4-e340dbd20a38 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_powershell_downloads.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate 
  | where Process has_any ("powershell.exe", "powershell_ise.exe") // perfromance pre-filtering
  | extend FileName=tostring(split(TargetProcessFilePath, '\\')[-1])
  | where FileName in~ ("powershell.exe", "powershell_ise.exe")
  | where CommandLine has_any ("Net.WebClient", "DownloadFile", "Invoke-WebRequest", "Invoke-Shellcode", "http:")
  | project TimeGenerated, Dvc, User, InitiatingProcessFileName, FileName, CommandLine, EventVendor, EventProduct
  | top 100 by TimeGenerated
  | extend timestamp = TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = User

```

## PowerShell downloads (Normalized Process Events)

'Finds PowerShell execution events that could involve a download'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 93a4ed6c-83e6-4202-8df4-e340dbd20a38 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_powershell_downloads.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate 
  | where Process has_any ("powershell.exe", "powershell_ise.exe") // perfromance pre-filtering
  | extend FileName=tostring(split(TargetProcessFilePath, '\\')[-1])
  | where FileName in~ ("powershell.exe", "powershell_ise.exe")
  | where CommandLine has_any ("Net.WebClient", "DownloadFile", "Invoke-WebRequest", "Invoke-Shellcode", "http:")
  | project TimeGenerated, Dvc, User, InitiatingProcessFileName, FileName, CommandLine, EventVendor, EventProduct
  | top 100 by TimeGenerated
  | extend timestamp = TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = User

```

## AD FS Database Local SQL Statements

'This hunting query uses Application events from the "MSSQL$MICROSOFT##WID" provider to collect SQL statements run against an AD FS database (e.g Windows Internal Database (WID)).
A threat actor might want to extract the AD FS data configuration settings with a SQL statement or modify it with an UPDATE SQL statement.
In order to use this query you need to create a server audit and database audit specification on your AD FS database.
Reference: https://github.com/Azure/SimuLand/blob/main/3_simulate_detect/credential-access/exportADFSTokenSigningCertificate.md
Reference: https://o365blog.com/post/adfs/
'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1005|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 81fab62b-ef92-487a-9c35-a91a116309e6 |
|DataTypes | SecurityEvent_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/ADFSDBLocalSqlStatements.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
Event
| where EventLog =~ 'Application'
| where Source == 'MSSQL$MICROSOFT##WID' and EventID == '33205'
| where RenderedDescription has_all ('database_name:AdfsConfigurationV4','schema_name:IdentityServerPolicy','object_name:ServiceSettings')
| extend action_id = extract("action_id:([\\S]+)", 1, RenderedDescription)
| extend session_server_principal_name = extract("session_server_principal_name:([\\S]+)", 1, RenderedDescription)
| extend server_principal_name = extract("session_server_principal_name:([\\S]+)", 1, RenderedDescription)
| extend HostCustomEntity = Computer, AccountCustomEntity = split(server_principal_name, '\\')[1]

```

## Azure Storage File Create and Delete

'This hunting query will try to identify instances where a file us uploaded to file storage and then deleted
within a given threshold. By default the query will find instances where a file is uploaded and deleted within
5 minutes. This hunting query will help detect automated exfiltration.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1020|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 276731f6-ae09-4469-9fa0-c0791a5a0d8d |
|DataTypes | AzureStorage_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AzureStorage/AzureStorageFileCreatedQuicklyDeleted.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 5m;
let StorageData =
union
StorageFileLogs,
StorageBlobLogs;
StorageData
| where StatusText =~ "Success"
| where OperationName =~ "PutBlob" or OperationName =~ "PutRange"
| extend Uri = tostring(split(Uri, "?", 0)[0])
| join (
    StorageData
    | where StatusText =~ "Success"
    | where OperationName =~ "DeleteBlob" or OperationName =~ "DeleteFile"
    | extend Uri = tostring(split(Uri, "?", 0)[0])
    | project OperationName, DeletedTime=TimeGenerated, Uri
) on Uri
| project TimeGenerated, DeletedTime, Uri, CallerIpAddress, UserAgentHeader, ResponseMd5, StorageAccount=AccountName
| extend windowEnd = TimeGenerated+5m 
| where DeletedTime between (TimeGenerated .. windowEnd)

```

## Azure Storage File Create and Delete

'This hunting query will try to identify instances where a file us uploaded to file storage and then deleted
within a given threshold. By default the query will find instances where a file is uploaded and deleted within
5 minutes. This hunting query will help detect automated exfiltration.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1537|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 276731f6-ae09-4469-9fa0-c0791a5a0d8d |
|DataTypes | AzureStorage_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AzureStorage/AzureStorageFileCreatedQuicklyDeleted.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 5m;
let StorageData =
union
StorageFileLogs,
StorageBlobLogs;
StorageData
| where StatusText =~ "Success"
| where OperationName =~ "PutBlob" or OperationName =~ "PutRange"
| extend Uri = tostring(split(Uri, "?", 0)[0])
| join (
    StorageData
    | where StatusText =~ "Success"
    | where OperationName =~ "DeleteBlob" or OperationName =~ "DeleteFile"
    | extend Uri = tostring(split(Uri, "?", 0)[0])
    | project OperationName, DeletedTime=TimeGenerated, Uri
) on Uri
| project TimeGenerated, DeletedTime, Uri, CallerIpAddress, UserAgentHeader, ResponseMd5, StorageAccount=AccountName
| extend windowEnd = TimeGenerated+5m 
| where DeletedTime between (TimeGenerated .. windowEnd)

```

## Azure Storage File Create, Access, Delete

'This hunting query will identify where a file is uploaded to Azure File or Blob storage
and is then accessed once before being deleted. This activity may be indicative of
exfiltration activity.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1537|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 25568c62-414b-4577-acee-5cba9494c232 |
|DataTypes | AzureStorage_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AzureStorage/AzureStorageFileCreateAccessDelete.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 5m;
//Union the file and blob data
let StorageData = 
union
StorageFileLogs,
StorageBlobLogs;
//Get file and blob uploads
StorageData
//File upload operations 
| where StatusText =~ "Success" 
| where OperationName =~ "PutBlob" or OperationName =~ "PutRange"
//Parse the URI to remove the parameters as they change per request 
| extend Uri = tostring(split(Uri, "?", 0)[0])
//Join with deletions, this will return 0 rows if there was no deletion 
| join (
    StorageData        
    //File deletion operations     
    | where OperationName =~ "DeleteBlob" or OperationName =~ "DeleteFile"     
    | extend Uri = tostring(split(Uri, "?", 0)[0])     
    | project OperationName, DeletedTime=TimeGenerated, Uri, CallerIpAddress, UserAgentHeader
    ) on Uri 
| project UploadedTime=TimeGenerated, DeletedTime, OperationName, OperationName1, Uri, UploaderAccountName=AccountName, UploaderIP=CallerIpAddress, UploaderUA=UserAgentHeader, DeletionIP=CallerIpAddress1, DeletionUA=UserAgentHeader1, ResponseMd5
//Collect file access events where the file was only accessed by a single IP, a single downloader 
| join (
    StorageData 
    |where Category =~ "StorageRead" 
    //File download events 
    | where OperationName =~ "GetBlob" or OperationName =~ "GetFile"
    //Again, parse the URI to remove the parameters as they change per request 
    | extend Uri = tostring(split(Uri, "?", 0)[0])
    //Parse the caller IP as it contains the port 
    | extend CallerIpAddress = tostring(split(CallerIpAddress, ":", 0)[0])
    //Summarise the download events by the URI, we are only looking for instances where a single caller IP downloaded the file,
    //so we can safely use any() on the IP. 
    | summarize Downloads=count(), DownloadTimeStart=max(TimeGenerated), DownloadTimeEnd=min(TimeGenerated), DownloadIP=any(CallerIpAddress), DownloadUserAgents=make_set(UserAgentHeader), dcount(CallerIpAddress) by Uri 
    | where dcount_CallerIpAddress == 1
    ) on Uri 
| project UploadedTime, DeletedTime, OperationName, OperationName1, Uri, UploaderAccountName, UploaderIP, UploaderUA, DownloadTimeStart, DownloadTimeEnd, DownloadIP, DownloadUserAgents, DeletionIP, DeletionUA, ResponseMd5
| extend timestamp = UploadedTime

```
