# Rules: 7771-7791

## GitHub Repo Clone - Time Series Anomly

'Attacker can exfiltrate data from you GitHub repository after gaining access to it by performing clone action. This hunting queries allows you to track the clones activities for each of your repositories. The visualization allow you to quickly identify anomalies/excessive clone, to further investigate repo access & permissions'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1213|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | ccef3c74-4b4f-445b-8109-06d38687e4a4 |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/Unusual%20Number%20of%20Repository%20Clones.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let min_t = toscalar(GitHubRepo
| summarize min(timestamp_t));
let max_t = toscalar(GitHubRepo
| summarize max(timestamp_t));
GitHubRepo
| where Action == "Clones"
| distinct TimeGenerated, Repository, Count
| make-series num=sum(tolong(Count)) default=0 on TimeGenerated in range(min_t, max_t, 1h) by Repository 
| extend (anomalies, score, baseline) = series_decompose_anomalies(num, 1.5, -1, 'linefit')
| render timechart 

```

## GitHub Inactive or New Account Access or Usage

'This hunting query identifies Accounts that are new or inactive and have accessed or used GitHub that may be a sign of compromise.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1136|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | b8508e24-47a6-4f8e-9066-3cc937197e7f |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/Inactive%20or%20New%20Account%20Usage.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let LearningPeriod = 7d;
let EndLearningTime = starttime - LearningPeriod;
let GitHubActorLogin = (GitHubAudit
| where Actor != "");
let GitHubUser = (GitHubAudit
| where ImpactedUser != "");
let GitHubNewActorLogin = (GitHubActorLogin
| where TimeGenerated between (EndLearningTime .. starttime)
| summarize makeset(Actor)
| extend Dummy = 1
| join kind=innerunique (
  GitHubActorLogin
  | where TimeGenerated between (starttime .. endtime)
  | distinct Actor
  | extend Dummy = 1
) on Dummy
| project-away Dummy
| where set_Actor  !contains Actor);
let GitHubNewUser = ( GitHubUser
| where TimeGenerated between (EndLearningTime .. starttime)
| summarize makeset(ImpactedUser)
| extend Dummy = 1
| join kind=innerunique (
  GitHubUser
  | where TimeGenerated between (startime .. endtime)
  | distinct ImpactedUser
  | extend Dummy = 1
) on Dummy
| project-away Dummy
| where set_ImpactedUser !contains ImpactedUser);
union GitHubNewActorLogin, GitHubNewUser

```

## GitHub OAuth App Restrictions Disabled

'This hunting query identifies GitHub OAuth Apps that have restrictions disabled that may be a sign of compromise. Attacker will want to disable such security tools in order to go undetected. '

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1505|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 667e6a70-adc9-49b7-9cf3-f21927c71959 |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/Oauth%20App%20Restrictions%20Disabled.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where Action == "org.disable_oauth_app_restrictions"
| project TimeGenerated, Action, Actor, Country

```

## GitHub OAuth App Restrictions Disabled

'This hunting query identifies GitHub OAuth Apps that have restrictions disabled that may be a sign of compromise. Attacker will want to disable such security tools in order to go undetected. '

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1562|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 667e6a70-adc9-49b7-9cf3-f21927c71959 |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/Oauth%20App%20Restrictions%20Disabled.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where Action == "org.disable_oauth_app_restrictions"
| project TimeGenerated, Action, Actor, Country

```

## GitHub OAuth App Restrictions Disabled

'This hunting query identifies GitHub OAuth Apps that have restrictions disabled that may be a sign of compromise. Attacker will want to disable such security tools in order to go undetected. '

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1505|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 667e6a70-adc9-49b7-9cf3-f21927c71959 |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/Oauth%20App%20Restrictions%20Disabled.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where Action == "org.disable_oauth_app_restrictions"
| project TimeGenerated, Action, Actor, Country

```

## GitHub OAuth App Restrictions Disabled

'This hunting query identifies GitHub OAuth Apps that have restrictions disabled that may be a sign of compromise. Attacker will want to disable such security tools in order to go undetected. '

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1562|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 667e6a70-adc9-49b7-9cf3-f21927c71959 |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/Oauth%20App%20Restrictions%20Disabled.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where Action == "org.disable_oauth_app_restrictions"
| project TimeGenerated, Action, Actor, Country

```

## GitHub First Time Invite Member and Add Member to Repo

'This hunting query identifies a user that add/invite a member to the organization for the first time. This technique can be leveraged by attackers to add stealth account access to the organization.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1136|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | c3237d88-fdc4-4dee-8b90-118ded2c507c |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/First%20Time%20User%20Invite%20and%20Add%20Member%20to%20Org.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let LearningPeriod = 7d;
let EndLearningTime = starttime - LearningPeriod;
let GitHubOrgMemberLogs = (GitHubAudit
| where Action == "org.invite_member" or Action == "org.update_member" or Action == "org.add_member" or Action == "repo.add_member" or Action == "team.add_member");
GitHubOrgMemberLogs
| where TimeGenerated between (EndLearningTime..starttime)
| distinct Actor
| join kind=rightanti (
  GitHubOrgMemberLogs
  | where TimeGenerated between (starttime..endtime)
  | distinct Actor
) on Actor

```

## GitHub User Grants Access and Other User Grants Access

'This hunting query identifies Accounts in GitHub that have granted access to another account which then grants access to yet another account that may be a sign of compromise.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | f18c4dfb-4fa6-4a9d-9bd3-f7569d1d685a |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/User%20Grant%20Access%20and%20Grants%20Other%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where ImpactedUser != ""
| where Action == "org.invite_member" or Action == "org.add_member" or Action == "team.add_member" or Action == "repo.add_member"
| distinct ImpactedUser, TimeGenerated, Actor
| project-rename firstUserAdded = ImpactedUser, firstEventTime = TimeGenerated, firstAdderUser = Actor
| join kind= innerunique (
  GitHubAudit
  | where ImpactedUser != ""
  | where Action == "org.invite_member" or Action == "org.add_member" or Action == "team.add_member" or Action == "repo.add_member"
  | distinct ImpactedUser, TimeGenerated, Actor
  | project-rename secondUserAdded = ImpactedUser, secondEventTime = TimeGenerated, secondAdderUser = Actor
) on $right.secondAdderUser == $left.firstUserAdded
| where secondEventTime between (firstEventTime .. (firstEventTime + 1h))

```

## GitHub User Grants Access and Other User Grants Access

'This hunting query identifies Accounts in GitHub that have granted access to another account which then grants access to yet another account that may be a sign of compromise.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1078|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | f18c4dfb-4fa6-4a9d-9bd3-f7569d1d685a |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/User%20Grant%20Access%20and%20Grants%20Other%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where ImpactedUser != ""
| where Action == "org.invite_member" or Action == "org.add_member" or Action == "team.add_member" or Action == "repo.add_member"
| distinct ImpactedUser, TimeGenerated, Actor
| project-rename firstUserAdded = ImpactedUser, firstEventTime = TimeGenerated, firstAdderUser = Actor
| join kind= innerunique (
  GitHubAudit
  | where ImpactedUser != ""
  | where Action == "org.invite_member" or Action == "org.add_member" or Action == "team.add_member" or Action == "repo.add_member"
  | distinct ImpactedUser, TimeGenerated, Actor
  | project-rename secondUserAdded = ImpactedUser, secondEventTime = TimeGenerated, secondAdderUser = Actor
) on $right.secondAdderUser == $left.firstUserAdded
| where secondEventTime between (firstEventTime .. (firstEventTime + 1h))

```

## GitHub User Grants Access and Other User Grants Access

'This hunting query identifies Accounts in GitHub that have granted access to another account which then grants access to yet another account that may be a sign of compromise.'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1098|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | f18c4dfb-4fa6-4a9d-9bd3-f7569d1d685a |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/User%20Grant%20Access%20and%20Grants%20Other%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where ImpactedUser != ""
| where Action == "org.invite_member" or Action == "org.add_member" or Action == "team.add_member" or Action == "repo.add_member"
| distinct ImpactedUser, TimeGenerated, Actor
| project-rename firstUserAdded = ImpactedUser, firstEventTime = TimeGenerated, firstAdderUser = Actor
| join kind= innerunique (
  GitHubAudit
  | where ImpactedUser != ""
  | where Action == "org.invite_member" or Action == "org.add_member" or Action == "team.add_member" or Action == "repo.add_member"
  | distinct ImpactedUser, TimeGenerated, Actor
  | project-rename secondUserAdded = ImpactedUser, secondEventTime = TimeGenerated, secondAdderUser = Actor
) on $right.secondAdderUser == $left.firstUserAdded
| where secondEventTime between (firstEventTime .. (firstEventTime + 1h))

```

## GitHub User Grants Access and Other User Grants Access

'This hunting query identifies Accounts in GitHub that have granted access to another account which then grants access to yet another account that may be a sign of compromise.'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | f18c4dfb-4fa6-4a9d-9bd3-f7569d1d685a |
|DataTypes | GitHub_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/GitHub/User%20Grant%20Access%20and%20Grants%20Other%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

GitHubAudit
| where ImpactedUser != ""
| where Action == "org.invite_member" or Action == "org.add_member" or Action == "team.add_member" or Action == "repo.add_member"
| distinct ImpactedUser, TimeGenerated, Actor
| project-rename firstUserAdded = ImpactedUser, firstEventTime = TimeGenerated, firstAdderUser = Actor
| join kind= innerunique (
  GitHubAudit
  | where ImpactedUser != ""
  | where Action == "org.invite_member" or Action == "org.add_member" or Action == "team.add_member" or Action == "repo.add_member"
  | distinct ImpactedUser, TimeGenerated, Actor
  | project-rename secondUserAdded = ImpactedUser, secondEventTime = TimeGenerated, secondAdderUser = Actor
) on $right.secondAdderUser == $left.firstUserAdded
| where secondEventTime between (firstEventTime .. (firstEventTime + 1h))

```

## Host Exporting Mailbox and Removing Export (Normalized Process Events)

'This hunting query looks for hosts exporting a mailbox from an on-prem Exchange server, followed by
that same host removing the export within a short time window. This pattern has been observed by attackers 
when exfiltrating emails from a target environment. A Mailbox export is unlikely to be a common command run so look for
activity from unexpected hosts and accounts.
Reference: https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1114|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 4500a2ff-455b-4ee7-a21d-5ac5c7c9ea87 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_HostExportingMailboxAndRemovingExport.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Adjust the timeframe to change the window events need to occur within to alert
 let timeframe = 1h;
 imProcessCreate
 | where Process has_any ("powershell.exe", "cmd.exe")
 | where CommandLine has 'New-MailboxExportRequest'
 | summarize by Dvc, timekey = bin(TimeGenerated, timeframe), CommandLine, ActorUsername, EventVendor, EventProduct
 | join kind=inner (imProcessCreate
 | where Process has_any ("powershell.exe", "cmd.exe")
 | where CommandLine has 'Remove-MailboxExportRequest'
 | summarize by Dvc, EventProduct, EventVendor, timekey = bin(TimeGenerated, timeframe), CommandLine, ActorUsername) on Dvc, timekey, ActorUsername
 | summarize by timekey, Dvc, CommandLine, ActorUsername
 | project-reorder timekey, Dvc, ActorUsername, CommandLine
 | extend HostCustomEntity = Dvc, AccountCustomEntity = ActorUsername

```

## Windows System Shutdown/Reboot (Normalized Process Events)

'This detection uses Normalized Process Events to detect System Shutdown/Reboot (MITRE Technique: T1529)'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1529|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 614a59c5-2dae-4430-bb16-951a28a5f05f |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_Windows%20System%20Shutdown-Reboot(T1529).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let timeframe = 1d;
imProcessCreate
| where Process has "shutdown.exe" 
| extend HostCustomEntity = Dvc, AccountCustomEntity = User

```

## Cscript script daily summary breakdown (Normalized Process Events)

'breakdown of scripts running in the environment'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | bd89c7a0-76cb-4fa1-bc64-c366687cda9e |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_cscript_summary.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
| where Process has "cscript.exe"
| extend FileName=tostring(split(Process, '\\')[-1])
| where FileName =~ "cscript.exe"
| extend removeSwitches = replace(@"/+[a-zA-Z0-9:]+", "", CommandLine)
| extend CommandLine = trim(@"[a-zA-Z0-9\\:""]*cscript(.exe)?("")?(\s)+", removeSwitches)
// handle case where script name is enclosed in " characters or is not enclosed in quotes 
| extend ScriptName= iff(CommandLine startswith @"""", 
extract(@"([:\\a-zA-Z_\-\s0-9\.()]+)(""?)", 0, CommandLine), 
extract(@"([:\\a-zA-Z_\-0-9\.()]+)(""?)", 0, CommandLine))
| extend ScriptName=trim(@"""", ScriptName) , ScriptNameLength=strlen(ScriptName)
// extract remainder of commandline as script parameters: 
| extend ScriptParams = iff(ScriptNameLength < strlen(CommandLine), substring(CommandLine, ScriptNameLength +1), "")
| summarize min(TimeGenerated), count() by Dvc, User, ScriptName, ScriptParams, EventVendor, EventProduct
| order by count_ asc nulls last 
| extend timestamp = min_TimeGenerated, HostCustomEntity = Dvc, AccountCustomEntity = User

```

## Rundll32 (LOLBins and LOLScripts, Normalized Process Events)

'This detection uses Normalized Process Events to hunt Signed Binary Proxy Execution: Rundll32 activities'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1218.011|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 365a889c-ae0f-461d-bdf1-d6ce11d0ef6f |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/inProcess_SignedBinaryProxyExecutionRundll32.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
| where Process has "rundll32.exe"
// Uncomment the next line and add your commandLine Whitelisted/ignore terms.For example "payload.dll"
// | where CommandLine !contains ("payload.dll") 
| extend HostCustomEntity = Dvc, AccountCustomEntity = User

```

## Entropy for Processes for a given Host (Normalized Process Events)

'Entropy calculation used to help identify Hosts where they have a high variety of processes(a high entropy process list on a given Host over time).
This helps us identify rare processes on a given Host. Rare here means a process shows up on the Host relatively few times in the the last 7days.
The Weight is calculated based on the Entropy, Process Count and Distinct Hosts with that Process. The lower the Weight/ProcessEntropy the, more interesting.
The Weight calculation increases the Weight if the process executes more than once on the Host or has executed on more than 1 Hosts.
In general, this should identify processes on a Host that are rare and rare for the environment.
References: https://medium.com/udacity/shannon-entropy-information-gain-and-picking-balls-from-buckets-5810d35d54b4
https://en.wiktionary.org/wiki/Shannon_entropy'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | |
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 24e66452-2aaa-455f-b0c6-a0d8216bbe79 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_ProcessEntropy.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// exclude when over # of machines have the process
let excludeThreshold = 10;
// exclude when more than percent (default 10%)
let ratioHighCount = 0.1;
// exclude when less than percent (default 3%)
let ratioMidCount = 0.03;
// Process count limit in one day per machine, perf improvement (default every 20 minutes for 24 hours - 3*24 = 72)
let procLimit = 3*24;
// Decrease possibility of hitting memory limit by removing high process count items across all machines (default every 10 minutes for 24 hours - 6*24 = 144)
let maxLimit = 6*24;
let removeHigh = imProcessCreate 
| where TimeGenerated >= ago(1d)
| summarize count() by TargetProcessFilePath = tolower(TargetProcessFilePath) | where count_ > maxLimit
| summarize make_set(TargetProcessFilePath);
let SecEvents = imProcessCreate
| where TimeGenerated >= ago(1d)
| where tolower(TargetProcessFilePath) !in~ (removeHigh)
// removing common items that may still show up in small environments, add here if you have additional exclusions 
| where TargetProcessFilePath !has ':\\Windows\\System32\\conhost.exe' and ActingProcessFileName !has ':\\Windows\\System32\\conhost.exe' 
| where ActingProcessFileName !has ':\\Windows\\System32\\wuauclt.exe' and TargetProcessFilePath !has':\\Windows\\System32\\wuauclt.exe' and TargetProcessFilePath !startswith 'C:\\Windows\\SoftwareDistribution\\Download\\Install\\AM_Delta_Patch_' 
| where ActingProcessFileName !has ':\\WindowsAzure\\GuestAgent_' and TargetProcessFilePath !has ':\\WindowsAzure\\GuestAgent_' 
| where ActingProcessFileName !has ':\\WindowsAzure\\WindowsAzureNetAgent_' and TargetProcessFilePath !has ':\\WindowsAzure\\WindowsAzureNetAgent_' 
| where ActingProcessFileName !has ':\\ProgramData\\Microsoft\\Windows Defender\\platform\\' and TargetProcessFilePath !has "\\Windows Defender Advanced Threat Protection\\SenseCncProxy.exe" and TargetProcessFilePath !has "\\Windows Defender Advanced Threat Protection\\SenseIR.exe.exe" 
| where TargetProcessFilePath !has ':\\ProgramData\\Microsoft\\Windows Defender\\platform\\' 
| where TargetProcessFilePath !has ':\\Windows\\Microsoft.NET\\Framework' and not(TargetProcessFilePath endswith '\\ngentask.exe' or TargetProcessFilePath endswith '\\ngen.exe') 
| where ActingProcessFileName !has ':\\Windows\\Microsoft.NET\\Framework' and not(ActingProcessFileName endswith '\\ngentask.exe' or ActingProcessFileName endswith '\\ngen.exe') 
| where TargetProcessFilePath !has ':\\Windows\\System32\\taskhostw.exe' and ActingProcessFileName !has ':\\Windows\\System32\\taskhostw.exe' 
| where ActingProcessFileName !has ':\\Windows\\SoftwareDistribution\\Download\\Install\\' and not(TargetProcessFilePath endswith '\\MpSigStub.exe') 
| where TargetProcessFilePath !has ':\\Program Files\\Microsoft Monitoring Agent\\Agent\\Health Service State\\' and ActingProcessFileName !has ':\\Program Files\\Microsoft Monitoring Agent\\Agent\\MonitoringHost.exe' 
| where TargetProcessFilePath !has ':\\Windows\\servicing\\trustedinstaller.exe' 
| where ActingProcessFileName !has ':\\Program Files\\Microsoft Dependency Agent\\bin\\MicrosoftDependencyAgent.exe' 
| where ActingProcessFileName !has ':\\Program Files (x86)\\Microsoft\\EdgeUpdate\\MicrosoftEdgeUpdate.exe'
| project TimeGenerated, EventID, DvcHostname, ActorUserId, Account, AccountType, TargetProcessFileName, TargetProcessFilePath, TargetProcessCommandLine, ActingProcessFileName, _ResourceId, DvcId, EventVendor, EventProduct;
let Exclude = SecEvents 
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), ExcludeCompCount = dcount(DvcHostname), ExcludeProcCount = count() by TargetProcessFileName 
// Removing general limit for noise in one day 
| extend timediff = iff(datetime_diff('day', EndTime, StartTime) > 0, datetime_diff('day', EndTime, StartTime), 1) 
// Default exclude of 48 (2 per hour) or more executions in 24 hours on a given machine 
| where ExcludeProcCount > procLimit*timediff 
// Removing noisy processes for an environment, adjust as needed 
| extend compRatio = ExcludeCompCount/toreal(ExcludeProcCount) 
| where compRatio == 0 or (ExcludeCompCount > excludeThreshold and compRatio < ratioHighCount) or (ExcludeCompCount between (2 .. excludeThreshold) and compRatio < ratioMidCount);
let AllSecEvents =  
SecEvents | project DvcHostname, TargetProcessFileName , EventVendor, EventProduct
| join kind= leftanti (  
SecEvents 
// Removing general limit for noise in one day 
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), procCount = count() by DvcHostname, TargetProcessFileName 
| extend timediff = iff(datetime_diff('day', EndTime, StartTime) > 0, datetime_diff('day', EndTime, StartTime), 1) 
// Default exclude 48 (2 per hour) or more executions in 24 hours on a given machine to remove them from overall comparison list 
| where procCount > procLimit*timediff 
) on DvcHostname, TargetProcessFileName 
| project DvcHostname, TargetProcessFileName , EventVendor, EventProduct;
// Removing noisy process from full list 
let Include = materialize(AllSecEvents 
| join kind= leftanti ( 
Exclude 
) on TargetProcessFileName);
// Identifying prevalence for a given process in the environment 
let DCwPC = materialize(Include 
| summarize DistinctHostsProcessCount = dcount(DvcHostname) by TargetProcessFileName 
| join kind=inner ( 
Include 
) on TargetProcessFileName 
| distinct DvcHostname, TargetProcessFileName, DistinctHostsProcessCount);
// Getting the Total process count on each host to use as the denominator in the entropy calc 
let AHPC = materialize(Include 
| summarize AllHostsProcessCount = count() by DvcHostname 
| join kind=inner ( 
Include 
) on DvcHostname 
| distinct DvcHostname, TargetProcessFileName, AllHostsProcessCount 
//Getting a decimal value for later computation 
| extend AHPCValue = todecimal(AllHostsProcessCount));
// Need the count of each class in my bucket or also said as count of ProcName(Class) per Host(Bucket) for use in the entropy calc 
let PCoH = Include 
| summarize ProcessCountOnHost = count() by DvcHostname, TargetProcessFileName 
| join kind=inner ( 
Include 
) on DvcHostname,TargetProcessFileName 
| distinct DvcHostname, TargetProcessFileName, ProcessCountOnHost 
//Getting a decimal value for later computation 
| extend PCoHValue = todecimal(ProcessCountOnHost); 
let Combined = DCwPC 
| join ( 
AHPC 
) on DvcHostname, TargetProcessFileName 
| join ( 
PCoH 
) on DvcHostname, TargetProcessFileName;
let Results = Combined 
// Entropy calculation 
| extend ProcessEntropy = -log2(PCoHValue/AHPCValue)*(PCoHValue/AHPCValue) 
// Calculating Weight, see details in description 
| extend Weight = toreal(ProcessEntropy*ProcessCountOnHost*DistinctHostsProcessCount) 
// Remove or increase value to see processes with low entropy, meaning more common. 
| where Weight <= 100
| project DvcHostname, TargetProcessFileName, Weight , ProcessEntropy, AllHostsProcessCount, ProcessCountOnHost, DistinctHostsProcessCount; 
// Join back full entry 
Results 
| join kind= inner ( 
SecEvents
| project TimeGenerated, EventID, DvcHostname, ActorUserId, Account, AccountType, TargetProcessFileName, TargetProcessFilePath, TargetProcessCommandLine, ActingProcessFileName, _ResourceId, DvcId , EventVendor, EventProduct
) on DvcHostname, TargetProcessFileName 
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), ResultCount = count() by EventID, DvcHostname, ActorUserId, Account, AccountType, Weight, ProcessEntropy,  
TargetProcessFileName, TargetProcessFilePath, TargetProcessCommandLine, ActingProcessFileName, AllHostsProcessCount, ProcessCountOnHost, DistinctHostsProcessCount, _ResourceId, DvcId , EventVendor, EventProduct
| project-reorder StartTime, EndTime, ResultCount, EventID, EventVendor, EventProduct, DvcHostname, ActorUserId, Account, AccountType, Weight, ProcessEntropy,TargetProcessFileName, TargetProcessFilePath, TargetProcessCommandLine, ActingProcessFileName, AllHostsProcessCount, ProcessCountOnHost, DistinctHostsProcessCount, _ResourceId, DvcId
| sort by Weight asc, ProcessEntropy asc, TargetProcessFilePath asc 
| extend timestamp = StartTime, HostCustomEntity = DvcHostname, AccountCustomEntity = Account

```

## Invoke-PowerShellTcpOneLine Usage (Normalized Process Events)

'Invoke-PowerShellTcpOneLine is a PowerShell script to create a simple and small reverse shell. It can be abused by attackers to exfiltrate data. This query looks for command line activity similar to Invoke-PowerShellTcpOneLine.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1011|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | a2b58512-1298-4a25-a4c7-88ddfed78b0d |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_Invoke-PowerShellTcpOneLine.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
 | where Process has_any ("powershell.exe", "PowerShell_ISE.exe", "cmd.exe")
 | where CommandLine has "$client = New-Object System.Net.Sockets.TCPClient"
 | extend timestamp = TimeGenerated, AccountCustomEntity = User, HostCustomEntity = Dvc, IPCustomEntity = DvcIpAddr

```

## Nishang Reverse TCP Shell in Base64 (Normalized Process Events)

'Looks for Base64-encoded commands associated with the Nishang reverse TCP shell.
Ref: https://github.com/samratashok/nishang/blob/master/Shells/Invoke-PowerShellTcp.ps1'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1011|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 3a8e307b-5037-4182-a4e2-e76d99cecab8 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_NishangReverseTCPShellBase64.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
| where Process has_any ("powershell.exe","powershell_ise.exe") and CommandLine contains "-e" 
| mvexpand SS = split(CommandLine, " ") 
| where SS matches regex "[A-Za-z0-9+/]{50,}[=]{0,2}" 
| extend DecodeString = base64_decode_tostring(tostring(SS)) 
| extend FinalString = replace("\\0", "", DecodeString) 
| where FinalString has "tcpclient" and FinalString contains "$" and (FinalString contains "invoke" or FinalString contains "iex") 
| extend timestamp = TimeGenerated, AccountCustomEntity = User, HostCustomEntity = Dvc

```

## SolarWinds Inventory (Normalized Process Events)

'Beyond your internal software management systems, it is possible you may not have visibility into your entire footprint of SolarWinds installations.  This is intended to help use process exection information to discovery any systems that have SolarWinds processes'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1072|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | c3f1606e-48eb-464e-a60c-d53af5a5796e |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_SolarWindsInventory.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
| where Process has 'solarwinds' 
| extend MachineName = DvcHostname , Process = TargetProcessFilePath
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(Dvc), AccountCount = dcount(User), MachineNames = make_set(Dvc),
Accounts = make_set(User) by Process, EventVendor, EventProduct

```

## Exchange PowerShell Snapin Added (Normalized Process Events)

'The Exchange Powershell Snapin was loaded on a host, this allows for a Exchange server management via PowerShell.
Whilst this is a legitimate administrative tool it is abused by attackers to performs actions on a compromised
Exchange server. Hunt for unusual activity related to this Snapin including it being added on new hosts or by
new accounts.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1119|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | CustomConnector |
|DetectionId | 9ccb1859-7a79-4a8a-a382-fa54d4dace47 |
|DataTypes | ASimProcess_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ASimProcess/imProcess_ExchangePowerShellSnapin.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imProcessCreate
 | where Process has_any ("cmd.exe", "powershell.exe", "PowerShell_ISE.exe")
 | where CommandLine has "Add-PSSnapin Microsoft.Exchange.Management.Powershell.Snapin"
 | summarize FirstSeen = min(TimeGenerated), LastSeen = max(TimeGenerated) by Dvc, User, CommandLine, EventVendor, EventProduct
 | extend timestamp = FirstSeen, AccountCustomEntity = User, HostCustomEntity = Dvc

```
