# Rules: 1681-1701

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | DnsEvents |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | Zscaler |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | Zscaler |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | Zscaler |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | InfobloxNIOS |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | Syslog |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | InfobloxNIOS |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | Syslog |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | InfobloxNIOS |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | Syslog |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | GCPDNSDataConnector |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | GCP_DNS_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | NXLogDnsLogs |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | NXLog_DNS_Server_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | CiscoUmbrellaDataConnector |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | Cisco_Umbrella_dns_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | CiscoUmbrellaDataConnector |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | Cisco_Umbrella_dns_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Excessive NXDOMAIN DNS Queries (ASIM DNS Schema)

'This creates an incident in the event a client generates excessive amounts of DNS queries for non-existent domains. 
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | Corelight |
|DetectionId | c3b11fb2-9201-4844-b7b9-6b7bf6d9b851 |
|DataTypes | Corelight_CL |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_ExcessiveNXDOMAINDNSQueries.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 200;
_Im_Dns(responsecodename='NXDOMAIN')
| where isnotempty(DnsResponseCodeName)
//| where DnsResponseCodeName =~ "NXDOMAIN"
| summarize count() by SrcIpAddr, bin(TimeGenerated,15m)
| where count_ > threshold
| join kind=inner (_Im_Dns(responsecodename='NXDOMAIN')
    ) on SrcIpAddr
| extend timestamp = TimeGenerated, IPCustomEntity = SrcIpAddr

```

## Potential DGA detected (ASIM DNS Schema)

'Identifies clients with a high NXDomain count which could be indicative of a DGA (cycling through possible C2 domains
where most C2s are not live). Alert is generated when a new IP address is seen (based on not being seen associated with 
NXDomain records in prior 10-day baseline period).
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1568|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | 983a6922-894d-413c-9f04-d7add0ecc307 |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 10d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_HighNXDomainCount_detection.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let referencestarttime = 10d;
let referenceendtime = 1d;
let threshold = 100;
let nxDomainDnsEvents = (stime:datetime, etime:datetime) 
  {_Im_Dns(responsecodename='NXDOMAIN', starttime=stime, endtime=etime)
  | where DnsQueryTypeName in ("A", "AAAA")
  | where ipv4_is_match("127.0.0.1", SrcIpAddr) == False
  | where DnsQuery !contains "/" and  DnsQuery contains "."};
nxDomainDnsEvents (stime=ago(referenceendtime) ,etime=now())
  | extend sld = tostring(split(DnsQuery, ".")[-2])
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), dcount(sld) by SrcIpAddr
  | where dcount_sld > threshold
  // Filter out previously seen IPs
  | join kind=leftanti (nxDomainDnsEvents (stime=ago(referencestarttime), etime=ago(referenceendtime))
    | extend sld = tostring(split(DnsQuery, ".")[-2])
    | summarize dcount(sld) by SrcIpAddr
    | where dcount_sld > threshold ) on SrcIpAddr
// Pull out sample NXDomain responses for those remaining potentially infected IPs
| join kind = inner (nxDomainDnsEvents (stime=ago(referencestarttime), etime=now()) | summarize by DnsQuery, SrcIpAddr) on SrcIpAddr
| summarize StartTimeUtc = min(StartTimeUtc), EndTimeUtc = max(EndTimeUtc), sampleNXDomainList=make_list(DnsQuery, 100)  by SrcIpAddr, dcount_sld
| extend timestamp = StartTimeUtc, IPCustomEntity = SrcIpAddr

```

## Potential DGA detected (ASIM DNS Schema)

'Identifies clients with a high NXDomain count which could be indicative of a DGA (cycling through possible C2 domains
where most C2s are not live). Alert is generated when a new IP address is seen (based on not being seen associated with 
NXDomain records in prior 10-day baseline period).
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1568|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | 983a6922-894d-413c-9f04-d7add0ecc307 |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 10d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_HighNXDomainCount_detection.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let referencestarttime = 10d;
let referenceendtime = 1d;
let threshold = 100;
let nxDomainDnsEvents = (stime:datetime, etime:datetime) 
  {_Im_Dns(responsecodename='NXDOMAIN', starttime=stime, endtime=etime)
  | where DnsQueryTypeName in ("A", "AAAA")
  | where ipv4_is_match("127.0.0.1", SrcIpAddr) == False
  | where DnsQuery !contains "/" and  DnsQuery contains "."};
nxDomainDnsEvents (stime=ago(referenceendtime) ,etime=now())
  | extend sld = tostring(split(DnsQuery, ".")[-2])
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), dcount(sld) by SrcIpAddr
  | where dcount_sld > threshold
  // Filter out previously seen IPs
  | join kind=leftanti (nxDomainDnsEvents (stime=ago(referencestarttime), etime=ago(referenceendtime))
    | extend sld = tostring(split(DnsQuery, ".")[-2])
    | summarize dcount(sld) by SrcIpAddr
    | where dcount_sld > threshold ) on SrcIpAddr
// Pull out sample NXDomain responses for those remaining potentially infected IPs
| join kind = inner (nxDomainDnsEvents (stime=ago(referencestarttime), etime=now()) | summarize by DnsQuery, SrcIpAddr) on SrcIpAddr
| summarize StartTimeUtc = min(StartTimeUtc), EndTimeUtc = max(EndTimeUtc), sampleNXDomainList=make_list(DnsQuery, 100)  by SrcIpAddr, dcount_sld
| extend timestamp = StartTimeUtc, IPCustomEntity = SrcIpAddr

```

## Potential DGA detected (ASIM DNS Schema)

'Identifies clients with a high NXDomain count which could be indicative of a DGA (cycling through possible C2 domains
where most C2s are not live). Alert is generated when a new IP address is seen (based on not being seen associated with 
NXDomain records in prior 10-day baseline period).
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1568|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | 983a6922-894d-413c-9f04-d7add0ecc307 |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 10d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_HighNXDomainCount_detection.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let referencestarttime = 10d;
let referenceendtime = 1d;
let threshold = 100;
let nxDomainDnsEvents = (stime:datetime, etime:datetime) 
  {_Im_Dns(responsecodename='NXDOMAIN', starttime=stime, endtime=etime)
  | where DnsQueryTypeName in ("A", "AAAA")
  | where ipv4_is_match("127.0.0.1", SrcIpAddr) == False
  | where DnsQuery !contains "/" and  DnsQuery contains "."};
nxDomainDnsEvents (stime=ago(referenceendtime) ,etime=now())
  | extend sld = tostring(split(DnsQuery, ".")[-2])
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), dcount(sld) by SrcIpAddr
  | where dcount_sld > threshold
  // Filter out previously seen IPs
  | join kind=leftanti (nxDomainDnsEvents (stime=ago(referencestarttime), etime=ago(referenceendtime))
    | extend sld = tostring(split(DnsQuery, ".")[-2])
    | summarize dcount(sld) by SrcIpAddr
    | where dcount_sld > threshold ) on SrcIpAddr
// Pull out sample NXDomain responses for those remaining potentially infected IPs
| join kind = inner (nxDomainDnsEvents (stime=ago(referencestarttime), etime=now()) | summarize by DnsQuery, SrcIpAddr) on SrcIpAddr
| summarize StartTimeUtc = min(StartTimeUtc), EndTimeUtc = max(EndTimeUtc), sampleNXDomainList=make_list(DnsQuery, 100)  by SrcIpAddr, dcount_sld
| extend timestamp = StartTimeUtc, IPCustomEntity = SrcIpAddr

```

## Potential DGA detected (ASIM DNS Schema)

'Identifies clients with a high NXDomain count which could be indicative of a DGA (cycling through possible C2 domains
where most C2s are not live). Alert is generated when a new IP address is seen (based on not being seen associated with 
NXDomain records in prior 10-day baseline period).
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1568|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | 983a6922-894d-413c-9f04-d7add0ecc307 |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1d |
|QueryPeriod | 10d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_HighNXDomainCount_detection.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let referencestarttime = 10d;
let referenceendtime = 1d;
let threshold = 100;
let nxDomainDnsEvents = (stime:datetime, etime:datetime) 
  {_Im_Dns(responsecodename='NXDOMAIN', starttime=stime, endtime=etime)
  | where DnsQueryTypeName in ("A", "AAAA")
  | where ipv4_is_match("127.0.0.1", SrcIpAddr) == False
  | where DnsQuery !contains "/" and  DnsQuery contains "."};
nxDomainDnsEvents (stime=ago(referenceendtime) ,etime=now())
  | extend sld = tostring(split(DnsQuery, ".")[-2])
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), dcount(sld) by SrcIpAddr
  | where dcount_sld > threshold
  // Filter out previously seen IPs
  | join kind=leftanti (nxDomainDnsEvents (stime=ago(referencestarttime), etime=ago(referenceendtime))
    | extend sld = tostring(split(DnsQuery, ".")[-2])
    | summarize dcount(sld) by SrcIpAddr
    | where dcount_sld > threshold ) on SrcIpAddr
// Pull out sample NXDomain responses for those remaining potentially infected IPs
| join kind = inner (nxDomainDnsEvents (stime=ago(referencestarttime), etime=now()) | summarize by DnsQuery, SrcIpAddr) on SrcIpAddr
| summarize StartTimeUtc = min(StartTimeUtc), EndTimeUtc = max(EndTimeUtc), sampleNXDomainList=make_list(DnsQuery, 100)  by SrcIpAddr, dcount_sld
| extend timestamp = StartTimeUtc, IPCustomEntity = SrcIpAddr

```

## Potential DGA detected (ASIM DNS Schema)

'Identifies clients with a high NXDomain count which could be indicative of a DGA (cycling through possible C2 domains
where most C2s are not live). Alert is generated when a new IP address is seen (based on not being seen associated with 
NXDomain records in prior 10-day baseline period).
This analytic rule uses [ASIM](https://aka.ms/AboutASIM) and supports any built-in or custom source that supports the ASIM DNS schema'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1568|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | 983a6922-894d-413c-9f04-d7add0ecc307 |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1d |
|QueryPeriod | 10d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ASimDNS/imDns_HighNXDomainCount_detection.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let referencestarttime = 10d;
let referenceendtime = 1d;
let threshold = 100;
let nxDomainDnsEvents = (stime:datetime, etime:datetime) 
  {_Im_Dns(responsecodename='NXDOMAIN', starttime=stime, endtime=etime)
  | where DnsQueryTypeName in ("A", "AAAA")
  | where ipv4_is_match("127.0.0.1", SrcIpAddr) == False
  | where DnsQuery !contains "/" and  DnsQuery contains "."};
nxDomainDnsEvents (stime=ago(referenceendtime) ,etime=now())
  | extend sld = tostring(split(DnsQuery, ".")[-2])
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), dcount(sld) by SrcIpAddr
  | where dcount_sld > threshold
  // Filter out previously seen IPs
  | join kind=leftanti (nxDomainDnsEvents (stime=ago(referencestarttime), etime=ago(referenceendtime))
    | extend sld = tostring(split(DnsQuery, ".")[-2])
    | summarize dcount(sld) by SrcIpAddr
    | where dcount_sld > threshold ) on SrcIpAddr
// Pull out sample NXDomain responses for those remaining potentially infected IPs
| join kind = inner (nxDomainDnsEvents (stime=ago(referencestarttime), etime=now()) | summarize by DnsQuery, SrcIpAddr) on SrcIpAddr
| summarize StartTimeUtc = min(StartTimeUtc), EndTimeUtc = max(EndTimeUtc), sampleNXDomainList=make_list(DnsQuery, 100)  by SrcIpAddr, dcount_sld
| extend timestamp = StartTimeUtc, IPCustomEntity = SrcIpAddr

```
