# Rules: 1282-1302

## TI map Domain entity to SecurityAlert

'Identifies a match in SecurityAlert table from any Domain IOC from TI'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | |
|Platform | GCP|
|DetectionType | Analytics |
|ConnectorId | MicrosoftCloudAppSecurity |
|DetectionId | 87890d78-3e05-43ec-9ab9-ba32f4e01250 |
|DataTypes | SecurityAlert |
|QueryFrequency | 1h |
|QueryPeriod | 14d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ThreatIntelligenceIndicator/DomainEntity_SecurityAlert.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let dt_lookBack = 1h;
let ioc_lookBack = 14d;
//Create a list of TLDs in our threat feed for later validation
let list_tlds = ThreatIntelligenceIndicator
| where TimeGenerated > ago(ioc_lookBack)
| where isnotempty(DomainName)
| extend parts = split(DomainName, '.')
| extend tld = parts[(array_length(parts)-1)]
| summarize count() by tostring(tld)
| summarize make_list(tld);
ThreatIntelligenceIndicator
| where TimeGenerated >= ago(ioc_lookBack) and ExpirationDateTime > now()
| summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
| where Active == true
// Picking up only IOC's that contain the entities we want
| where isnotempty(DomainName)
// using innerunique to keep perf fast and result set low, we only need one match to indicate potential malicious activity that needs to be investigated
| join kind=innerunique (
    SecurityAlert
    | where TimeGenerated > ago(dt_lookBack)
    | extend MSTI = case(AlertName has "TI map" and VendorName == "Microsoft" and ProductName == 'Azure Sentinel', true, false)
    | where MSTI == false
    //Extract domain patterns from message
    | extend domain = todynamic(dynamic_to_json(extract_all(@"(((xn--)?[a-z0-9\-]+\.)+([a-z]+|(xn--[a-z0-9]+)))", dynamic([1]), tolower(Entities))))
    | mv-expand domain
    | extend domain = tostring(domain[0])
    | extend parts = split(domain, '.')
    //Split out the TLD
    | extend tld = parts[(array_length(parts)-1)]
    //Validate parsed domain by checking if the TLD is in the list of TLDs in our threat feed
    | where tld in~ (list_tlds)
    // Converting Entities into dynamic data type and use mv-expand to unpack the array
    | extend EntitiesDynamicArray = parse_json(Entities)
    | mv-apply EntitiesDynamicArray on
        (summarize
            HostName = take_anyif(tostring(EntitiesDynamicArray.HostName), EntitiesDynamicArray.Type == "host"),
            IP_addr = take_anyif(tostring(EntitiesDynamicArray.Address), EntitiesDynamicArray.Type == "ip")
    )
    | extend Alert_TimeGenerated = TimeGenerated
    | extend Alert_Description = Description
) on $left.DomainName==$right.domain
| where Alert_TimeGenerated < ExpirationDateTime
| summarize Alert_TimeGenerated = arg_max(Alert_TimeGenerated, *) by IndicatorId, AlertName
| project Alert_TimeGenerated, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore, DomainName, AlertName, Alert_Description, ProviderName, AlertSeverity, ConfidenceLevel, HostName, IP_addr, Url, Entities
| extend timestamp = Alert_TimeGenerated, HostCustomEntity = HostName, IPCustomEntity = IP_addr, URLCustomEntity = Url

```

## TI map Domain entity to SecurityAlert

'Identifies a match in SecurityAlert table from any Domain IOC from TI'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | |
|Platform | SaaS|
|DetectionType | Analytics |
|ConnectorId | MicrosoftCloudAppSecurity |
|DetectionId | 87890d78-3e05-43ec-9ab9-ba32f4e01250 |
|DataTypes | SecurityAlert |
|QueryFrequency | 1h |
|QueryPeriod | 14d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ThreatIntelligenceIndicator/DomainEntity_SecurityAlert.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let dt_lookBack = 1h;
let ioc_lookBack = 14d;
//Create a list of TLDs in our threat feed for later validation
let list_tlds = ThreatIntelligenceIndicator
| where TimeGenerated > ago(ioc_lookBack)
| where isnotempty(DomainName)
| extend parts = split(DomainName, '.')
| extend tld = parts[(array_length(parts)-1)]
| summarize count() by tostring(tld)
| summarize make_list(tld);
ThreatIntelligenceIndicator
| where TimeGenerated >= ago(ioc_lookBack) and ExpirationDateTime > now()
| summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
| where Active == true
// Picking up only IOC's that contain the entities we want
| where isnotempty(DomainName)
// using innerunique to keep perf fast and result set low, we only need one match to indicate potential malicious activity that needs to be investigated
| join kind=innerunique (
    SecurityAlert
    | where TimeGenerated > ago(dt_lookBack)
    | extend MSTI = case(AlertName has "TI map" and VendorName == "Microsoft" and ProductName == 'Azure Sentinel', true, false)
    | where MSTI == false
    //Extract domain patterns from message
    | extend domain = todynamic(dynamic_to_json(extract_all(@"(((xn--)?[a-z0-9\-]+\.)+([a-z]+|(xn--[a-z0-9]+)))", dynamic([1]), tolower(Entities))))
    | mv-expand domain
    | extend domain = tostring(domain[0])
    | extend parts = split(domain, '.')
    //Split out the TLD
    | extend tld = parts[(array_length(parts)-1)]
    //Validate parsed domain by checking if the TLD is in the list of TLDs in our threat feed
    | where tld in~ (list_tlds)
    // Converting Entities into dynamic data type and use mv-expand to unpack the array
    | extend EntitiesDynamicArray = parse_json(Entities)
    | mv-apply EntitiesDynamicArray on
        (summarize
            HostName = take_anyif(tostring(EntitiesDynamicArray.HostName), EntitiesDynamicArray.Type == "host"),
            IP_addr = take_anyif(tostring(EntitiesDynamicArray.Address), EntitiesDynamicArray.Type == "ip")
    )
    | extend Alert_TimeGenerated = TimeGenerated
    | extend Alert_Description = Description
) on $left.DomainName==$right.domain
| where Alert_TimeGenerated < ExpirationDateTime
| summarize Alert_TimeGenerated = arg_max(Alert_TimeGenerated, *) by IndicatorId, AlertName
| project Alert_TimeGenerated, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore, DomainName, AlertName, Alert_Description, ProviderName, AlertSeverity, ConfidenceLevel, HostName, IP_addr, Url, Entities
| extend timestamp = Alert_TimeGenerated, HostCustomEntity = HostName, IPCustomEntity = IP_addr, URLCustomEntity = Url

```

## TI map Domain entity to SecurityAlert

'Identifies a match in SecurityAlert table from any Domain IOC from TI'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureSecurityCenter |
|DetectionId | 87890d78-3e05-43ec-9ab9-ba32f4e01250 |
|DataTypes | SecurityAlert |
|QueryFrequency | 1h |
|QueryPeriod | 14d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ThreatIntelligenceIndicator/DomainEntity_SecurityAlert.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let dt_lookBack = 1h;
let ioc_lookBack = 14d;
//Create a list of TLDs in our threat feed for later validation
let list_tlds = ThreatIntelligenceIndicator
| where TimeGenerated > ago(ioc_lookBack)
| where isnotempty(DomainName)
| extend parts = split(DomainName, '.')
| extend tld = parts[(array_length(parts)-1)]
| summarize count() by tostring(tld)
| summarize make_list(tld);
ThreatIntelligenceIndicator
| where TimeGenerated >= ago(ioc_lookBack) and ExpirationDateTime > now()
| summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
| where Active == true
// Picking up only IOC's that contain the entities we want
| where isnotempty(DomainName)
// using innerunique to keep perf fast and result set low, we only need one match to indicate potential malicious activity that needs to be investigated
| join kind=innerunique (
    SecurityAlert
    | where TimeGenerated > ago(dt_lookBack)
    | extend MSTI = case(AlertName has "TI map" and VendorName == "Microsoft" and ProductName == 'Azure Sentinel', true, false)
    | where MSTI == false
    //Extract domain patterns from message
    | extend domain = todynamic(dynamic_to_json(extract_all(@"(((xn--)?[a-z0-9\-]+\.)+([a-z]+|(xn--[a-z0-9]+)))", dynamic([1]), tolower(Entities))))
    | mv-expand domain
    | extend domain = tostring(domain[0])
    | extend parts = split(domain, '.')
    //Split out the TLD
    | extend tld = parts[(array_length(parts)-1)]
    //Validate parsed domain by checking if the TLD is in the list of TLDs in our threat feed
    | where tld in~ (list_tlds)
    // Converting Entities into dynamic data type and use mv-expand to unpack the array
    | extend EntitiesDynamicArray = parse_json(Entities)
    | mv-apply EntitiesDynamicArray on
        (summarize
            HostName = take_anyif(tostring(EntitiesDynamicArray.HostName), EntitiesDynamicArray.Type == "host"),
            IP_addr = take_anyif(tostring(EntitiesDynamicArray.Address), EntitiesDynamicArray.Type == "ip")
    )
    | extend Alert_TimeGenerated = TimeGenerated
    | extend Alert_Description = Description
) on $left.DomainName==$right.domain
| where Alert_TimeGenerated < ExpirationDateTime
| summarize Alert_TimeGenerated = arg_max(Alert_TimeGenerated, *) by IndicatorId, AlertName
| project Alert_TimeGenerated, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore, DomainName, AlertName, Alert_Description, ProviderName, AlertSeverity, ConfidenceLevel, HostName, IP_addr, Url, Entities
| extend timestamp = Alert_TimeGenerated, HostCustomEntity = HostName, IPCustomEntity = IP_addr, URLCustomEntity = Url

```

## TI map Domain entity to SecurityAlert

'Identifies a match in SecurityAlert table from any Domain IOC from TI'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | |
|Platform | SaaS|
|DetectionType | Analytics |
|ConnectorId | AzureSecurityCenter |
|DetectionId | 87890d78-3e05-43ec-9ab9-ba32f4e01250 |
|DataTypes | SecurityAlert |
|QueryFrequency | 1h |
|QueryPeriod | 14d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ThreatIntelligenceIndicator/DomainEntity_SecurityAlert.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let dt_lookBack = 1h;
let ioc_lookBack = 14d;
//Create a list of TLDs in our threat feed for later validation
let list_tlds = ThreatIntelligenceIndicator
| where TimeGenerated > ago(ioc_lookBack)
| where isnotempty(DomainName)
| extend parts = split(DomainName, '.')
| extend tld = parts[(array_length(parts)-1)]
| summarize count() by tostring(tld)
| summarize make_list(tld);
ThreatIntelligenceIndicator
| where TimeGenerated >= ago(ioc_lookBack) and ExpirationDateTime > now()
| summarize LatestIndicatorTime = arg_max(TimeGenerated, *) by IndicatorId
| where Active == true
// Picking up only IOC's that contain the entities we want
| where isnotempty(DomainName)
// using innerunique to keep perf fast and result set low, we only need one match to indicate potential malicious activity that needs to be investigated
| join kind=innerunique (
    SecurityAlert
    | where TimeGenerated > ago(dt_lookBack)
    | extend MSTI = case(AlertName has "TI map" and VendorName == "Microsoft" and ProductName == 'Azure Sentinel', true, false)
    | where MSTI == false
    //Extract domain patterns from message
    | extend domain = todynamic(dynamic_to_json(extract_all(@"(((xn--)?[a-z0-9\-]+\.)+([a-z]+|(xn--[a-z0-9]+)))", dynamic([1]), tolower(Entities))))
    | mv-expand domain
    | extend domain = tostring(domain[0])
    | extend parts = split(domain, '.')
    //Split out the TLD
    | extend tld = parts[(array_length(parts)-1)]
    //Validate parsed domain by checking if the TLD is in the list of TLDs in our threat feed
    | where tld in~ (list_tlds)
    // Converting Entities into dynamic data type and use mv-expand to unpack the array
    | extend EntitiesDynamicArray = parse_json(Entities)
    | mv-apply EntitiesDynamicArray on
        (summarize
            HostName = take_anyif(tostring(EntitiesDynamicArray.HostName), EntitiesDynamicArray.Type == "host"),
            IP_addr = take_anyif(tostring(EntitiesDynamicArray.Address), EntitiesDynamicArray.Type == "ip")
    )
    | extend Alert_TimeGenerated = TimeGenerated
    | extend Alert_Description = Description
) on $left.DomainName==$right.domain
| where Alert_TimeGenerated < ExpirationDateTime
| summarize Alert_TimeGenerated = arg_max(Alert_TimeGenerated, *) by IndicatorId, AlertName
| project Alert_TimeGenerated, Description, ActivityGroupNames, IndicatorId, ThreatType, ExpirationDateTime, ConfidenceScore, DomainName, AlertName, Alert_Description, ProviderName, AlertSeverity, ConfidenceLevel, HostName, IP_addr, Url, Entities
| extend timestamp = Alert_TimeGenerated, HostCustomEntity = HostName, IPCustomEntity = IP_addr, URLCustomEntity = Url

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1046|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1046|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1046|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1071|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1071|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1071|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1210|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1210|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1210|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1046|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1046|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1046|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1071|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1071|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1071|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1210|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```
