# Rules: 4159-4179

## Consent to Application discovery

'This query looks at the last 14 days for any "Consent to application" operation
occurs by a user or app. This could indicate that permissions to access the listed AzureApp
was provided to a malicious actor. Consent to appliction, Add service principal and
Add OAuth2PermissionGrant events should be rare. If available, additional context is added
from the AuditLogs based on CorrleationId from the same account that performed "Consent to
application".
For further information on AuditLogs please see
https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities
This may help detect the Oauth2 attack that can be initiated by this publicly available tool
https://github.com/fireeye/PwnAuth'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1136|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | b09d6e57-c48b-491d-9c2b-ab73018e6534 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AuditLogs/ConsentToApplicationDiscovery.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let auditLookback = starttime - 14d;
// Setting threshold to 3 as a default, change as needed.  Any operation that has been initiated by a user or app more than 3 times in the past 30 days will be exluded
let threshold = 3;
// Helper function to extract relevant fields from AuditLog events
let auditLogEvents = view (startTimeSpan:timespan)  {
    AuditLogs | where TimeGenerated >= auditLookback
    | extend ModProps = TargetResources.[0].modifiedProperties
    | extend IpAddress = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)),
    tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), tostring(parse_json(tostring(InitiatedBy.app)).ipAddress))
    | extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)),
    tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName))
    | extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))
    | mvexpand ModProps
    | extend PropertyName = tostring(ModProps.displayName), newValue = replace('\"',"",tostring(ModProps.newValue));
};
// Get just the InitiatedBy and CorrleationId so we can look at associated audit activity
// 2 other operations that can be part of malicious activity in this situation are
// "Add OAuth2PermissionGrant" and "Add service principal", replace the below if you are interested in those as starting points for OperationName
let HistoricalConsent = auditLogEvents(auditLookback)
| where OperationName == "Consent to application"
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), OperationCount = count()
by Type, InitiatedBy, IpAddress, TargetResourceName, Category, OperationName, PropertyName, newValue, CorrelationId, Id
// Remove comment below to only include operations initiated by a user or app that is above the threshold for the last 30 days
//| where OperationCount > threshold
;
let Correlate = HistoricalConsent
| summarize by InitiatedBy, CorrelationId;
// 2 other operations that can be part of malicious activity in this situation are
// "Add OAuth2PermissionGrant" and "Add service principal", replace the below if you changed the starting OperationName above
let allOtherEvents = auditLogEvents(auditLookback)
| where OperationName != "Consent to application";
// Gather associated activity based on audit activity for "Consent to application" and InitiatedBy and CorrleationId
let CorrelatedEvents = Correlate
| join allOtherEvents on InitiatedBy, CorrelationId
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated)
by Type, InitiatedBy, IpAddress, TargetResourceName, Category, OperationName, PropertyName, newValue, CorrelationId, Id
;
// Union the results
let Results = (union isfuzzy=true HistoricalConsent,CorrelatedEvents);
// newValues that are simple semi-colon separated, make those dynamic for easy viewing and Aggregate into the PropertyUpdate set based on CorrelationId and Id(DirectoryId)
Results
| extend newValue = split(newValue, ";")
| extend PropertyUpdate = pack(PropertyName, newValue, "Id", Id)
// Extract scope requested
| extend perms = tostring(parse_json(tostring(PropertyUpdate.["ConsentAction.Permissions"]))[0])
| extend scope = extract('Scope:\\s*([^,\\]]*)',1, perms)
// Filter out some common openid, and low privilege request scopes - uncomment line below to filter out where no scope is requested
//| where isnotempty(scope)
| where scope !contains 'openid' and scope !in ('user_impersonation','User.Read')
| summarize StartTime = min(StartTimeUtc), EndTime = max(EndTimeUtc), PropertyUpdateSet = make_bag(PropertyUpdate) , make_set(scope)
  by InitiatedBy, IpAddress, TargetResourceName, OperationName, CorrelationId
| extend timestamp = StartTime, AccountCustomEntity = InitiatedBy, IPCustomEntity = IpAddress
// uncommnet below to summarize by app if many results
//| summarize make_set(InitiatedBy), make_set(IpAddress), make_set(PropertyUpdateSet) by TargetResourceName, tostring(set_scope)

```

## Users Authenticating to Other Azure AD Tenants

'Detects when a user has successfully authenticated to another Azure AD tenant with an identity in your organization's tenant.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-for-failed-unusual-sign-ins'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 9b4a1f38-2fae-44dd-9e85-685a2e4b9bb5 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AuditLogs/UsersAuthenticatingtoOtherAzureADTenants.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs
  | where TimeGenerated between(ago(14d)..ago(1d))
  | where ResultType == 0
  | where HomeTenantId != ResourceTenantId
  | summarize by UserPrincipalName, ResourceTenantId
  | join kind=rightanti (SigninLogs
  | where TimeGenerated > ago(1d)
  | where ResultType == 0
  | where HomeTenantId != ResourceTenantId
  | where isnotempty(HomeTenantId) and isnotempty(ResourceTenantId)) on UserPrincipalName, ResourceTenantId
  | where RiskLevelAggregated != "none"

```

## Users Authenticating to Other Azure AD Tenants

'Detects when a user has successfully authenticated to another Azure AD tenant with an identity in your organization's tenant.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-for-failed-unusual-sign-ins'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 9b4a1f38-2fae-44dd-9e85-685a2e4b9bb5 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AuditLogs/UsersAuthenticatingtoOtherAzureADTenants.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SigninLogs
  | where TimeGenerated between(ago(14d)..ago(1d))
  | where ResultType == 0
  | where HomeTenantId != ResourceTenantId
  | summarize by UserPrincipalName, ResourceTenantId
  | join kind=rightanti (SigninLogs
  | where TimeGenerated > ago(1d)
  | where ResultType == 0
  | where HomeTenantId != ResourceTenantId
  | where isnotempty(HomeTenantId) and isnotempty(ResourceTenantId)) on UserPrincipalName, ResourceTenantId
  | where RiskLevelAggregated != "none"

```

## BitLocker Key Retrieval

'Looks for users retrieving BitLocker keys. Enriches these logs with a summary of alerts associated with the user accessing the keys.
Use this query to start looking for anomalous patterns of key retrieval.
Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-devices#bitlocker-key-retrieval'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1555|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 8ea8b2af-f1ce-4464-964c-6763641cc4f6 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AuditLogs/BitLockerKeyRetrieval.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
  | where OperationName =~ "Read BitLocker key"
  | extend userPrincipalName = tolower(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
  | extend KeyId = tostring(TargetResources[0].displayName)
  | extend ipAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
  | summarize keys_accessed=dcount(KeyId), ipAddresses=make_set(ipAddress) by userPrincipalName
  | join kind=leftouter (SecurityAlert
  | where ProviderName =~ "IPC"
  | extend userPrincipalName = tolower(tostring(parse_json(ExtendedProperties).["User Account"]))
  | summarize user_alert_count=count() by userPrincipalName) on userPrincipalName
  | project userPrincipalName, keys_accessed, ipAddresses, user_alert_count

```

## BitLocker Key Retrieval

'Looks for users retrieving BitLocker keys. Enriches these logs with a summary of alerts associated with the user accessing the keys.
Use this query to start looking for anomalous patterns of key retrieval.
Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-devices#bitlocker-key-retrieval'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1555|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 8ea8b2af-f1ce-4464-964c-6763641cc4f6 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AuditLogs/BitLockerKeyRetrieval.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
  | where OperationName =~ "Read BitLocker key"
  | extend userPrincipalName = tolower(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
  | extend KeyId = tostring(TargetResources[0].displayName)
  | extend ipAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
  | summarize keys_accessed=dcount(KeyId), ipAddresses=make_set(ipAddress) by userPrincipalName
  | join kind=leftouter (SecurityAlert
  | where ProviderName =~ "IPC"
  | extend userPrincipalName = tolower(tostring(parse_json(ExtendedProperties).["User Account"]))
  | summarize user_alert_count=count() by userPrincipalName) on userPrincipalName
  | project userPrincipalName, keys_accessed, ipAddresses, user_alert_count

```

## Interactive STS refresh token modifications

'This will show Active Directory Security Token Service (STS) refresh token modifications by Service Principals and Applications other than DirectorySync. Refresh tokens are used to validate identification and obtain access tokens.
This event is not necessarily an indication of malicious activity but can also be generated when legitimate administrators manually expire token validation or keep longer refresh tokens for better login experience with less prompts.
Also an allowlist has been included to filter known accounts which can be customized after careful review of past historical activity.
Analyze the results for unusual operations performed by administrators to extend a refresh token of a compromised account in order to extend the time they can use it without the need to re-authenticate (and thus potentially lose access).
For in-depth documentation of AAD Security Tokens, see https://docs.microsoft.com/azure/active-directory/develop/security-tokens.
For further information on AuditLogs please see https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities.
For valid use cases of altering token lifetime values, refer https://docs.microsoft.com/azure/active-directory/develop/access-tokens#token-timeouts
More information about risky use-cases, refer https://docs.microsoft.com/azure/active-directory/develop/active-directory-configurable-token-lifetimes#token-lifetimes-with-public-client-refresh-tokens'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1550.001|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 4696e072-aca8-4a4f-bf05-89fddc5ac3c9 |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AuditLogs/StsRefreshTokenModification.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Include your additions to the allow list below as needed
let AllowedUserList = dynamic(["Microsoft Cloud App Security","ADConnectSyncAccount1","SyncAccount2"]);
AuditLogs
| where OperationName has 'StsRefreshTokenValidFrom'
| where TargetResources[0].modifiedProperties != '[]'
| where TargetResources[0].modifiedProperties !has 'DirectorySync'
| extend TargetResourcesModProps = TargetResources[0].modifiedProperties
| mv-expand TargetResourcesModProps
| where tostring(TargetResourcesModProps.displayName) =~ 'StsRefreshTokensValidFrom'
| extend InitiatingUserOrApp = iff(isnotempty(InitiatedBy.user.userPrincipalName),tostring(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.app.displayName))
| where InitiatingUserOrApp !in (AllowedUserList)
| extend targetUserOrApp = TargetResources[0].userPrincipalName
| extend eventName = tostring(TargetResourcesModProps.displayName)
| extend oldStsRefreshValidFrom = todatetime(parse_json(tostring(TargetResourcesModProps.oldValue))[0])
| extend newStsRefreshValidFrom = todatetime(parse_json(tostring(TargetResourcesModProps.newValue))[0])
| extend tokenMinutesAdded = datetime_diff('minute',newStsRefreshValidFrom,oldStsRefreshValidFrom)
| extend tokenMinutesRemaining = datetime_diff('minute',TimeGenerated,newStsRefreshValidFrom)
| project-reorder Result, AADOperationType
| extend InitiatingIpAddress = iff(isnotempty(InitiatedBy.user.ipAddress), tostring(InitiatedBy.user.ipAddress), tostring(InitiatedBy.app.ipAddress))
| extend timestamp = TimeGenerated, AccountCustomEntity = InitiatingUserOrApp, IPCustomEntity = InitiatingIpAddress

```

## Interactive STS refresh token modifications

'This will show Active Directory Security Token Service (STS) refresh token modifications by Service Principals and Applications other than DirectorySync. Refresh tokens are used to validate identification and obtain access tokens.
This event is not necessarily an indication of malicious activity but can also be generated when legitimate administrators manually expire token validation or keep longer refresh tokens for better login experience with less prompts.
Also an allowlist has been included to filter known accounts which can be customized after careful review of past historical activity.
Analyze the results for unusual operations performed by administrators to extend a refresh token of a compromised account in order to extend the time they can use it without the need to re-authenticate (and thus potentially lose access).
For in-depth documentation of AAD Security Tokens, see https://docs.microsoft.com/azure/active-directory/develop/security-tokens.
For further information on AuditLogs please see https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities.
For valid use cases of altering token lifetime values, refer https://docs.microsoft.com/azure/active-directory/develop/access-tokens#token-timeouts
More information about risky use-cases, refer https://docs.microsoft.com/azure/active-directory/develop/active-directory-configurable-token-lifetimes#token-lifetimes-with-public-client-refresh-tokens'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1550.001|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 4696e072-aca8-4a4f-bf05-89fddc5ac3c9 |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AuditLogs/StsRefreshTokenModification.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Include your additions to the allow list below as needed
let AllowedUserList = dynamic(["Microsoft Cloud App Security","ADConnectSyncAccount1","SyncAccount2"]);
AuditLogs
| where OperationName has 'StsRefreshTokenValidFrom'
| where TargetResources[0].modifiedProperties != '[]'
| where TargetResources[0].modifiedProperties !has 'DirectorySync'
| extend TargetResourcesModProps = TargetResources[0].modifiedProperties
| mv-expand TargetResourcesModProps
| where tostring(TargetResourcesModProps.displayName) =~ 'StsRefreshTokensValidFrom'
| extend InitiatingUserOrApp = iff(isnotempty(InitiatedBy.user.userPrincipalName),tostring(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.app.displayName))
| where InitiatingUserOrApp !in (AllowedUserList)
| extend targetUserOrApp = TargetResources[0].userPrincipalName
| extend eventName = tostring(TargetResourcesModProps.displayName)
| extend oldStsRefreshValidFrom = todatetime(parse_json(tostring(TargetResourcesModProps.oldValue))[0])
| extend newStsRefreshValidFrom = todatetime(parse_json(tostring(TargetResourcesModProps.newValue))[0])
| extend tokenMinutesAdded = datetime_diff('minute',newStsRefreshValidFrom,oldStsRefreshValidFrom)
| extend tokenMinutesRemaining = datetime_diff('minute',TimeGenerated,newStsRefreshValidFrom)
| project-reorder Result, AADOperationType
| extend InitiatingIpAddress = iff(isnotempty(InitiatedBy.user.ipAddress), tostring(InitiatedBy.user.ipAddress), tostring(InitiatedBy.app.ipAddress))
| extend timestamp = TimeGenerated, AccountCustomEntity = InitiatingUserOrApp, IPCustomEntity = InitiatingIpAddress

```

## ProofpointPOD - Large size outbound emails

'Search for emails which size is 2 times grater than average size of outbound email for user.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | dd9674cf-898b-4c80-96f1-f70bec66e6fc |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODLargeOutboundEmails.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let out_msg = ProofpointPOD
| where TimeGenerated between (lookback..starttime)
| where EventType == 'message'
| where NetworkDirection == 'outbound'
| where SrcUserUpn != '';
ProofpointPOD
| where TimeGenerated between(starttime..endtime)
| where EventType == 'message'
| where NetworkDirection == 'outbound'
| where SrcUserUpn != ''
| summarize AvgMsgSize = toint(avg(NetworkBytes_real)) by SrcUserUpn
| join out_msg on SrcUserUpn
| where NetworkBytes_real > AvgMsgSize*2
| project SrcUserUpn, AvgMsgSize, NetworkBytes_real
| extend AccountCustomEntity = SrcUserUpn
```

## ProofpointPOD - Suspicious file types in attachments

'Hunting for suspicious file types in attachments.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | 7b281f4a-6a9a-439f-8b4f-f08eb24f2fb7 |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODSuspiciousFileTypesInAttachments.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
ProofpointPOD
| where EventType == 'message'
| where NetworkDirection == 'inbound'
| extend attachedFileType = todynamic(MsgParts)[0]['detectedExt']
| summarize count() by tostring(attachedFileType)
| sort by count_
```

## ProofpointPOD - Emails with high score of 'adult' filter classifier value

'Search for emails with high score of 'adult' filter classifier value.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | 0794a162-8635-43fd-81ed-2cf2604575b1 |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODHighScoreAdultValue.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let scoreThreshold = 80;
ProofpointPOD
| where EventType == 'message'
| where NetworkDirection == 'inbound'
| where todynamic(FilterModulesSpamScoresClassifiers).adult > scoreThreshold
```

## ProofpointPOD - Emails with high score of 'spam' filter classifier value

'Search for emails with high score of 'spam' filter classifier value.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | c9ff3690-b754-4c91-b866-4d07098da074 |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODHighScoreSpamValue.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let scoreThreshold = 80;
ProofpointPOD
| where EventType == 'message'
| where NetworkDirection == 'inbound'
| where todynamic(FilterModulesSpamScoresClassifiers).spam > scoreThreshold
```

## ProofpointPOD - Recipients with large number of corrupted emails

'Search for recipients with large number of corrupted emails.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | c334e1e8-a7da-4c23-a9c0-fdda26b07606 |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODRecipientsLargeNumberOfCorruptedEmails.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
ProofpointPOD
| where EventType == 'message'
| where NetworkDirection == 'inbound'
| extend isCorrupted = todynamic(MsgParts)[0]['isCorrupted']
| where isCorrupted == 'true'
| summarize count() by DstUserUpn
| sort by count_
| where count_ > 10
```

## ProofpointPOD - Emails with high score of 'malware' filter classifier value

'Search for emails with high score of 'malware' filter classifier value.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | eb74aaab-ebf4-4763-9b03-b1a33fe48600 |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODHighScoreMalwareValue.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let scoreThreshold = 80;
ProofpointPOD
| where EventType == 'message'
| where NetworkDirection == 'inbound'
| where todynamic(FilterModulesSpamScoresClassifiers).malware > scoreThreshold
```

## ProofpointPOD - Emails with high score of 'suspect' filter classifier value

'Search for emails with high score of 'suspect' filter classifier value.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | bc619ce8-0807-4b13-93ea-0d7b79c7ee68 |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODHighScoreSuspectValue.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let scoreThreshold = 80;
ProofpointPOD
| where EventType == 'message'
| where NetworkDirection == 'inbound'
| where todynamic(FilterModulesSpamScoresClassifiers).suspect > scoreThreshold
```

## ProofpointPOD - Recipients with high number of discarded or rejected emails

'Search for recipients with high number of discarded or rejected emails.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | d324e435-31d3-4aa3-907c-76f4917820a9 |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODRecipientsHighNumberDiscardReject.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let threshold = 10;
ProofpointPOD
| where EventType == 'message'
| where NetworkDirection == 'inbound'
| where FilterDisposition !in ('reject', 'discard')
| summarize count() by DstUserUpn
| where count_ > threshold
| extend AccountCustomEntity = DstUserUpn
```

## ProofpointPOD - Emails with high score of 'phish' filter classifier value

'Search for emails with high score of 'phish' filter classifier value.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | a0d56fcd-edb3-46f1-aaa3-12d606a48ff1 |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODHighScorePhishValue.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let scoreThreshold = 80;
ProofpointPOD
| where EventType == 'message'
| where NetworkDirection == 'inbound'
| where todynamic(FilterModulesSpamScoresClassifiers).phish > scoreThreshold
```

## ProofpointPOD - Senders with large number of corrupted messages

'Search for senders with large number of corrupted messages.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | |
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | ProofpointPOD |
|DetectionId | af7f133a-5fed-4ebf-8272-4330c884c7ca |
|DataTypes | ProofpointPOD_message_CL |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/ProofpointPOD/ProofpointPODSendersLargeNumberOfCorruptedEmails.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
ProofpointPOD
| where EventType == 'message'
| where NetworkDirection == 'outbound'
| extend isCorrupted = todynamic(MsgParts)[0]['isCorrupted']
| where isCorrupted == 'true'
| summarize count() by SrcUserUpn
| sort by count_
| where count_ > 10
```

## Detect beacon like pattern based on repetitive time intervals in Wire Data Traffic

'This query will identify beaconing patterns from Wire Data logs based on timedelta patterns. The query leverages various KQL functions
to calculate time delta and then compare it with total events observed in a day to find percentage of beaconing.
Results of such beaconing patterns to untrusted public networks can be a good starting point for investigation.
References: Blog about creating dataset to identify network beaconing via repetitive time intervals seen against total traffic
between same source-destination pair.
http://www.austintaylor.io/detect/beaconing/intrusion/detection/system/command/control/flare/elastic/stack/2017/06/10/detect-beaconing-with-flare-elasticsearch-and-intrusion-detection-systems/'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureMonitor(WireData) |
|DetectionId | 33aa0e01-87e2-43ea-87f9-2f7e3ff1d532 |
|DataTypes | WireData |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/WireData/WireDataBeacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let lookback = 1d;
let TimeDeltaThreshold = 10;
let TotalEventsThreshold = 15;
let PercentBeaconThreshold = 95;
WireData
| where TimeGenerated > lookback
| where ipv4_is_private(RemoteIP) == false
| project TimeGenerated , LocalIP , LocalPortNumber , RemoteIP, RemotePortNumber, ReceivedBytes, SentBytes
| sort by LocalIP asc,TimeGenerated asc, RemoteIP asc, RemotePortNumber asc
| serialize
| extend nextTimeGenerated = next(TimeGenerated, 1), nextLocalIP = next(LocalIP, 1)
| extend TimeDeltainSeconds = datetime_diff('second',nextTimeGenerated,TimeGenerated)
| where LocalIP == nextLocalIP
//Whitelisting criteria/ threshold criteria
| where TimeDeltainSeconds > TimeDeltaThreshold
| where RemotePortNumber != "0"
| project TimeGenerated, TimeDeltainSeconds, LocalIP, LocalPortNumber,RemoteIP,RemotePortNumber, ReceivedBytes, SentBytes
| summarize count(), sum(ReceivedBytes), sum(SentBytes), make_list(TimeDeltainSeconds) by TimeDeltainSeconds, bin(TimeGenerated, 1h), LocalIP, RemoteIP, RemotePortNumber
| summarize (MostFrequentTimeDeltaCount, MostFrequentTimeDeltainSeconds)=arg_max(count_, TimeDeltainSeconds), TotalEvents=sum(count_), TotalSentBytes=sum(sum_SentBytes),TotalReceivedBytes=sum(sum_ReceivedBytes) by bin(TimeGenerated, 1h), LocalIP, RemoteIP, RemotePortNumber
| where TotalEvents > TotalEventsThreshold
| extend BeaconPercent = MostFrequentTimeDeltaCount/toreal(TotalEvents) * 100
| where BeaconPercent > PercentBeaconThreshold
| extend timestamp = TimeGenerated, IPCustomEntity = RemoteIP

```

## Detect beacon like pattern based on repetitive time intervals in Wire Data Traffic

'This query will identify beaconing patterns from Wire Data logs based on timedelta patterns. The query leverages various KQL functions
to calculate time delta and then compare it with total events observed in a day to find percentage of beaconing.
Results of such beaconing patterns to untrusted public networks can be a good starting point for investigation.
References: Blog about creating dataset to identify network beaconing via repetitive time intervals seen against total traffic
between same source-destination pair.
http://www.austintaylor.io/detect/beaconing/intrusion/detection/system/command/control/flare/elastic/stack/2017/06/10/detect-beaconing-with-flare-elasticsearch-and-intrusion-detection-systems/'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | AzureMonitor(WireData) |
|DetectionId | 33aa0e01-87e2-43ea-87f9-2f7e3ff1d532 |
|DataTypes | WireData |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/WireData/WireDataBeacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let lookback = 1d;
let TimeDeltaThreshold = 10;
let TotalEventsThreshold = 15;
let PercentBeaconThreshold = 95;
WireData
| where TimeGenerated > lookback
| where ipv4_is_private(RemoteIP) == false
| project TimeGenerated , LocalIP , LocalPortNumber , RemoteIP, RemotePortNumber, ReceivedBytes, SentBytes
| sort by LocalIP asc,TimeGenerated asc, RemoteIP asc, RemotePortNumber asc
| serialize
| extend nextTimeGenerated = next(TimeGenerated, 1), nextLocalIP = next(LocalIP, 1)
| extend TimeDeltainSeconds = datetime_diff('second',nextTimeGenerated,TimeGenerated)
| where LocalIP == nextLocalIP
//Whitelisting criteria/ threshold criteria
| where TimeDeltainSeconds > TimeDeltaThreshold
| where RemotePortNumber != "0"
| project TimeGenerated, TimeDeltainSeconds, LocalIP, LocalPortNumber,RemoteIP,RemotePortNumber, ReceivedBytes, SentBytes
| summarize count(), sum(ReceivedBytes), sum(SentBytes), make_list(TimeDeltainSeconds) by TimeDeltainSeconds, bin(TimeGenerated, 1h), LocalIP, RemoteIP, RemotePortNumber
| summarize (MostFrequentTimeDeltaCount, MostFrequentTimeDeltainSeconds)=arg_max(count_, TimeDeltainSeconds), TotalEvents=sum(count_), TotalSentBytes=sum(sum_SentBytes),TotalReceivedBytes=sum(sum_ReceivedBytes) by bin(TimeGenerated, 1h), LocalIP, RemoteIP, RemotePortNumber
| where TotalEvents > TotalEventsThreshold
| extend BeaconPercent = MostFrequentTimeDeltaCount/toreal(TotalEvents) * 100
| where BeaconPercent > PercentBeaconThreshold
| extend timestamp = TimeGenerated, IPCustomEntity = RemoteIP

```

## Detect beacon like pattern based on repetitive time intervals in Wire Data Traffic

'This query will identify beaconing patterns from Wire Data logs based on timedelta patterns. The query leverages various KQL functions
to calculate time delta and then compare it with total events observed in a day to find percentage of beaconing.
Results of such beaconing patterns to untrusted public networks can be a good starting point for investigation.
References: Blog about creating dataset to identify network beaconing via repetitive time intervals seen against total traffic
between same source-destination pair.
http://www.austintaylor.io/detect/beaconing/intrusion/detection/system/command/control/flare/elastic/stack/2017/06/10/detect-beaconing-with-flare-elasticsearch-and-intrusion-detection-systems/'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | AzureMonitor(WireData) |
|DetectionId | 33aa0e01-87e2-43ea-87f9-2f7e3ff1d532 |
|DataTypes | WireData |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/WireData/WireDataBeacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let lookback = 1d;
let TimeDeltaThreshold = 10;
let TotalEventsThreshold = 15;
let PercentBeaconThreshold = 95;
WireData
| where TimeGenerated > lookback
| where ipv4_is_private(RemoteIP) == false
| project TimeGenerated , LocalIP , LocalPortNumber , RemoteIP, RemotePortNumber, ReceivedBytes, SentBytes
| sort by LocalIP asc,TimeGenerated asc, RemoteIP asc, RemotePortNumber asc
| serialize
| extend nextTimeGenerated = next(TimeGenerated, 1), nextLocalIP = next(LocalIP, 1)
| extend TimeDeltainSeconds = datetime_diff('second',nextTimeGenerated,TimeGenerated)
| where LocalIP == nextLocalIP
//Whitelisting criteria/ threshold criteria
| where TimeDeltainSeconds > TimeDeltaThreshold
| where RemotePortNumber != "0"
| project TimeGenerated, TimeDeltainSeconds, LocalIP, LocalPortNumber,RemoteIP,RemotePortNumber, ReceivedBytes, SentBytes
| summarize count(), sum(ReceivedBytes), sum(SentBytes), make_list(TimeDeltainSeconds) by TimeDeltainSeconds, bin(TimeGenerated, 1h), LocalIP, RemoteIP, RemotePortNumber
| summarize (MostFrequentTimeDeltaCount, MostFrequentTimeDeltainSeconds)=arg_max(count_, TimeDeltainSeconds), TotalEvents=sum(count_), TotalSentBytes=sum(sum_SentBytes),TotalReceivedBytes=sum(sum_ReceivedBytes) by bin(TimeGenerated, 1h), LocalIP, RemoteIP, RemotePortNumber
| where TotalEvents > TotalEventsThreshold
| extend BeaconPercent = MostFrequentTimeDeltaCount/toreal(TotalEvents) * 100
| where BeaconPercent > PercentBeaconThreshold
| extend timestamp = TimeGenerated, IPCustomEntity = RemoteIP

```
