# Rules: 4978-4998

## Suspicious enumeration using Adfind tool

Attackers can use Adfind which is administrative tool to gather information about Domain controllers, ADFS Servers. They may also rename executables with other benign tools on the system.
Below query will look for adfind usage in commandline arguments irrespective of executable name in short span of time. You can limit query this to your DC and ADFS servers.
Below references talk about suspicious use of adfind by adversaries.
- https://thedfirreport.com/2020/05/08/adfind-recon/
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1482|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | dd6fb889-43ef-44e1-a01d-093ab4bb12b2 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Suspicious_enumeration_using_adfind.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let lookupwindow = 2m;
let threshold = 3; //number of commandlines in the set below
let DCADFSServersList = dynamic (["DCServer01", "DCServer02", "ADFSServer01"]); // Enter a reference list of hostnames for your DC/ADFS servers
let tokens = dynamic(["objectcategory","domainlist","dcmodes","adinfo","trustdmp","computers_pwdnotreqd","Domain Admins", "objectcategory=person", "objectcategory=computer", "objectcategory=*"]);
SecurityEvent
//| where Computer in (DCADFSServersList) // Uncomment to limit it to your DC/ADFS servers list if specified above or any pattern in hostnames (startswith, matches regex, etc).
| where EventID == 4688
| where CommandLine has_any (tokens)
| where CommandLine matches regex "(.*)>(.*)"
| summarize Commandlines = make_set(CommandLine), LastObserved=max(TimeGenerated) by bin(TimeGenerated, lookupwindow), Account, Computer, ParentProcessName, NewProcessName
| extend Count = array_length(Commandlines)
| where Count > threshold

```

## Suspicious enumeration using Adfind tool

Attackers can use Adfind which is administrative tool to gather information about Domain controllers, ADFS Servers. They may also rename executables with other benign tools on the system.
Below query will look for adfind usage in commandline arguments irrespective of executable name in short span of time. You can limit query this to your DC and ADFS servers.
Below references talk about suspicious use of adfind by adversaries.
- https://thedfirreport.com/2020/05/08/adfind-recon/
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1201|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | dd6fb889-43ef-44e1-a01d-093ab4bb12b2 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Suspicious_enumeration_using_adfind.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let lookupwindow = 2m;
let threshold = 3; //number of commandlines in the set below
let DCADFSServersList = dynamic (["DCServer01", "DCServer02", "ADFSServer01"]); // Enter a reference list of hostnames for your DC/ADFS servers
let tokens = dynamic(["objectcategory","domainlist","dcmodes","adinfo","trustdmp","computers_pwdnotreqd","Domain Admins", "objectcategory=person", "objectcategory=computer", "objectcategory=*"]);
SecurityEvent
//| where Computer in (DCADFSServersList) // Uncomment to limit it to your DC/ADFS servers list if specified above or any pattern in hostnames (startswith, matches regex, etc).
| where EventID == 4688
| where CommandLine has_any (tokens)
| where CommandLine matches regex "(.*)>(.*)"
| summarize Commandlines = make_set(CommandLine), LastObserved=max(TimeGenerated) by bin(TimeGenerated, lookupwindow), Account, Computer, ParentProcessName, NewProcessName
| extend Count = array_length(Commandlines)
| where Count > threshold

```

## Suspicious enumeration using Adfind tool

Attackers can use Adfind which is administrative tool to gather information about Domain controllers, ADFS Servers. They may also rename executables with other benign tools on the system.
Below query will look for adfind usage in commandline arguments irrespective of executable name in short span of time. You can limit query this to your DC and ADFS servers.
Below references talk about suspicious use of adfind by adversaries.
- https://thedfirreport.com/2020/05/08/adfind-recon/
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1069|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | dd6fb889-43ef-44e1-a01d-093ab4bb12b2 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Suspicious_enumeration_using_adfind.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let lookupwindow = 2m;
let threshold = 3; //number of commandlines in the set below
let DCADFSServersList = dynamic (["DCServer01", "DCServer02", "ADFSServer01"]); // Enter a reference list of hostnames for your DC/ADFS servers
let tokens = dynamic(["objectcategory","domainlist","dcmodes","adinfo","trustdmp","computers_pwdnotreqd","Domain Admins", "objectcategory=person", "objectcategory=computer", "objectcategory=*"]);
SecurityEvent
//| where Computer in (DCADFSServersList) // Uncomment to limit it to your DC/ADFS servers list if specified above or any pattern in hostnames (startswith, matches regex, etc).
| where EventID == 4688
| where CommandLine has_any (tokens)
| where CommandLine matches regex "(.*)>(.*)"
| summarize Commandlines = make_set(CommandLine), LastObserved=max(TimeGenerated) by bin(TimeGenerated, lookupwindow), Account, Computer, ParentProcessName, NewProcessName
| extend Count = array_length(Commandlines)
| where Count > threshold

```

## Suspicious enumeration using Adfind tool

Attackers can use Adfind which is administrative tool to gather information about Domain controllers, ADFS Servers. They may also rename executables with other benign tools on the system.
Below query will look for adfind usage in commandline arguments irrespective of executable name in short span of time. You can limit query this to your DC and ADFS servers.
Below references talk about suspicious use of adfind by adversaries.
- https://thedfirreport.com/2020/05/08/adfind-recon/
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://www.microsoft.com/security/blog/2020/12/18/analyzing-solorigate-the-compromised-dll-file-that-started-a-sophisticated-cyberattack-and-how-microsoft-defender-helps-protect/

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1074|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | dd6fb889-43ef-44e1-a01d-093ab4bb12b2 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Suspicious_enumeration_using_adfind.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let lookupwindow = 2m;
let threshold = 3; //number of commandlines in the set below
let DCADFSServersList = dynamic (["DCServer01", "DCServer02", "ADFSServer01"]); // Enter a reference list of hostnames for your DC/ADFS servers
let tokens = dynamic(["objectcategory","domainlist","dcmodes","adinfo","trustdmp","computers_pwdnotreqd","Domain Admins", "objectcategory=person", "objectcategory=computer", "objectcategory=*"]);
SecurityEvent
//| where Computer in (DCADFSServersList) // Uncomment to limit it to your DC/ADFS servers list if specified above or any pattern in hostnames (startswith, matches regex, etc).
| where EventID == 4688
| where CommandLine has_any (tokens)
| where CommandLine matches regex "(.*)>(.*)"
| summarize Commandlines = make_set(CommandLine), LastObserved=max(TimeGenerated) by bin(TimeGenerated, lookupwindow), Account, Computer, ParentProcessName, NewProcessName
| extend Count = array_length(Commandlines)
| where Count > threshold

```

## Users Opening and Reading the Local Device Identity Key

'This detection uses Windows security events to look for users reading the local Device Identity Key (Machine Key).
 This information can be correlated with other events for additional context and get to use-cases where a
 machine key with a transport key together can be used to impersonate an AAD joined or registered machine.
 Reference: https://o365blog.com/post/deviceidentity/'

|Name | Value |
| --- | --- |
|Tactic | Credential Access|
|TechniqueId | T1552|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 9feddda0-6f46-43b4-a54f-5921e2b136b8 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/UsersOpenReadDeviceIdentityKey.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Activities: 
//   5058 - Key file operation
//   5061 - Cryptographic operation (Event does not provide enough information to filter out potential false positives)
// KeyType:
//   %%2499 -> Machine Key
// Operation:
//   %%2458 -> Read persisted key from file
//   %%2480 -> Open Key
// Machine Keys:
//   f686aace6942fb7f7ceb231212eef4a4 -> TSSECKeySet1
let filterList = dynamic(["TSSecKeySet1", "iisCngWasKey", "iisCngConfigurationKey", "ConfigMgrPrimaryKey"]);
SecurityEvent
| where Activity == '5058 - Key file operation.'
| extend EventData = parse_xml(EventData).EventData.Data
| mv-expand bagexpansion=array EventData
| evaluate bag_unpack(EventData)
| extend Key = tostring(column_ifexists('@Name', "")), Value = column_ifexists('#text', "")
| evaluate pivot(Key, any(Value), TimeGenerated, Computer, EventID)
| where KeyType == '%%2499' and SubjectLogonId !in ('0x3e7', '0x3e4')
| where KeyFilePath has 'Microsoft\\Crypto\\Keys\\'
| where KeyName !in (filterList)
| extend ProcessId = ClientProcessId, KeyName = tostring(KeyName), SubjectLogonId = tostring(SubjectLogonId)
```

## Enumeration of users and groups

'Finds attempts to list users or groups using the built-in Windows 'net' tool '

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | a1e993de-770a-4434-83e9-9e3b47a6e470 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/enumeration_user_and_group.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let ProcessCreationEvents=() {
let processEvents=SecurityEvent
| where EventID==4688
| project TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName,        AccountDomain=SubjectDomainName,
FileName=tostring(split(NewProcessName, '\\')[-1]),
ProcessCommandLine = CommandLine, 
FolderPath = "",
InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="";
processEvents};
ProcessCreationEvents
| where FileName == 'net.exe' and AccountName != "" and ProcessCommandLine !contains '\\'  and ProcessCommandLine !contains '/add' 
| where (ProcessCommandLine contains ' user ' or ProcessCommandLine contains ' group ') and (ProcessCommandLine endswith ' /do' or ProcessCommandLine endswith ' /domain') 
| extend Target = extract("(?i)[user|group] (\"*[a-zA-Z0-9-_ ]+\"*)", 1, ProcessCommandLine) | filter Target  != '' 
| summarize minTimeGenerated=min(TimeGenerated), maxTimeGenerated=max(TimeGenerated), count() by AccountName, Target, ProcessCommandLine, ComputerName
| project minTimeGenerated, maxTimeGenerated, count_, AccountName, Target, ProcessCommandLine, ComputerName
| sort by AccountName, Target
| extend timestamp = minTimeGenerated, AccountCustomEntity = AccountName, HostCustomEntity = ComputerName

```

## Multiple explicit credential usage - 4648 events

'Based on recent investigations related to Solorigate, adversaries were seen to obtain and abuse credentials of multiple accounts 
 to connect to multiple machines. This query uses Security Event 4648 (A logon was attempted using explicit credentials) 
 to find machines in an environment, from where different accounts were used to connect to multiple hosts. Scoring is done based on 
 protocols seen in Solorigate. While this mentions Solorigate, this hunting query can be used to identify this type of pattern for 
 any attacker.
 Reference - https://docs.microsoft.com/windows/security/threat-protection/auditing/event-4648'

|Name | Value |
| --- | --- |
|Tactic | Discovery|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 9e3fab4b-94dd-4cf9-b2aa-063d0fd25513 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/MultipleExplicitCredentialUsage4648Events.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let WellKnownLocalSIDs = "S-1-5-[0-9][0-9]$";
let protocols = dynamic(['cifs', 'ldap', 'RPCSS', 'host' , 'HTTP', 'RestrictedKrbHost', 'TERMSRV', 'msomsdksvc', 'mssqlsvc']);
SecurityEvent
| where EventID == 4648
| where SubjectUserSid != 'S-1-0-0' // this is the Nobody SID which really means No security principal was included.
| where not(SubjectUserSid matches regex WellKnownLocalSIDs) //excluding system account/service account as this is generally normal
| where TargetInfo has '/' //looking for only items that indicate an interesting protocol is included
| where Computer !has tostring(split(TargetServerName,'$')[0])
| where TargetAccount !~ tostring(split(SubjectAccount,'$')[0])
| extend TargetInfoProtocol = tolower(split(TargetInfo, '/')[0]), TargetInfoMachine = toupper(split(TargetInfo, '/')[1])
| extend TargetAccount = tolower(TargetAccount), SubjectAccount = tolower(SubjectAccount)
| extend UncommonProtocol = case(not(TargetInfoProtocol has_any (protocols)), TargetInfoProtocol, 'NotApplicable')
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), AccountsUsedCount = dcount(TargetAccount), AccountsUsed = make_set(TargetAccount), TargetMachineCount = dcount(TargetInfoMachine), 
TargetMachines = make_set(TargetInfoMachine), TargetProtocols = dcount(TargetInfoProtocol), Protocols = make_set(TargetInfoProtocol), Processes = make_set(Process) by Computer, SubjectAccount, UncommonProtocol
| where TargetMachineCount > 1 or UncommonProtocol != 'NotApplicable'
| extend ProtocolCount = array_length(Protocols)
| extend ProtocolScore = case(
  Protocols has 'rpcss' and Protocols has 'host' and Protocols has 'cifs', 10, //observed in Solorigate and depending on which are used together the higher the score
  Protocols has 'rpcss' and Protocols has 'host', 5,
  Protocols has 'rpcss' and Protocols has 'cifs', 5,
  Protocols has 'host' and Protocols has 'cifs', 5,
  Protocols has 'ldap' or Protocols has 'rpcss' or Protocols has 'host' or Protocols has 'cifs', 1, //ldap is more commonly seen in general, this was also seen with Solorigate but not usually to the same machines as the others above
  UncommonProtocol != 'NotApplicable', 3,
  0 //other protocols may be of interest, but in relation to observations for enumeration/execution in Solorigate they receive 0
)
| extend Score = ProtocolScore + ProtocolCount + AccountsUsedCount
| where Score >= 9 or (UncommonProtocol != 'NotApplicable' and Score >= 4) // Score must be 9 or better as this will include 5 points for atleast 2 of the interesting protocols + the count of protocols (min 2) + the number of accounts used for execution (min 2) = min of 9 OR score must be 4 or greater for an uncommon protocol
| extend TimePeriod = EndTime - StartTime //This identifies the time between start and finish for the use of the explicit credentials, shorter time period may indicate scripted executions
| project-away UncommonProtocol
| extend timestamp = StartTime, AccountCustomEntity = SubjectAccount, HostCustomEntity = Computer
| order by Score desc
  

```

## Multiple explicit credential usage - 4648 events

'Based on recent investigations related to Solorigate, adversaries were seen to obtain and abuse credentials of multiple accounts 
 to connect to multiple machines. This query uses Security Event 4648 (A logon was attempted using explicit credentials) 
 to find machines in an environment, from where different accounts were used to connect to multiple hosts. Scoring is done based on 
 protocols seen in Solorigate. While this mentions Solorigate, this hunting query can be used to identify this type of pattern for 
 any attacker.
 Reference - https://docs.microsoft.com/windows/security/threat-protection/auditing/event-4648'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 9e3fab4b-94dd-4cf9-b2aa-063d0fd25513 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/MultipleExplicitCredentialUsage4648Events.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let WellKnownLocalSIDs = "S-1-5-[0-9][0-9]$";
let protocols = dynamic(['cifs', 'ldap', 'RPCSS', 'host' , 'HTTP', 'RestrictedKrbHost', 'TERMSRV', 'msomsdksvc', 'mssqlsvc']);
SecurityEvent
| where EventID == 4648
| where SubjectUserSid != 'S-1-0-0' // this is the Nobody SID which really means No security principal was included.
| where not(SubjectUserSid matches regex WellKnownLocalSIDs) //excluding system account/service account as this is generally normal
| where TargetInfo has '/' //looking for only items that indicate an interesting protocol is included
| where Computer !has tostring(split(TargetServerName,'$')[0])
| where TargetAccount !~ tostring(split(SubjectAccount,'$')[0])
| extend TargetInfoProtocol = tolower(split(TargetInfo, '/')[0]), TargetInfoMachine = toupper(split(TargetInfo, '/')[1])
| extend TargetAccount = tolower(TargetAccount), SubjectAccount = tolower(SubjectAccount)
| extend UncommonProtocol = case(not(TargetInfoProtocol has_any (protocols)), TargetInfoProtocol, 'NotApplicable')
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), AccountsUsedCount = dcount(TargetAccount), AccountsUsed = make_set(TargetAccount), TargetMachineCount = dcount(TargetInfoMachine), 
TargetMachines = make_set(TargetInfoMachine), TargetProtocols = dcount(TargetInfoProtocol), Protocols = make_set(TargetInfoProtocol), Processes = make_set(Process) by Computer, SubjectAccount, UncommonProtocol
| where TargetMachineCount > 1 or UncommonProtocol != 'NotApplicable'
| extend ProtocolCount = array_length(Protocols)
| extend ProtocolScore = case(
  Protocols has 'rpcss' and Protocols has 'host' and Protocols has 'cifs', 10, //observed in Solorigate and depending on which are used together the higher the score
  Protocols has 'rpcss' and Protocols has 'host', 5,
  Protocols has 'rpcss' and Protocols has 'cifs', 5,
  Protocols has 'host' and Protocols has 'cifs', 5,
  Protocols has 'ldap' or Protocols has 'rpcss' or Protocols has 'host' or Protocols has 'cifs', 1, //ldap is more commonly seen in general, this was also seen with Solorigate but not usually to the same machines as the others above
  UncommonProtocol != 'NotApplicable', 3,
  0 //other protocols may be of interest, but in relation to observations for enumeration/execution in Solorigate they receive 0
)
| extend Score = ProtocolScore + ProtocolCount + AccountsUsedCount
| where Score >= 9 or (UncommonProtocol != 'NotApplicable' and Score >= 4) // Score must be 9 or better as this will include 5 points for atleast 2 of the interesting protocols + the count of protocols (min 2) + the number of accounts used for execution (min 2) = min of 9 OR score must be 4 or greater for an uncommon protocol
| extend TimePeriod = EndTime - StartTime //This identifies the time between start and finish for the use of the explicit credentials, shorter time period may indicate scripted executions
| project-away UncommonProtocol
| extend timestamp = StartTime, AccountCustomEntity = SubjectAccount, HostCustomEntity = Computer
| order by Score desc
  

```

## Scheduled Task Creation or Update from User Writable Directory

'This query triggers when a scheduled task is created or updated and it is going to run programs from writable user paths.
Ref: https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1053.005|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 0b827a49-427e-4721-b05e-b151a8af524e |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/ScheduledTaskCreationUpdateFromUserWritableDrectory.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Enter a reference list for writable user paths"
let WritableUserPaths = dynamic (["\"C:\\Users\\","\"C:\\ProgramData\\"]);
SecurityEvent
| where EventID in (4698,4702) and EventData has_any (WritableUserPaths)
| parse EventData with * 'Command&gt;' Command "&lt" *
| parse EventData with * 'Arguments&gt;' Arguments "&lt" *
| where Command has_any (WritableUserPaths) or Arguments has_any (WritableUserPaths)
| parse EventData with * 'SubjectUserName">' SubjectUserName "<" * 'SubjectDomainName">' SubjectDomainName "<" * 'TaskName">' TaskName "<" *
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Activity, Computer, SubjectUserName, SubjectDomainName, TaskName, Command, Arguments

```

## Invoke-PowerShellTcpOneLine Usage.

'Invoke-PowerShellTcpOneLine is a PowerShell script to create a simple and small reverse shell. It can be abused by attackers to exfiltrate data. This query looks for command line activity similar to Invoke-PowerShellTcpOneLine.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1011|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | a344e28e-095d-47fb-84a8-d06edd31d2cb |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Invoke-PowerShellTcpOneLine.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
| where EventID == 4688
| where Process has_any ("powershell.exe", "PowerShell_ISE.exe", "cmd.exe")
| where CommandLine has "$client = New-Object System.Net.Sockets.TCPClient"
| extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer, IPCustomEntity = IpAddress

```

## Potential Process Doppelganging

'This query detects Process Doppelganging, a technique that calls several APIs related to NTFS transactions which allow to substitute the PE content before the process is even created.
Ref: https://attack.mitre.org/techniques/T1055/013/'

|Name | Value |
| --- | --- |
|Tactic | DefenseEvasion|
|TechniqueId | T1055.013|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 97ff9459-dade-404a-b90e-d93b9acde1a4 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/PotentialProcessDoppelganging.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Enter a reference list of trusted processes
let TrustedProcessList = dynamic ([ "c:\\windows\\system32\\svchost.exe","c:\\windows\\system32\\lsass.exe","c:\\windows\\servicing\\TrustedInstaller.exe","c:\\windows\\system32\\poqexec.exe","TiWorker.exe","C:\\Windows\\System32\\inetsrv\\appcmd.exe","C:\\Windows\\System32\\inetsrv\\InetMgr.exe","C:\\Windows\\System32\\wsmprovhost.exe","C:\\Program Files (x86)\\Microsoft Visual Studio\\2019\Enterprise\\Common7\\IDE\\devenv.exe"]);
SecurityEvent
| where EventID == 4985 and not (ProcessName has_any (TrustedProcessList)) and SubjectLogonId !="0x3e7"
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, ProcessName, SubjectUserName

```

## Least Common Processes Including Folder Depth

'Looks across your environment for least common Process Command Lines, may be noisy and require allowlisting.  By ZanCo'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 6d04a1ef-1b4d-4ff8-a76c-ad7d1a396136 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Least_Common_Process_With_Depth.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 7d;
let Allowlist = dynamic (['foo.exe', 'baz.exe']);
let Sensitivity = 15;
SecurityEvent
| where TimeGenerated between(lookback..endtime)
| where EventID == 4688
| extend ProcArray = split(NewProcessName, '\\')
// ProcArrayLength is Folder Depth
| extend ProcArrayLength = arraylength(ProcArray)
| extend LastIndex = ProcArrayLength - 1
| extend Proc = ProcArray[LastIndex]
| where Proc !in (Allowlist)
// ProcArray[0] is the proc's Drive
| extend DriveDepthProc = strcat(ProcArray[0], '-', ProcArrayLength, '-', Proc)
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), TimesSeen = count(), HostCount = dcount(Computer), Hosts = makeset(Computer), UserCount = dcount(SubjectUserName), Users = makeset(SubjectUserName) by DriveDepthProc
| where TimesSeen < Sensitivity
| extend timestamp = StartTimeUtc

```

## PowerShell downloads

'Finds PowerShell execution events that could involve a download'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | d83f40fc-bbcc-4020-8d45-ad2d82355cb2 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/powershell_downloads.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let ProcessCreationEvents=() {
let processEvents=SecurityEvent
| where EventID==4688
| project  TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName,        AccountDomain=SubjectDomainName,
  FileName=tostring(split(NewProcessName, '\\')[-1]),
ProcessCommandLine = CommandLine, 
InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="";
processEvents};
ProcessCreationEvents
| where FileName in~ ("powershell.exe", "powershell_ise.exe","pwsh.exe")
| where ProcessCommandLine has "Net.WebClient"
   or ProcessCommandLine has "DownloadFile"
   or ProcessCommandLine has "Invoke-WebRequest"
   or ProcessCommandLine has "Invoke-Shellcode"
   or ProcessCommandLine contains "http:"
| project TimeGenerated, ComputerName, AccountName, InitiatingProcessFileName, FileName, ProcessCommandLine
| top 100 by TimeGenerated
| extend timestamp = TimeGenerated, HostCustomEntity = ComputerName, AccountCustomEntity = AccountName

```

## PowerShell downloads

'Finds PowerShell execution events that could involve a download'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | d83f40fc-bbcc-4020-8d45-ad2d82355cb2 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/powershell_downloads.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let ProcessCreationEvents=() {
let processEvents=SecurityEvent
| where EventID==4688
| project  TimeGenerated, ComputerName=Computer,AccountName=SubjectUserName,        AccountDomain=SubjectDomainName,
  FileName=tostring(split(NewProcessName, '\\')[-1]),
ProcessCommandLine = CommandLine, 
InitiatingProcessFileName=ParentProcessName,InitiatingProcessCommandLine="",InitiatingProcessParentFileName="";
processEvents};
ProcessCreationEvents
| where FileName in~ ("powershell.exe", "powershell_ise.exe","pwsh.exe")
| where ProcessCommandLine has "Net.WebClient"
   or ProcessCommandLine has "DownloadFile"
   or ProcessCommandLine has "Invoke-WebRequest"
   or ProcessCommandLine has "Invoke-Shellcode"
   or ProcessCommandLine contains "http:"
| project TimeGenerated, ComputerName, AccountName, InitiatingProcessFileName, FileName, ProcessCommandLine
| top 100 by TimeGenerated
| extend timestamp = TimeGenerated, HostCustomEntity = ComputerName, AccountCustomEntity = AccountName

```

## Discord download invoked from cmd line

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1204|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | e7dd442a-0af8-48eb-8358-9e91f4911849 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Discorddownloadinvokedfromcmdline.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
| where EventID == 4688
| where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
| where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
| project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1102|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | e7dd442a-0af8-48eb-8358-9e91f4911849 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Discorddownloadinvokedfromcmdline.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
| where EventID == 4688
| where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
| where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
| project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1567|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | e7dd442a-0af8-48eb-8358-9e91f4911849 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Discorddownloadinvokedfromcmdline.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
| where EventID == 4688
| where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
| where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
| project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1204|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | e7dd442a-0af8-48eb-8358-9e91f4911849 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Discorddownloadinvokedfromcmdline.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
| where EventID == 4688
| where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
| where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
| project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | e7dd442a-0af8-48eb-8358-9e91f4911849 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Discorddownloadinvokedfromcmdline.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
| where EventID == 4688
| where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
| where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
| project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```

## Discord download invoked from cmd line

'This hunting query looks for hosts that have attempted to interact with the Discord CDN. This activity is not normally invoked from the command line and could indicate C2, exfiltration, or malware delivery activity.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1567|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | e7dd442a-0af8-48eb-8358-9e91f4911849 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/SecurityEvent/Discorddownloadinvokedfromcmdline.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityEvent
| where EventID == 4688
| where Process has_any ("powershell.exe", "powershell_ise.exe", "cmd.exe") or CommandLine has "powershell"
| where CommandLine has_any ("cdn.discordapp.com", "moc.ppadrocsid.ndc")
| project-reorder TimeGenerated, Computer, Account, Process, CommandLine

```
