# Rules: 5902-5922

## cve-2019-0808-c2

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by reporting network communication associated with the Nufsys attacks.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Command and control|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 0be1295f-b417-477b-95d1-82ce7c43fa03 |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-c2.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Network Communication to C&C 
DeviceNetworkEvents 
| where Timestamp > ago(14d) 
| where RemoteUrl  in("luckluck.blog", "fffun-video.biz") //Dest Address DNS 
or RemoteIP  == "63.141.233.82" //Destination Address 

```

## cve-2019-0808-c2

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by reporting network communication associated with the Nufsys attacks.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Command and control|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 0be1295f-b417-477b-95d1-82ce7c43fa03 |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-c2.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Network Communication to C&C 
DeviceNetworkEvents 
| where Timestamp > ago(14d) 
| where RemoteUrl  in("luckluck.blog", "fffun-video.biz") //Dest Address DNS 
or RemoteIP  == "63.141.233.82" //Destination Address 

```

## cve-2019-0808-c2

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by reporting network communication associated with the Nufsys attacks.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Vulnerability|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 0be1295f-b417-477b-95d1-82ce7c43fa03 |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-c2.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Network Communication to C&C 
DeviceNetworkEvents 
| where Timestamp > ago(14d) 
| where RemoteUrl  in("luckluck.blog", "fffun-video.biz") //Dest Address DNS 
or RemoteIP  == "63.141.233.82" //Destination Address 

```

## cve-2019-0808-c2

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by reporting network communication associated with the Nufsys attacks.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Vulnerability|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 0be1295f-b417-477b-95d1-82ce7c43fa03 |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-c2.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Network Communication to C&C 
DeviceNetworkEvents 
| where Timestamp > ago(14d) 
| where RemoteUrl  in("luckluck.blog", "fffun-video.biz") //Dest Address DNS 
or RemoteIP  == "63.141.233.82" //Destination Address 

```

## detect-cve-2019-1069-bearlpe-exploit

This query was originally published in the threat analytics report, May 2019 0-day disclosures.
In May and June of 2019, a security researcher with the online alias, SandboxEscaper, discovered and published several elevation-of-privilege vulnerabilities on Github. The researcher included proofs-of-concept demonstrating how to exploit these vulnerabilities.
Patches and more information about each vulnerability are available below:
1. CVE-2019-0863 | Windows Error Reporting Elevation of Privilege Vulnerability
2. CVE-2019-1069 | Task Scheduler Elevation of Privilege Vulnerability
3. CVE-2019-1053 | Windows Shell Elevation of Privilege Vulnerability
4. CVE-2019-1064 | Windows Elevation of Privilege Vulnerability
5. CVE-2019-0973 | Windows Installer Elevation of Privilege Vulnerability
6. CVE-2019-1129 | Windows Elevation of Privilege Vulnerability
This query locates possible activity that exploits CVE-2019-1069 (also known as BearLPE), the second vulnerability listed above.
Reference - https://threatpost.com/sandboxescaper-more-exploits-ie-zero-day/145010/

|Name | Value |
| --- | --- |
|Tactic | Privilege escalation|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | d82cdd92-4818-4f55-9e14-68021c154cdb |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/detect-cve-2019-1069-bearlpe-exploit.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Find possible use of BearLPE (Task Scheduler exploit)
DeviceFileEvents
| where FileName =~ "schtasks.exe"
| where InitiatingProcessCommandLine contains "/change"
and InitiatingProcessCommandLine contains " /TN "
and InitiatingProcessCommandLine contains " /RU "
and InitiatingProcessCommandLine contains " /RP "
and InitiatingProcessCommandLine !contains " /S "
and InitiatingProcessCommandLine !contains " /ST "
and InitiatingProcessCommandLine !contains " /SD "
and InitiatingProcessIntegrityLevel !in ("", "High", "System")

```

## detect-cve-2019-1069-bearlpe-exploit

This query was originally published in the threat analytics report, May 2019 0-day disclosures.
In May and June of 2019, a security researcher with the online alias, SandboxEscaper, discovered and published several elevation-of-privilege vulnerabilities on Github. The researcher included proofs-of-concept demonstrating how to exploit these vulnerabilities.
Patches and more information about each vulnerability are available below:
1. CVE-2019-0863 | Windows Error Reporting Elevation of Privilege Vulnerability
2. CVE-2019-1069 | Task Scheduler Elevation of Privilege Vulnerability
3. CVE-2019-1053 | Windows Shell Elevation of Privilege Vulnerability
4. CVE-2019-1064 | Windows Elevation of Privilege Vulnerability
5. CVE-2019-0973 | Windows Installer Elevation of Privilege Vulnerability
6. CVE-2019-1129 | Windows Elevation of Privilege Vulnerability
This query locates possible activity that exploits CVE-2019-1069 (also known as BearLPE), the second vulnerability listed above.
Reference - https://threatpost.com/sandboxescaper-more-exploits-ie-zero-day/145010/

|Name | Value |
| --- | --- |
|Tactic | Privilege escalation|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | d82cdd92-4818-4f55-9e14-68021c154cdb |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/detect-cve-2019-1069-bearlpe-exploit.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Find possible use of BearLPE (Task Scheduler exploit)
DeviceFileEvents
| where FileName =~ "schtasks.exe"
| where InitiatingProcessCommandLine contains "/change"
and InitiatingProcessCommandLine contains " /TN "
and InitiatingProcessCommandLine contains " /RU "
and InitiatingProcessCommandLine contains " /RP "
and InitiatingProcessCommandLine !contains " /S "
and InitiatingProcessCommandLine !contains " /ST "
and InitiatingProcessCommandLine !contains " /SD "
and InitiatingProcessIntegrityLevel !in ("", "High", "System")

```

## cve-2019-0808-nufsys-file creation

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by finding suspicious file creation events associated with Nufsys.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 447cdff3-2bfc-4f7a-b718-048d6d0ebd87 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-nufsys-file%20creation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//File creation 
DeviceFileEvents 
| where Timestamp > ago(14d) 
| where FolderPath  contains "temp" and  FileName in~("updata.exe", 
"recovery_db.exe", "spsextserver.exe", "recoverydb.exe") 
or SHA1 in("987cf95281a3f6449681148ea05e44115f74ccbc", 
"6f465b791ab8ef289f20c412808af7ae331c87ab", 
"d5c6c037735c4518fffcdac1026770d8d251c7c8") //File SHAs of above processes

```

## cve-2019-0808-nufsys-file creation

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by finding suspicious file creation events associated with Nufsys.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 447cdff3-2bfc-4f7a-b718-048d6d0ebd87 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-nufsys-file%20creation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//File creation 
DeviceFileEvents 
| where Timestamp > ago(14d) 
| where FolderPath  contains "temp" and  FileName in~("updata.exe", 
"recovery_db.exe", "spsextserver.exe", "recoverydb.exe") 
or SHA1 in("987cf95281a3f6449681148ea05e44115f74ccbc", 
"6f465b791ab8ef289f20c412808af7ae331c87ab", 
"d5c6c037735c4518fffcdac1026770d8d251c7c8") //File SHAs of above processes

```

## cve-2019-0808-nufsys-file creation

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by finding suspicious file creation events associated with Nufsys.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Privilege escalation|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 447cdff3-2bfc-4f7a-b718-048d6d0ebd87 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-nufsys-file%20creation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//File creation 
DeviceFileEvents 
| where Timestamp > ago(14d) 
| where FolderPath  contains "temp" and  FileName in~("updata.exe", 
"recovery_db.exe", "spsextserver.exe", "recoverydb.exe") 
or SHA1 in("987cf95281a3f6449681148ea05e44115f74ccbc", 
"6f465b791ab8ef289f20c412808af7ae331c87ab", 
"d5c6c037735c4518fffcdac1026770d8d251c7c8") //File SHAs of above processes

```

## cve-2019-0808-nufsys-file creation

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by finding suspicious file creation events associated with Nufsys.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Privilege escalation|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 447cdff3-2bfc-4f7a-b718-048d6d0ebd87 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-nufsys-file%20creation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//File creation 
DeviceFileEvents 
| where Timestamp > ago(14d) 
| where FolderPath  contains "temp" and  FileName in~("updata.exe", 
"recovery_db.exe", "spsextserver.exe", "recoverydb.exe") 
or SHA1 in("987cf95281a3f6449681148ea05e44115f74ccbc", 
"6f465b791ab8ef289f20c412808af7ae331c87ab", 
"d5c6c037735c4518fffcdac1026770d8d251c7c8") //File SHAs of above processes

```

## cve-2019-0808-nufsys-file creation

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by finding suspicious file creation events associated with Nufsys.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Vulnerability|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 447cdff3-2bfc-4f7a-b718-048d6d0ebd87 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-nufsys-file%20creation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//File creation 
DeviceFileEvents 
| where Timestamp > ago(14d) 
| where FolderPath  contains "temp" and  FileName in~("updata.exe", 
"recovery_db.exe", "spsextserver.exe", "recoverydb.exe") 
or SHA1 in("987cf95281a3f6449681148ea05e44115f74ccbc", 
"6f465b791ab8ef289f20c412808af7ae331c87ab", 
"d5c6c037735c4518fffcdac1026770d8d251c7c8") //File SHAs of above processes

```

## cve-2019-0808-nufsys-file creation

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by finding suspicious file creation events associated with Nufsys.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Vulnerability|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 447cdff3-2bfc-4f7a-b718-048d6d0ebd87 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-nufsys-file%20creation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//File creation 
DeviceFileEvents 
| where Timestamp > ago(14d) 
| where FolderPath  contains "temp" and  FileName in~("updata.exe", 
"recovery_db.exe", "spsextserver.exe", "recoverydb.exe") 
or SHA1 in("987cf95281a3f6449681148ea05e44115f74ccbc", 
"6f465b791ab8ef289f20c412808af7ae331c87ab", 
"d5c6c037735c4518fffcdac1026770d8d251c7c8") //File SHAs of above processes

```

## cve-2019-0808-nufsys-file creation

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by finding suspicious file creation events associated with Nufsys.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Malware, component|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 447cdff3-2bfc-4f7a-b718-048d6d0ebd87 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-nufsys-file%20creation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//File creation 
DeviceFileEvents 
| where Timestamp > ago(14d) 
| where FolderPath  contains "temp" and  FileName in~("updata.exe", 
"recovery_db.exe", "spsextserver.exe", "recoverydb.exe") 
or SHA1 in("987cf95281a3f6449681148ea05e44115f74ccbc", 
"6f465b791ab8ef289f20c412808af7ae331c87ab", 
"d5c6c037735c4518fffcdac1026770d8d251c7c8") //File SHAs of above processes

```

## cve-2019-0808-nufsys-file creation

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by finding suspicious file creation events associated with Nufsys.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Malware, component|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 447cdff3-2bfc-4f7a-b718-048d6d0ebd87 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-nufsys-file%20creation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//File creation 
DeviceFileEvents 
| where Timestamp > ago(14d) 
| where FolderPath  contains "temp" and  FileName in~("updata.exe", 
"recovery_db.exe", "spsextserver.exe", "recoverydb.exe") 
or SHA1 in("987cf95281a3f6449681148ea05e44115f74ccbc", 
"6f465b791ab8ef289f20c412808af7ae331c87ab", 
"d5c6c037735c4518fffcdac1026770d8d251c7c8") //File SHAs of above processes

```

## dell-driver-vulnerability-2021

This query was originally published in the threat analytics report, Multiple EOP flaws in Dell driver (CVE-2021-21551).
CVE-2021-21551 is a vulnerability found in dbutil_2_3.sys, a driver distributed with Dell firmware updates and tools. Attackers can exploit this vulnerability to escalate privileges on a compromised device. The following query can detect if the affected driver has been added to a device's \temp folders.
Reference - https://nvd.nist.gov/vuln/detail/CVE-2021-21551

|Name | Value |
| --- | --- |
|Tactic | Privilege escalation|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 4eadcfeb-2ed8-40ce-941a-6691d7ddbdca |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/dell-driver-vulnerability-2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DeviceFileEvents 
| where SHA256 in ("0296e2ce999e67c76352613a718e11516fe1b0efc3ffdb8918fc999dd76a73a5","ddbf5ecca5c8086afde1fb4f551e9e6400e94f4428fe7fb5559da5cffa654cc1","552c297d6d7992f8b95287ac6e16f2169b6e629cb6ae0ee42036f093c36142d4","4c727e430fb72f6942768cd1662b4aefda32f10bde43c7232da6713bb5c98bc0","87e38e7aeaaaa96efe1a74f59fca8371de93544b7af22862eb0e574cec49c7c3")
| where FolderPath has_any (@"C:\Windows\Temp\",@"C:\Temp\")

```

## dell-driver-vulnerability-2021

This query was originally published in the threat analytics report, Multiple EOP flaws in Dell driver (CVE-2021-21551).
CVE-2021-21551 is a vulnerability found in dbutil_2_3.sys, a driver distributed with Dell firmware updates and tools. Attackers can exploit this vulnerability to escalate privileges on a compromised device. The following query can detect if the affected driver has been added to a device's \temp folders.
Reference - https://nvd.nist.gov/vuln/detail/CVE-2021-21551

|Name | Value |
| --- | --- |
|Tactic | Privilege escalation|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 4eadcfeb-2ed8-40ce-941a-6691d7ddbdca |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/dell-driver-vulnerability-2021.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DeviceFileEvents 
| where SHA256 in ("0296e2ce999e67c76352613a718e11516fe1b0efc3ffdb8918fc999dd76a73a5","ddbf5ecca5c8086afde1fb4f551e9e6400e94f4428fe7fb5559da5cffa654cc1","552c297d6d7992f8b95287ac6e16f2169b6e629cb6ae0ee42036f093c36142d4","4c727e430fb72f6942768cd1662b4aefda32f10bde43c7232da6713bb5c98bc0","87e38e7aeaaaa96efe1a74f59fca8371de93544b7af22862eb0e574cec49c7c3")
| where FolderPath has_any (@"C:\Windows\Temp\",@"C:\Temp\")

```

## cve-2019-0808-set-scheduled-task

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by reporting scheduled task creation events associated with the Nufsys attacks.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 80cb5ddb-baf2-4eb2-9751-8f77c072eb4d |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-set-scheduled-task.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Scheduled task creation 
DeviceProcessEvents 
| where Timestamp  > ago(14d) 
| where FileName =~ "schtasks.exe"  
| where ProcessCommandLine  contains "highest" and 
(ProcessCommandLine contains "ecosetup" or 
ProcessCommandLine contains "spsextserv.exe")

```

## cve-2019-0808-set-scheduled-task

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by reporting scheduled task creation events associated with the Nufsys attacks.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 80cb5ddb-baf2-4eb2-9751-8f77c072eb4d |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-set-scheduled-task.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Scheduled task creation 
DeviceProcessEvents 
| where Timestamp  > ago(14d) 
| where FileName =~ "schtasks.exe"  
| where ProcessCommandLine  contains "highest" and 
(ProcessCommandLine contains "ecosetup" or 
ProcessCommandLine contains "spsextserv.exe")

```

## cve-2019-0808-set-scheduled-task

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by reporting scheduled task creation events associated with the Nufsys attacks.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Privilege escalation|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 80cb5ddb-baf2-4eb2-9751-8f77c072eb4d |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-set-scheduled-task.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Scheduled task creation 
DeviceProcessEvents 
| where Timestamp  > ago(14d) 
| where FileName =~ "schtasks.exe"  
| where ProcessCommandLine  contains "highest" and 
(ProcessCommandLine contains "ecosetup" or 
ProcessCommandLine contains "spsextserv.exe")

```

## cve-2019-0808-set-scheduled-task

This query was originally published in the threat analytics report, Windows 7 zero-day for CVE-2019-0808
CVE-2019-0808 is a vulnerability that allows an attacker to escape the Windows security sandbox and run arbitrary code with admin privileges. This vulnerability affects Windows 7, Windows Server 2008, and Windows Server 2008 R2.
Exploits for CVE-2019-0808 were first observed as part of highly selective attacks using the Nufsys backdoor. Although the Nufsys-associated exploit was first described as a zero-day, the issue has since been patched.
The following query detects possible CVE-2019-0808 exploitation by reporting scheduled task creation events associated with the Nufsys attacks.
References:
https://nvd.nist.gov/vuln/detail/CVE-2019-0808
https://portal.msrc.microsoft.com/security-guidance/advisory/CVE-2019-0808

|Name | Value |
| --- | --- |
|Tactic | Privilege escalation|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 80cb5ddb-baf2-4eb2-9751-8f77c072eb4d |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Privilege%20escalation/cve-2019-0808-set-scheduled-task.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
//Scheduled task creation 
DeviceProcessEvents 
| where Timestamp  > ago(14d) 
| where FileName =~ "schtasks.exe"  
| where ProcessCommandLine  contains "highest" and 
(ProcessCommandLine contains "ecosetup" or 
ProcessCommandLine contains "spsextserv.exe")

```
