# Rules: 2206-2226

## Failed AWS Console logons but success logon to AzureAD

'Identifies a list of IP addresses with a minimum numbe(default of 5) of failed logon attempts to AWS Console.
Uses that list to identify any successful Azure Active Directory logons from these IPs within the same timeframe.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1110|
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 910124df-913c-47e3-a7cd-29e1643fa55e |
|DataTypes | SigninLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/AWSConsoleAADCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

//Adjust this threshold to fit environment
let  signin_threshold = 5; 
//Make a list of IPs with failed AWS console logins
let aws_fails = AWSCloudTrail
| where EventName == "ConsoleLogin"
| extend LoginResult = tostring(parse_json(ResponseElements).ConsoleLogin) 
| where LoginResult != "Success"
| where SourceIpAddress != "127.0.0.1"
| summarize count() by SourceIpAddress
| where count_ >  signin_threshold
| summarize make_set(SourceIpAddress);
//See if any of those IPs have sucessfully logged into Azure AD.
SigninLogs
| where ResultType in ("0", "50125", "50140")
| where IPAddress in (aws_fails) 
| extend Reason = "Multiple failed AWS Console logins from IP address"
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = IPAddress

```

## Failed AWS Console logons but success logon to AzureAD

'Identifies a list of IP addresses with a minimum numbe(default of 5) of failed logon attempts to AWS Console.
Uses that list to identify any successful Azure Active Directory logons from these IPs within the same timeframe.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1110|
|Platform | AWS|
|DetectionType | Analytics |
|ConnectorId | AWS |
|DetectionId | 910124df-913c-47e3-a7cd-29e1643fa55e |
|DataTypes | AWSCloudTrail |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/AWSConsoleAADCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

//Adjust this threshold to fit environment
let  signin_threshold = 5; 
//Make a list of IPs with failed AWS console logins
let aws_fails = AWSCloudTrail
| where EventName == "ConsoleLogin"
| extend LoginResult = tostring(parse_json(ResponseElements).ConsoleLogin) 
| where LoginResult != "Success"
| where SourceIpAddress != "127.0.0.1"
| summarize count() by SourceIpAddress
| where count_ >  signin_threshold
| summarize make_set(SourceIpAddress);
//See if any of those IPs have sucessfully logged into Azure AD.
SigninLogs
| where ResultType in ("0", "50125", "50140")
| where IPAddress in (aws_fails) 
| extend Reason = "Multiple failed AWS Console logins from IP address"
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = IPAddress

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | DnsEvents |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | DnsEvents |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | DnsEvents |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureMonitor(VMInsights) |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | VMConnection |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureMonitor(VMInsights) |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | VMConnection |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureMonitor(VMInsights) |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | VMConnection |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | CiscoASA |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | CiscoASA |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | CiscoASA |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | PaloAltoNetworks |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | PaloAltoNetworks |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | PaloAltoNetworks |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```

## Solorigate Network Beacon

'Identifies a match across various data feeds for domains IOCs related to the Solorigate incident.
 References: https://blogs.microsoft.com/on-the-issues/2020/12/13/customers-protect-nation-state-cyberattacks/, 
 https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html?1'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1102|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | Zscaler |
|DetectionId | cecdbd4c-4902-403c-8d4b-32eb1efe460b |
|DataTypes | CommonSecurityLog |
|QueryFrequency | 6h |
|QueryPeriod | 6h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/Solorigate-Network-Beacon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let domains = dynamic(["incomeupdate.com","zupertech.com","databasegalore.com","panhardware.com","avsvmcloud.com","digitalcollege.org","freescanonline.com","deftsecurity.com","thedoccloud.com","virtualdataserver.com","lcomputers.com","webcodez.com","globalnetworkissues.com","kubecloud.com","seobundlekit.com","solartrackingsystem.net","virtualwebdata.com"]);
(union isfuzzy=true
(CommonSecurityLog 
  | parse Message with * '(' DNSName ')' * 
  | where DNSName in~ (domains) or DestinationHostName has_any (domains) or RequestURL has_any(domains)
  | extend AccountCustomEntity = SourceUserID, HostCustomEntity = DeviceName, IPCustomEntity = SourceIP
  ),
(_Im_Dns (domain_has_any=domains)
  | extend DNSName = DnsQuery
  | extend IPCustomEntity = SrcIpAddr
  ),
(VMConnection 
  | parse RemoteDnsCanonicalNames with * '["' DNSName '"]' *
  | where isnotempty(DNSName)
  | where DNSName in~ (domains)
  | extend IPCustomEntity = RemoteIp
  ),
(DeviceNetworkEvents 
  | where isnotempty(RemoteUrl) 
  | where RemoteUrl  has_any (domains)  
  | extend DNSName = RemoteUrl
  | extend IPCustomEntity = RemoteIP 
  | extend HostCustomEntity = DeviceName 
  ),
(AzureDiagnostics 
  | where ResourceType == "AZUREFIREWALLS"
  | where Category == "AzureFirewallApplicationRule"
  | parse msg_s with Protocol 'request from ' SourceHost ':' SourcePort 'to ' DestinationHost ':' DestinationPort '. Action:' Action
  | where isnotempty(DestinationHost)
  | where DestinationHost has_any (domains)  
  | extend DNSName = DestinationHost 
  | extend IPCustomEntity = SourceHost
  ) 
  )

```
