# Rules: 1303-1323

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1210|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1046|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1046|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1046|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1210|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1210|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## Several deny actions registered

'Identifies attack pattern when attacker tries to move, or scan, from resource to resource on the network and creates an incident when a source has more than 1 registered deny action in Azure Firewall.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1210|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | AzureFirewall |
|DetectionId | f8dad4e9-3f19-4d70-ab7f-8f19ccd43a3e |
|DataTypes | AzureDiagnostics |
|QueryFrequency | 1h |
|QueryPeriod | 1h |
|TriggerOperator | gt |
|TriggerThreshold | 1.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AzureFirewall/SeveralDenyActionsRegistered.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 1;
AzureDiagnostics
    | where OperationName in ("AzureFirewallApplicationRuleLog","AzureFirewallNetworkRuleLog")
    | extend msg_s_replaced0 = replace(@"\s\s",@" ",msg_s)
    | extend msg_s_replaced1 = replace(@"\.\s",@" ",msg_s_replaced0)
    | extend msg_a = split(msg_s_replaced1," ")
    | extend srcAddr_a = split(msg_a[3],":") , destAddr_a = split(msg_a[5],":")
    | extend protocol = tostring(msg_a[0]), srcIp = tostring(srcAddr_a[0]), srcPort = tostring(srcAddr_a[1]), destIp = tostring(destAddr_a[0]), destPort = tostring(destAddr_a[1]), action = tostring(msg_a[7])
    | where action == "Deny"
    | extend url = iff(destIp matches regex "\\d+\\.\\d+\\.\\d+\\.\\d+","",destIp)
    | summarize StartTime = min(TimeGenerated), count() by srcIp, destIp, url, action, protocol
    | where count_ >= ["threshold"]
    | extend timestamp = StartTime, URLCustomEntity = url, IPCustomEntity = srcIp

```

## DNS events related to mining pools

'Identifies IP addresses that may be performing DNS lookups associated with common currency mining pools.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1496|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | 0d76e9cf-788d-4a69-ac7d-f234826b5bed |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/DNS_Miners.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

DnsEvents
| where Name contains "."
| where Name has_any ("monerohash.com", "do-dear.com", "xmrminerpro.com", "secumine.net", "xmrpool.com", "minexmr.org", "hashanywhere.com", 
"xmrget.com", "mininglottery.eu", "minergate.com", "moriaxmr.com", "multipooler.com", "moneropools.com", "xmrpool.eu", "coolmining.club", 
"supportxmr.com", "minexmr.com", "hashvault.pro", "xmrpool.net", "crypto-pool.fr", "xmr.pt", "miner.rocks", "walpool.com", "herominers.com", 
"gntl.co.uk", "semipool.com", "coinfoundry.org", "cryptoknight.cc", "fairhash.org", "baikalmine.com", "tubepool.xyz", "fairpool.xyz", "asiapool.io", 
"coinpoolit.webhop.me", "nanopool.org", "moneropool.com", "miner.center", "prohash.net", "poolto.be", "cryptoescrow.eu", "monerominers.net", "cryptonotepool.org", 
"extrmepool.org", "webcoin.me", "kippo.eu", "hashinvest.ws", "monero.farm", "supportxmr.com", "xmrpool.eu", "linux-repository-updates.com", "1gh.com", 
"dwarfpool.com", "hash-to-coins.com", "hashvault.pro", "pool-proxy.com", "hashfor.cash", "fairpool.cloud", "litecoinpool.org", "mineshaft.ml", "abcxyz.stream", 
"moneropool.ru", "cryptonotepool.org.uk", "extremepool.org", "extremehash.com", "hashinvest.net", "unipool.pro", "crypto-pools.org", "monero.net", 
"backup-pool.com", "mooo.com", "freeyy.me", "cryptonight.net", "shscrypto.net")
| extend timestamp = TimeGenerated, IPCustomEntity = ClientIP, HostCustomEntity = Computer

```

## DNS events related to mining pools

'Identifies IP addresses that may be performing DNS lookups associated with common currency mining pools.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1496|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | 0d76e9cf-788d-4a69-ac7d-f234826b5bed |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/DNS_Miners.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

DnsEvents
| where Name contains "."
| where Name has_any ("monerohash.com", "do-dear.com", "xmrminerpro.com", "secumine.net", "xmrpool.com", "minexmr.org", "hashanywhere.com", 
"xmrget.com", "mininglottery.eu", "minergate.com", "moriaxmr.com", "multipooler.com", "moneropools.com", "xmrpool.eu", "coolmining.club", 
"supportxmr.com", "minexmr.com", "hashvault.pro", "xmrpool.net", "crypto-pool.fr", "xmr.pt", "miner.rocks", "walpool.com", "herominers.com", 
"gntl.co.uk", "semipool.com", "coinfoundry.org", "cryptoknight.cc", "fairhash.org", "baikalmine.com", "tubepool.xyz", "fairpool.xyz", "asiapool.io", 
"coinpoolit.webhop.me", "nanopool.org", "moneropool.com", "miner.center", "prohash.net", "poolto.be", "cryptoescrow.eu", "monerominers.net", "cryptonotepool.org", 
"extrmepool.org", "webcoin.me", "kippo.eu", "hashinvest.ws", "monero.farm", "supportxmr.com", "xmrpool.eu", "linux-repository-updates.com", "1gh.com", 
"dwarfpool.com", "hash-to-coins.com", "hashvault.pro", "pool-proxy.com", "hashfor.cash", "fairpool.cloud", "litecoinpool.org", "mineshaft.ml", "abcxyz.stream", 
"moneropool.ru", "cryptonotepool.org.uk", "extremepool.org", "extremehash.com", "hashinvest.net", "unipool.pro", "crypto-pools.org", "monero.net", 
"backup-pool.com", "mooo.com", "freeyy.me", "cryptonight.net", "shscrypto.net")
| extend timestamp = TimeGenerated, IPCustomEntity = ClientIP, HostCustomEntity = Computer

```

## DNS events related to mining pools

'Identifies IP addresses that may be performing DNS lookups associated with common currency mining pools.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1496|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | 0d76e9cf-788d-4a69-ac7d-f234826b5bed |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/DNS_Miners.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

DnsEvents
| where Name contains "."
| where Name has_any ("monerohash.com", "do-dear.com", "xmrminerpro.com", "secumine.net", "xmrpool.com", "minexmr.org", "hashanywhere.com", 
"xmrget.com", "mininglottery.eu", "minergate.com", "moriaxmr.com", "multipooler.com", "moneropools.com", "xmrpool.eu", "coolmining.club", 
"supportxmr.com", "minexmr.com", "hashvault.pro", "xmrpool.net", "crypto-pool.fr", "xmr.pt", "miner.rocks", "walpool.com", "herominers.com", 
"gntl.co.uk", "semipool.com", "coinfoundry.org", "cryptoknight.cc", "fairhash.org", "baikalmine.com", "tubepool.xyz", "fairpool.xyz", "asiapool.io", 
"coinpoolit.webhop.me", "nanopool.org", "moneropool.com", "miner.center", "prohash.net", "poolto.be", "cryptoescrow.eu", "monerominers.net", "cryptonotepool.org", 
"extrmepool.org", "webcoin.me", "kippo.eu", "hashinvest.ws", "monero.farm", "supportxmr.com", "xmrpool.eu", "linux-repository-updates.com", "1gh.com", 
"dwarfpool.com", "hash-to-coins.com", "hashvault.pro", "pool-proxy.com", "hashfor.cash", "fairpool.cloud", "litecoinpool.org", "mineshaft.ml", "abcxyz.stream", 
"moneropool.ru", "cryptonotepool.org.uk", "extremepool.org", "extremehash.com", "hashinvest.net", "unipool.pro", "crypto-pools.org", "monero.net", 
"backup-pool.com", "mooo.com", "freeyy.me", "cryptonight.net", "shscrypto.net")
| extend timestamp = TimeGenerated, IPCustomEntity = ClientIP, HostCustomEntity = Computer

```

## NRT DNS events related to mining pools

'Identifies IP addresses that may be performing DNS lookups associated with common currency mining pools.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1496|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | d5b32cd4-2328-43da-ab47-cd289c1f5efc |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/NRT_DNS_Related_To_Mining_Pools.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DnsEvents
| where Name contains "."
| where Name has_any ("monerohash.com", "do-dear.com", "xmrminerpro.com", "secumine.net", "xmrpool.com", "minexmr.org", "hashanywhere.com",
"xmrget.com", "mininglottery.eu", "minergate.com", "moriaxmr.com", "multipooler.com", "moneropools.com", "xmrpool.eu", "coolmining.club",
"supportxmr.com", "minexmr.com", "hashvault.pro", "xmrpool.net", "crypto-pool.fr", "xmr.pt", "miner.rocks", "walpool.com", "herominers.com",
"gntl.co.uk", "semipool.com", "coinfoundry.org", "cryptoknight.cc", "fairhash.org", "baikalmine.com", "tubepool.xyz", "fairpool.xyz", "asiapool.io",
"coinpoolit.webhop.me", "nanopool.org", "moneropool.com", "miner.center", "prohash.net", "poolto.be", "cryptoescrow.eu", "monerominers.net", "cryptonotepool.org",
"extrmepool.org", "webcoin.me", "kippo.eu", "hashinvest.ws", "monero.farm", "supportxmr.com", "xmrpool.eu", "linux-repository-updates.com", "1gh.com",
"dwarfpool.com", "hash-to-coins.com", "hashvault.pro", "pool-proxy.com", "hashfor.cash", "fairpool.cloud", "litecoinpool.org", "mineshaft.ml", "abcxyz.stream",
"moneropool.ru", "cryptonotepool.org.uk", "extremepool.org", "extremehash.com", "hashinvest.net", "unipool.pro", "crypto-pools.org", "monero.net",
"backup-pool.com", "mooo.com", "freeyy.me", "cryptonight.net", "shscrypto.net")

```

## NRT DNS events related to mining pools

'Identifies IP addresses that may be performing DNS lookups associated with common currency mining pools.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1496|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | d5b32cd4-2328-43da-ab47-cd289c1f5efc |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/NRT_DNS_Related_To_Mining_Pools.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DnsEvents
| where Name contains "."
| where Name has_any ("monerohash.com", "do-dear.com", "xmrminerpro.com", "secumine.net", "xmrpool.com", "minexmr.org", "hashanywhere.com",
"xmrget.com", "mininglottery.eu", "minergate.com", "moriaxmr.com", "multipooler.com", "moneropools.com", "xmrpool.eu", "coolmining.club",
"supportxmr.com", "minexmr.com", "hashvault.pro", "xmrpool.net", "crypto-pool.fr", "xmr.pt", "miner.rocks", "walpool.com", "herominers.com",
"gntl.co.uk", "semipool.com", "coinfoundry.org", "cryptoknight.cc", "fairhash.org", "baikalmine.com", "tubepool.xyz", "fairpool.xyz", "asiapool.io",
"coinpoolit.webhop.me", "nanopool.org", "moneropool.com", "miner.center", "prohash.net", "poolto.be", "cryptoescrow.eu", "monerominers.net", "cryptonotepool.org",
"extrmepool.org", "webcoin.me", "kippo.eu", "hashinvest.ws", "monero.farm", "supportxmr.com", "xmrpool.eu", "linux-repository-updates.com", "1gh.com",
"dwarfpool.com", "hash-to-coins.com", "hashvault.pro", "pool-proxy.com", "hashfor.cash", "fairpool.cloud", "litecoinpool.org", "mineshaft.ml", "abcxyz.stream",
"moneropool.ru", "cryptonotepool.org.uk", "extremepool.org", "extremehash.com", "hashinvest.net", "unipool.pro", "crypto-pools.org", "monero.net",
"backup-pool.com", "mooo.com", "freeyy.me", "cryptonight.net", "shscrypto.net")

```

## NRT DNS events related to mining pools

'Identifies IP addresses that may be performing DNS lookups associated with common currency mining pools.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1496|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | d5b32cd4-2328-43da-ab47-cd289c1f5efc |
|DataTypes | DnsEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/NRT_DNS_Related_To_Mining_Pools.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DnsEvents
| where Name contains "."
| where Name has_any ("monerohash.com", "do-dear.com", "xmrminerpro.com", "secumine.net", "xmrpool.com", "minexmr.org", "hashanywhere.com",
"xmrget.com", "mininglottery.eu", "minergate.com", "moriaxmr.com", "multipooler.com", "moneropools.com", "xmrpool.eu", "coolmining.club",
"supportxmr.com", "minexmr.com", "hashvault.pro", "xmrpool.net", "crypto-pool.fr", "xmr.pt", "miner.rocks", "walpool.com", "herominers.com",
"gntl.co.uk", "semipool.com", "coinfoundry.org", "cryptoknight.cc", "fairhash.org", "baikalmine.com", "tubepool.xyz", "fairpool.xyz", "asiapool.io",
"coinpoolit.webhop.me", "nanopool.org", "moneropool.com", "miner.center", "prohash.net", "poolto.be", "cryptoescrow.eu", "monerominers.net", "cryptonotepool.org",
"extrmepool.org", "webcoin.me", "kippo.eu", "hashinvest.ws", "monero.farm", "supportxmr.com", "xmrpool.eu", "linux-repository-updates.com", "1gh.com",
"dwarfpool.com", "hash-to-coins.com", "hashvault.pro", "pool-proxy.com", "hashfor.cash", "fairpool.cloud", "litecoinpool.org", "mineshaft.ml", "abcxyz.stream",
"moneropool.ru", "cryptonotepool.org.uk", "extremepool.org", "extremehash.com", "hashinvest.net", "unipool.pro", "crypto-pools.org", "monero.net",
"backup-pool.com", "mooo.com", "freeyy.me", "cryptonight.net", "shscrypto.net")

```

## DNS events related to ToR proxies

'Identifies IP addresses performing DNS lookups associated with common ToR proxies.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1048|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | a83ef0f4-dace-4767-bce3-ebd32599d2a0 |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/DNS_TorProxies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

DnsEvents
| where Name contains "."
| where Name has_any ("tor2web.org", "tor2web.com", "torlink.co", "onion.to", "onion.ink", "onion.cab", "onion.nu", "onion.link", 
"onion.it", "onion.city", "onion.direct", "onion.top", "onion.casa", "onion.plus", "onion.rip", "onion.dog", "tor2web.fi", 
"tor2web.blutmagie.de", "onion.sh", "onion.lu", "onion.pet", "t2w.pw", "tor2web.ae.org", "tor2web.io", "tor2web.xyz", "onion.lt", 
"s1.tor-gateways.de", "s2.tor-gateways.de", "s3.tor-gateways.de", "s4.tor-gateways.de", "s5.tor-gateways.de", "hiddenservice.net")
| extend timestamp = TimeGenerated, IPCustomEntity = ClientIP, HostCustomEntity = Computer

```

## DNS events related to ToR proxies

'Identifies IP addresses performing DNS lookups associated with common ToR proxies.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1048|
|Platform | Windows|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | a83ef0f4-dace-4767-bce3-ebd32599d2a0 |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/DNS_TorProxies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

DnsEvents
| where Name contains "."
| where Name has_any ("tor2web.org", "tor2web.com", "torlink.co", "onion.to", "onion.ink", "onion.cab", "onion.nu", "onion.link", 
"onion.it", "onion.city", "onion.direct", "onion.top", "onion.casa", "onion.plus", "onion.rip", "onion.dog", "tor2web.fi", 
"tor2web.blutmagie.de", "onion.sh", "onion.lu", "onion.pet", "t2w.pw", "tor2web.ae.org", "tor2web.io", "tor2web.xyz", "onion.lt", 
"s1.tor-gateways.de", "s2.tor-gateways.de", "s3.tor-gateways.de", "s4.tor-gateways.de", "s5.tor-gateways.de", "hiddenservice.net")
| extend timestamp = TimeGenerated, IPCustomEntity = ClientIP, HostCustomEntity = Computer

```

## DNS events related to ToR proxies

'Identifies IP addresses performing DNS lookups associated with common ToR proxies.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1048|
|Platform | Linux|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | a83ef0f4-dace-4767-bce3-ebd32599d2a0 |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/DNS_TorProxies.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

DnsEvents
| where Name contains "."
| where Name has_any ("tor2web.org", "tor2web.com", "torlink.co", "onion.to", "onion.ink", "onion.cab", "onion.nu", "onion.link", 
"onion.it", "onion.city", "onion.direct", "onion.top", "onion.casa", "onion.plus", "onion.rip", "onion.dog", "tor2web.fi", 
"tor2web.blutmagie.de", "onion.sh", "onion.lu", "onion.pet", "t2w.pw", "tor2web.ae.org", "tor2web.io", "tor2web.xyz", "onion.lt", 
"s1.tor-gateways.de", "s2.tor-gateways.de", "s3.tor-gateways.de", "s4.tor-gateways.de", "s5.tor-gateways.de", "hiddenservice.net")
| extend timestamp = TimeGenerated, IPCustomEntity = ClientIP, HostCustomEntity = Computer

```

## Potential DGA detected

'Identifies clients with a high NXDomain count which could be indicative of a DGA (cycling through possible C2 domains
where most C2s are not live). Alert is generated when a new IP address is seen (based on not being seen associated with 
NXDomain records in prior 10-day baseline period).'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1568|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | DNS |
|DetectionId | a0907abe-6925-4d90-af2b-c7e89dc201a6 |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 10d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/DnsEvents/DNS_HighNXDomainCount_detection.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = 10d;
let endtime = 1d;
let threshold = 100;
let nxDomainDnsEvents = DnsEvents 
| where ResultCode == 3 
| where QueryType in ("A", "AAAA")
| where ipv4_is_match("127.0.0.1", ClientIP) == False
| where Name !contains "/"
| where Name contains ".";
nxDomainDnsEvents
| where TimeGenerated > ago(endtime)
| extend sld = tostring(split(Name, ".")[-2])
| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), dcount(sld) by ClientIP
| where dcount_sld > threshold
// Filter out previously seen IPs
| join kind=leftanti (nxDomainDnsEvents
    | where TimeGenerated between(ago(starttime)..ago(endtime))
    | extend sld = tostring(split(Name, ".")[-2])
    | summarize dcount(sld) by ClientIP
    | where dcount_sld > threshold ) on ClientIP
// Pull out sample NXDomain responses for those remaining potentially infected IPs
| join kind = inner (nxDomainDnsEvents | summarize by Name, ClientIP) on ClientIP
| summarize StartTimeUtc = min(StartTimeUtc), EndTimeUtc = max(EndTimeUtc), sampleNXDomainList=make_list(Name, 100)  by ClientIP, dcount_sld
| extend timestamp = StartTimeUtc, IPCustomEntity = ClientIP

```
