# Rules: 4894-4914

## Potential DGA detected

'Clients with a high NXDomain count could be indicative of a DGA (cycling through possible C2 domains
where most C2s are not live). Based on quartile precent analysis aglorithm.'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1008|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | DNS |
|DetectionId | 543e1ec6-ee5e-4368-aaa6-405f0551ba5c |
|DataTypes | DnsEvents |
|QueryFrequency | 1d |
|QueryPeriod | 10d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/DnsEvents/DNS_HighPercentNXDomainCount.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let timeframe = 1d;
let excludeTLD = dynamic(["arris","ati","virtusa","unknowndomain","onion","corp","domain","local","localdomain","host","home","gateway","lan",
"services","hub","domain.name","WirelessAP","Digicom-ADSL","OpenDNS","dlinkrouter","Dlink","ASUS","device","router","Belkin","DHCP","Cisco"]);
let nxDomainDnsEvents = DnsEvents
| where TimeGenerated between(starttime..endtime)
| where ResultCode == 3 
| where QueryType in ("A", "AAAA")
| where ipv4_is_match("127.0.0.1", ClientIP) == False
| where Name !contains "/"
| where Name contains "."
| extend mytld = tostring(split(Name, '.')[-1])
| where mytld !in~ (excludeTLD)
| extend truncatedDomain = iff((strlen(Name) - indexof(Name, tostring(split(Name, ".")[-2])) ) >= 7, 
strcat(tostring(split(Name, ".")[-2]), ".", tostring(split(Name, ".")[-1])) , 
strcat(tostring(split(Name, ".")[-3]), ".", tostring(split(Name, ".")[-2]), ".", tostring(split(Name, ".")[-1])));
let quartileFunctionForIPThreshold = view (mypercentile:long, startTimeSpan:timespan, endTimeSpan:timespan) {
(nxDomainDnsEvents
| where TimeGenerated between (ago(startTimeSpan)..ago(endTimeSpan))
| summarize domainCount = dcount(truncatedDomain) by ClientIP, bin(TimeGenerated, 1d)
| project SearchList = (domainCount), ClientIP
| summarize qPercentiles = percentiles(SearchList, mypercentile) by ClientIP);
};
let firstQT = quartileFunctionForIPThreshold(25, 7d, 2d) | project-rename percentile_SearchList_25 = qPercentiles;
let thirdQT = quartileFunctionForIPThreshold(75, 7d, 2d) | project-rename percentile_SearchList_75 = qPercentiles;
// The IP threshold could be adjusted for based on the skewness of the IPthreshold distribution per IP - https://wis.kuleuven.be/stat/robust/papers/2008/outlierdetectionskeweddata-revision.pdf
let threshold = (firstQT
| join thirdQT on ClientIP
| extend IPthreshold = percentile_SearchList_75 + (1.5*exp(3)*(percentile_SearchList_75 - percentile_SearchList_25))
| project ClientIP, IPthreshold);
let FilterOnIPThreshold_MainTable = (
nxDomainDnsEvents
| summarize TotalNXLookups=dcount(truncatedDomain) by ClientIP
| sort by TotalNXLookups desc
| join ['threshold'] on ClientIP
// Comment the line below in order to view results filtered by Global Threshold only. 
| where TotalNXLookups > IPthreshold 
| join kind = leftouter (nxDomainDnsEvents
    | where TimeGenerated > ago(timeframe)
    | summarize domainCount = dcount(Name) by truncatedDomain, ClientIP
    | project SearchList = strcat(truncatedDomain," (",tostring(domainCount),")"), ClientIP
    ) on ClientIP
| summarize SLDs_DistinctLookups = make_list(SearchList) by ClientIP, TotalNXLookups, IPthreshold
| sort by TotalNXLookups desc);
//
let quartileFunctionForGlobalThreshold = view (mypercentile:long, startTimeSpan:timespan) {
(nxDomainDnsEvents
| where TimeGenerated > ago(startTimeSpan)
| summarize domainCount = dcount(truncatedDomain) by ClientIP
| summarize event_count = count() by domainCount
| summarize perc2 = percentilesw(domainCount, event_count, mypercentile));
};
let firstQ = toscalar(quartileFunctionForGlobalThreshold(25, 1d));
let thirdQ = toscalar(quartileFunctionForGlobalThreshold(75, 1d));
// The Global threshold could be adjusted for based on the skewness of the GlobalThreshold distribution per IP - https://wis.kuleuven.be/stat/robust/papers/2008/outlierdetectionskeweddata-revision.pdf
let GlobalThreshold = toscalar(thirdQ + (1.5*exp(3)*(thirdQ - firstQ)));
let FilterOnGlobalThreshold_MainTable = (
nxDomainDnsEvents
| where TimeGenerated > ago(timeframe)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), TotalNXLookups = dcount(truncatedDomain) by ClientIP
| sort by TotalNXLookups desc
// Comment the line below in order to view results filtered by IPThreshold only. 
| where TotalNXLookups > GlobalThreshold 
| join kind = leftouter (nxDomainDnsEvents
    | where TimeGenerated > ago(timeframe)
    | summarize domainCount = dcount(Name) by truncatedDomain, ClientIP
    | project truncatedDomain = strcat(truncatedDomain," (",tostring(domainCount),")"), ClientIP
    ) on ClientIP
| summarize StartTime = min(StartTime), EndTime = max(EndTime), SLDs_DistinctLookups = make_list(truncatedDomain), UniqueSLDsCount=count(truncatedDomain) by ClientIP, TotalNXLookups, GlobalThreshold
| sort by TotalNXLookups desc);
FilterOnIPThreshold_MainTable
| join FilterOnGlobalThreshold_MainTable on ClientIP
| project StartTime, EndTime, ClientIP, TotalNXLookups, IPthreshold, GlobalThreshold, SLDs_DistinctLookups, UniqueSLDsCount
| extend timestamp = StartTime, IPCustomEntity = ClientIP

```

## External user added and removed in a short timeframe - Hunt Version

'This hunting query identifies external user accounts that are added to a Team and then removed within one hour.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1136|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 119d9e1c-afcc-4d23-b239-cdb4e7bf851c |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/ExternalUserAddedRemovedInTeams_HuntVersion.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// If you want to look at user added further than 7 days ago adjust this value
// If you want to change the timeframe of how quickly accounts need to be added and removed change this value
let time_delta = 1h;
OfficeActivity
| where OfficeWorkload =~ "MicrosoftTeams" 
| where Operation =~ "MemberAdded"
| extend UPN = tostring(parse_json(Members)[0].UPN)
| where UPN contains ("#EXT#")
| project TimeAdded=TimeGenerated, Operation, UPN, UserWhoAdded = UserId, TeamName, TeamGuid
| join (
OfficeActivity
| where OfficeWorkload =~ "MicrosoftTeams" 
| where Operation =~ "MemberRemoved"
| extend UPN = tostring(parse_json(Members)[0].UPN)
| where UPN contains ("#EXT#")
| project TimeDeleted=TimeGenerated, Operation, UPN, UserWhoDeleted = UserId, TeamName, TeamGuid) on UPN, TeamGuid
| where TimeDeleted < (TimeAdded + time_delta)
| project TimeAdded, TimeDeleted, UPN, UserWhoAdded, UserWhoDeleted, TeamName, TeamGuid
| extend timestamp = TimeAdded, AccountCustomEntity = UPN

```

## SharePointFileOperation via previously unseen IPs

'Shows volume of documents uploaded to or downloaded from Sharepoint by IPs with ASNs associated with high user lockout or malicious activity.
In stable environments such connections by new IPs may be unauthorized, especially if associated with
spikes in volume which could be associated with large-scale document exfiltration.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1030|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | e3d24cfd-b2a1-4ba7-8f80-0360892f9d57 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/new_sharepoint_downloads_by_IP.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let BLOCK_THRESHOLD = 1.0;
let HighBlockRateASNs =
SigninLogs
| where TimeGenerated > lookback
| where isnotempty(AutonomousSystemNumber)
| summarize make_set(IPAddress), TotalIps = dcount(IPAddress), BlockedSignins= countif(ResultType == "50053"), TotalSignins = count() by AutonomousSystemNumber
| extend BlockRatio = 1.00 * BlockedSignins/TotalSignins
| where BlockRatio >= BLOCK_THRESHOLD
| distinct AutonomousSystemNumber
;
let ASNIPs=
SigninLogs
| where TimeGenerated > lookback
| where AutonomousSystemNumber in (HighBlockRateASNs)
| distinct IPAddress, AutonomousSystemNumber
;
OfficeActivity
| where TimeGenerated between(starttime .. endtime)
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| where ClientIP in (ASNIPs)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), RecentFileActivities = count() by ClientIP
| extend timestamp = StartTime, IPCustomEntity = ClientIP

```

## SharePointFileOperation via previously unseen IPs

'Shows volume of documents uploaded to or downloaded from Sharepoint by IPs with ASNs associated with high user lockout or malicious activity.
In stable environments such connections by new IPs may be unauthorized, especially if associated with
spikes in volume which could be associated with large-scale document exfiltration.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1030|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | e3d24cfd-b2a1-4ba7-8f80-0360892f9d57 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/new_sharepoint_downloads_by_IP.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let BLOCK_THRESHOLD = 1.0;
let HighBlockRateASNs =
SigninLogs
| where TimeGenerated > lookback
| where isnotempty(AutonomousSystemNumber)
| summarize make_set(IPAddress), TotalIps = dcount(IPAddress), BlockedSignins= countif(ResultType == "50053"), TotalSignins = count() by AutonomousSystemNumber
| extend BlockRatio = 1.00 * BlockedSignins/TotalSignins
| where BlockRatio >= BLOCK_THRESHOLD
| distinct AutonomousSystemNumber
;
let ASNIPs=
SigninLogs
| where TimeGenerated > lookback
| where AutonomousSystemNumber in (HighBlockRateASNs)
| distinct IPAddress, AutonomousSystemNumber
;
OfficeActivity
| where TimeGenerated between(starttime .. endtime)
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| where ClientIP in (ASNIPs)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), RecentFileActivities = count() by ClientIP
| extend timestamp = StartTime, IPCustomEntity = ClientIP

```

## SharePointFileOperation via previously unseen IPs

'Shows volume of documents uploaded to or downloaded from Sharepoint by IPs with ASNs associated with high user lockout or malicious activity.
In stable environments such connections by new IPs may be unauthorized, especially if associated with
spikes in volume which could be associated with large-scale document exfiltration.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1030|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | e3d24cfd-b2a1-4ba7-8f80-0360892f9d57 |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/new_sharepoint_downloads_by_IP.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let BLOCK_THRESHOLD = 1.0;
let HighBlockRateASNs =
SigninLogs
| where TimeGenerated > lookback
| where isnotempty(AutonomousSystemNumber)
| summarize make_set(IPAddress), TotalIps = dcount(IPAddress), BlockedSignins= countif(ResultType == "50053"), TotalSignins = count() by AutonomousSystemNumber
| extend BlockRatio = 1.00 * BlockedSignins/TotalSignins
| where BlockRatio >= BLOCK_THRESHOLD
| distinct AutonomousSystemNumber
;
let ASNIPs=
SigninLogs
| where TimeGenerated > lookback
| where AutonomousSystemNumber in (HighBlockRateASNs)
| distinct IPAddress, AutonomousSystemNumber
;
OfficeActivity
| where TimeGenerated between(starttime .. endtime)
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| where ClientIP in (ASNIPs)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), RecentFileActivities = count() by ClientIP
| extend timestamp = StartTime, IPCustomEntity = ClientIP

```

## Files uploaded to teams and access summary

'This hunting queries identifies files uploaded to SharePoint via a Teams chat and
summarizes users and IP addresses that have accessed these files. This allows for 
identification of anomolous file sharing patterns.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1199|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 90e198a9-efb6-4719-ad89-81b8e93633a7 |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/TeamsFilesUploaded.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity 
| where RecordType =~ "SharePointFileOperation"
| where Operation =~ "FileUploaded" 
| where UserId != "app@sharepoint"
| where SourceRelativeUrl has "Microsoft Teams Chat Files" 
| join kind= leftouter ( 
   OfficeActivity 
    | where RecordType =~ "SharePointFileOperation"
    | where Operation =~ "FileDownloaded" or Operation =~ "FileAccessed" 
    | where UserId != "app@sharepoint"
    | where SourceRelativeUrl has "Microsoft Teams Chat Files" 
) on OfficeObjectId 
| extend userBag = pack(UserId1, ClientIP1) 
| summarize makeset(UserId1), make_bag(userBag) by TimeGenerated, UserId, OfficeObjectId, SourceFileName 
| extend NumberUsers = array_length(bag_keys(bag_userBag))
| project timestamp=TimeGenerated, AccountCustomEntity=UserId, FileLocation=OfficeObjectId, FileName=SourceFileName, AccessedBy=bag_userBag, NumberOfUsersAccessed=NumberUsers

```

## Files uploaded to teams and access summary

'This hunting queries identifies files uploaded to SharePoint via a Teams chat and
summarizes users and IP addresses that have accessed these files. This allows for 
identification of anomolous file sharing patterns.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1102|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 90e198a9-efb6-4719-ad89-81b8e93633a7 |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/TeamsFilesUploaded.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity 
| where RecordType =~ "SharePointFileOperation"
| where Operation =~ "FileUploaded" 
| where UserId != "app@sharepoint"
| where SourceRelativeUrl has "Microsoft Teams Chat Files" 
| join kind= leftouter ( 
   OfficeActivity 
    | where RecordType =~ "SharePointFileOperation"
    | where Operation =~ "FileDownloaded" or Operation =~ "FileAccessed" 
    | where UserId != "app@sharepoint"
    | where SourceRelativeUrl has "Microsoft Teams Chat Files" 
) on OfficeObjectId 
| extend userBag = pack(UserId1, ClientIP1) 
| summarize makeset(UserId1), make_bag(userBag) by TimeGenerated, UserId, OfficeObjectId, SourceFileName 
| extend NumberUsers = array_length(bag_keys(bag_userBag))
| project timestamp=TimeGenerated, AccountCustomEntity=UserId, FileLocation=OfficeObjectId, FileName=SourceFileName, AccessedBy=bag_userBag, NumberOfUsersAccessed=NumberUsers

```

## Files uploaded to teams and access summary

'This hunting queries identifies files uploaded to SharePoint via a Teams chat and
summarizes users and IP addresses that have accessed these files. This allows for 
identification of anomolous file sharing patterns.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 90e198a9-efb6-4719-ad89-81b8e93633a7 |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/TeamsFilesUploaded.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity 
| where RecordType =~ "SharePointFileOperation"
| where Operation =~ "FileUploaded" 
| where UserId != "app@sharepoint"
| where SourceRelativeUrl has "Microsoft Teams Chat Files" 
| join kind= leftouter ( 
   OfficeActivity 
    | where RecordType =~ "SharePointFileOperation"
    | where Operation =~ "FileDownloaded" or Operation =~ "FileAccessed" 
    | where UserId != "app@sharepoint"
    | where SourceRelativeUrl has "Microsoft Teams Chat Files" 
) on OfficeObjectId 
| extend userBag = pack(UserId1, ClientIP1) 
| summarize makeset(UserId1), make_bag(userBag) by TimeGenerated, UserId, OfficeObjectId, SourceFileName 
| extend NumberUsers = array_length(bag_keys(bag_userBag))
| project timestamp=TimeGenerated, AccountCustomEntity=UserId, FileLocation=OfficeObjectId, FileName=SourceFileName, AccessedBy=bag_userBag, NumberOfUsersAccessed=NumberUsers

```

## Files uploaded to teams and access summary

'This hunting queries identifies files uploaded to SharePoint via a Teams chat and
summarizes users and IP addresses that have accessed these files. This allows for 
identification of anomolous file sharing patterns.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1199|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 90e198a9-efb6-4719-ad89-81b8e93633a7 |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/TeamsFilesUploaded.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity 
| where RecordType =~ "SharePointFileOperation"
| where Operation =~ "FileUploaded" 
| where UserId != "app@sharepoint"
| where SourceRelativeUrl has "Microsoft Teams Chat Files" 
| join kind= leftouter ( 
   OfficeActivity 
    | where RecordType =~ "SharePointFileOperation"
    | where Operation =~ "FileDownloaded" or Operation =~ "FileAccessed" 
    | where UserId != "app@sharepoint"
    | where SourceRelativeUrl has "Microsoft Teams Chat Files" 
) on OfficeObjectId 
| extend userBag = pack(UserId1, ClientIP1) 
| summarize makeset(UserId1), make_bag(userBag) by TimeGenerated, UserId, OfficeObjectId, SourceFileName 
| extend NumberUsers = array_length(bag_keys(bag_userBag))
| project timestamp=TimeGenerated, AccountCustomEntity=UserId, FileLocation=OfficeObjectId, FileName=SourceFileName, AccessedBy=bag_userBag, NumberOfUsersAccessed=NumberUsers

```

## Files uploaded to teams and access summary

'This hunting queries identifies files uploaded to SharePoint via a Teams chat and
summarizes users and IP addresses that have accessed these files. This allows for 
identification of anomolous file sharing patterns.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1102|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 90e198a9-efb6-4719-ad89-81b8e93633a7 |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/TeamsFilesUploaded.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity 
| where RecordType =~ "SharePointFileOperation"
| where Operation =~ "FileUploaded" 
| where UserId != "app@sharepoint"
| where SourceRelativeUrl has "Microsoft Teams Chat Files" 
| join kind= leftouter ( 
   OfficeActivity 
    | where RecordType =~ "SharePointFileOperation"
    | where Operation =~ "FileDownloaded" or Operation =~ "FileAccessed" 
    | where UserId != "app@sharepoint"
    | where SourceRelativeUrl has "Microsoft Teams Chat Files" 
) on OfficeObjectId 
| extend userBag = pack(UserId1, ClientIP1) 
| summarize makeset(UserId1), make_bag(userBag) by TimeGenerated, UserId, OfficeObjectId, SourceFileName 
| extend NumberUsers = array_length(bag_keys(bag_userBag))
| project timestamp=TimeGenerated, AccountCustomEntity=UserId, FileLocation=OfficeObjectId, FileName=SourceFileName, AccessedBy=bag_userBag, NumberOfUsersAccessed=NumberUsers

```

## Files uploaded to teams and access summary

'This hunting queries identifies files uploaded to SharePoint via a Teams chat and
summarizes users and IP addresses that have accessed these files. This allows for 
identification of anomolous file sharing patterns.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1078|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 90e198a9-efb6-4719-ad89-81b8e93633a7 |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/TeamsFilesUploaded.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity 
| where RecordType =~ "SharePointFileOperation"
| where Operation =~ "FileUploaded" 
| where UserId != "app@sharepoint"
| where SourceRelativeUrl has "Microsoft Teams Chat Files" 
| join kind= leftouter ( 
   OfficeActivity 
    | where RecordType =~ "SharePointFileOperation"
    | where Operation =~ "FileDownloaded" or Operation =~ "FileAccessed" 
    | where UserId != "app@sharepoint"
    | where SourceRelativeUrl has "Microsoft Teams Chat Files" 
) on OfficeObjectId 
| extend userBag = pack(UserId1, ClientIP1) 
| summarize makeset(UserId1), make_bag(userBag) by TimeGenerated, UserId, OfficeObjectId, SourceFileName 
| extend NumberUsers = array_length(bag_keys(bag_userBag))
| project timestamp=TimeGenerated, AccountCustomEntity=UserId, FileLocation=OfficeObjectId, FileName=SourceFileName, AccessedBy=bag_userBag, NumberOfUsersAccessed=NumberUsers

```

## Office Mail Forwarding - Hunting Version

'Adversaries often abuse email-forwarding rules to monitor activities of a victim, steal information and further gain intelligence on
victim or victim's organization.This query over Office Activity data highlights cases where user mail is being forwarded and shows if 
it is being forwarded to external domains as well.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1114|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | d49fc965-aef3-49f6-89ad-10cc4697eb5b |
|DataTypes | OfficeActivity (Exchange) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/OfficeMailForwarding_hunting.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity
| where (Operation =~ "Set-Mailbox" and Parameters contains 'ForwardingSmtpAddress') 
or (Operation in~ ('New-InboxRule','Set-InboxRule') and (Parameters contains 'ForwardTo' or Parameters contains 'RedirectTo'))
| extend parsed=parse_json(Parameters)
| extend fwdingDestination_initial = (iif(Operation=~"Set-Mailbox", tostring(parsed[1].Value), tostring(parsed[2].Value)))
| where isnotempty(fwdingDestination_initial)
| extend fwdingDestination = iff(fwdingDestination_initial has "smtp", (split(fwdingDestination_initial,":")[1]), fwdingDestination_initial )
| parse fwdingDestination with * '@' ForwardedtoDomain 
| parse UserId with *'@' UserDomain
| extend subDomain = ((split(strcat(tostring(split(UserDomain, '.')[-2]),'.',tostring(split(UserDomain, '.')[-1])), '.') [0]))
| where ForwardedtoDomain !contains subDomain
| extend Result = iff( ForwardedtoDomain != UserDomain ,"Mailbox rule created to forward to External Domain", "Forward rule for Internal domain")
| extend ClientIPAddress = case( ClientIP has ".", tostring(split(ClientIP,":")[0]), ClientIP has "[", tostring(trim_start(@'[[]',tostring(split(ClientIP,"]")[0]))), ClientIP )
| extend Port = case(
ClientIP has ".", (split(ClientIP,":")[1]),
ClientIP has "[", tostring(split(ClientIP,"]:")[1]),
ClientIP
)
| project TimeGenerated, UserId, UserDomain, subDomain, Operation, ForwardedtoDomain, ClientIPAddress, Result, Port, OriginatingServer, OfficeObjectId, fwdingDestination
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = ClientIPAddress, HostCustomEntity = OriginatingServer

```

## Office Mail Forwarding - Hunting Version

'Adversaries often abuse email-forwarding rules to monitor activities of a victim, steal information and further gain intelligence on
victim or victim's organization.This query over Office Activity data highlights cases where user mail is being forwarded and shows if 
it is being forwarded to external domains as well.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1020|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | d49fc965-aef3-49f6-89ad-10cc4697eb5b |
|DataTypes | OfficeActivity (Exchange) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/OfficeMailForwarding_hunting.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity
| where (Operation =~ "Set-Mailbox" and Parameters contains 'ForwardingSmtpAddress') 
or (Operation in~ ('New-InboxRule','Set-InboxRule') and (Parameters contains 'ForwardTo' or Parameters contains 'RedirectTo'))
| extend parsed=parse_json(Parameters)
| extend fwdingDestination_initial = (iif(Operation=~"Set-Mailbox", tostring(parsed[1].Value), tostring(parsed[2].Value)))
| where isnotempty(fwdingDestination_initial)
| extend fwdingDestination = iff(fwdingDestination_initial has "smtp", (split(fwdingDestination_initial,":")[1]), fwdingDestination_initial )
| parse fwdingDestination with * '@' ForwardedtoDomain 
| parse UserId with *'@' UserDomain
| extend subDomain = ((split(strcat(tostring(split(UserDomain, '.')[-2]),'.',tostring(split(UserDomain, '.')[-1])), '.') [0]))
| where ForwardedtoDomain !contains subDomain
| extend Result = iff( ForwardedtoDomain != UserDomain ,"Mailbox rule created to forward to External Domain", "Forward rule for Internal domain")
| extend ClientIPAddress = case( ClientIP has ".", tostring(split(ClientIP,":")[0]), ClientIP has "[", tostring(trim_start(@'[[]',tostring(split(ClientIP,"]")[0]))), ClientIP )
| extend Port = case(
ClientIP has ".", (split(ClientIP,":")[1]),
ClientIP has "[", tostring(split(ClientIP,"]:")[1]),
ClientIP
)
| project TimeGenerated, UserId, UserDomain, subDomain, Operation, ForwardedtoDomain, ClientIPAddress, Result, Port, OriginatingServer, OfficeObjectId, fwdingDestination
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = ClientIPAddress, HostCustomEntity = OriginatingServer

```

## Office Mail Forwarding - Hunting Version

'Adversaries often abuse email-forwarding rules to monitor activities of a victim, steal information and further gain intelligence on
victim or victim's organization.This query over Office Activity data highlights cases where user mail is being forwarded and shows if 
it is being forwarded to external domains as well.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1114|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | d49fc965-aef3-49f6-89ad-10cc4697eb5b |
|DataTypes | OfficeActivity (Exchange) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/OfficeMailForwarding_hunting.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity
| where (Operation =~ "Set-Mailbox" and Parameters contains 'ForwardingSmtpAddress') 
or (Operation in~ ('New-InboxRule','Set-InboxRule') and (Parameters contains 'ForwardTo' or Parameters contains 'RedirectTo'))
| extend parsed=parse_json(Parameters)
| extend fwdingDestination_initial = (iif(Operation=~"Set-Mailbox", tostring(parsed[1].Value), tostring(parsed[2].Value)))
| where isnotempty(fwdingDestination_initial)
| extend fwdingDestination = iff(fwdingDestination_initial has "smtp", (split(fwdingDestination_initial,":")[1]), fwdingDestination_initial )
| parse fwdingDestination with * '@' ForwardedtoDomain 
| parse UserId with *'@' UserDomain
| extend subDomain = ((split(strcat(tostring(split(UserDomain, '.')[-2]),'.',tostring(split(UserDomain, '.')[-1])), '.') [0]))
| where ForwardedtoDomain !contains subDomain
| extend Result = iff( ForwardedtoDomain != UserDomain ,"Mailbox rule created to forward to External Domain", "Forward rule for Internal domain")
| extend ClientIPAddress = case( ClientIP has ".", tostring(split(ClientIP,":")[0]), ClientIP has "[", tostring(trim_start(@'[[]',tostring(split(ClientIP,"]")[0]))), ClientIP )
| extend Port = case(
ClientIP has ".", (split(ClientIP,":")[1]),
ClientIP has "[", tostring(split(ClientIP,"]:")[1]),
ClientIP
)
| project TimeGenerated, UserId, UserDomain, subDomain, Operation, ForwardedtoDomain, ClientIPAddress, Result, Port, OriginatingServer, OfficeObjectId, fwdingDestination
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = ClientIPAddress, HostCustomEntity = OriginatingServer

```

## Office Mail Forwarding - Hunting Version

'Adversaries often abuse email-forwarding rules to monitor activities of a victim, steal information and further gain intelligence on
victim or victim's organization.This query over Office Activity data highlights cases where user mail is being forwarded and shows if 
it is being forwarded to external domains as well.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1020|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | d49fc965-aef3-49f6-89ad-10cc4697eb5b |
|DataTypes | OfficeActivity (Exchange) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/OfficeMailForwarding_hunting.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity
| where (Operation =~ "Set-Mailbox" and Parameters contains 'ForwardingSmtpAddress') 
or (Operation in~ ('New-InboxRule','Set-InboxRule') and (Parameters contains 'ForwardTo' or Parameters contains 'RedirectTo'))
| extend parsed=parse_json(Parameters)
| extend fwdingDestination_initial = (iif(Operation=~"Set-Mailbox", tostring(parsed[1].Value), tostring(parsed[2].Value)))
| where isnotempty(fwdingDestination_initial)
| extend fwdingDestination = iff(fwdingDestination_initial has "smtp", (split(fwdingDestination_initial,":")[1]), fwdingDestination_initial )
| parse fwdingDestination with * '@' ForwardedtoDomain 
| parse UserId with *'@' UserDomain
| extend subDomain = ((split(strcat(tostring(split(UserDomain, '.')[-2]),'.',tostring(split(UserDomain, '.')[-1])), '.') [0]))
| where ForwardedtoDomain !contains subDomain
| extend Result = iff( ForwardedtoDomain != UserDomain ,"Mailbox rule created to forward to External Domain", "Forward rule for Internal domain")
| extend ClientIPAddress = case( ClientIP has ".", tostring(split(ClientIP,":")[0]), ClientIP has "[", tostring(trim_start(@'[[]',tostring(split(ClientIP,"]")[0]))), ClientIP )
| extend Port = case(
ClientIP has ".", (split(ClientIP,":")[1]),
ClientIP has "[", tostring(split(ClientIP,"]:")[1]),
ClientIP
)
| project TimeGenerated, UserId, UserDomain, subDomain, Operation, ForwardedtoDomain, ClientIPAddress, Result, Port, OriginatingServer, OfficeObjectId, fwdingDestination
| extend timestamp = TimeGenerated, AccountCustomEntity = UserId, IPCustomEntity = ClientIPAddress, HostCustomEntity = OriginatingServer

```

## User made Owner of multiple teams

'This hunting query identifies users who have been made Owner of multiple Teams.'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 558f15dd-3171-4b11-bf24-31c0610a20e0 |
|DataTypes | OfficeActivity (Teams) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/MultiTeamOwner.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

// Adjust this value to change how many teams a user is made owner of before detecting
let max_owner_count = 3;
// Change this value to adjust how larger timeframe the query is run over.
let high_owner_count = (OfficeActivity
| where OfficeWorkload =~ "MicrosoftTeams"
| where Operation =~ "MemberRoleChanged"
| extend Member = tostring(parse_json(Members)[0].UPN) 
| extend NewRole = toint(parse_json(Members)[0].Role) 
| where NewRole == 2
| summarize dcount(TeamName) by Member
| where dcount_TeamName > max_owner_count
| project Member);
OfficeActivity
| where OfficeWorkload =~ "MicrosoftTeams"
| where Operation =~ "MemberRoleChanged"
| extend Member = tostring(parse_json(Members)[0].UPN) 
| extend NewRole = toint(parse_json(Members)[0].Role) 
| where NewRole == 2
| where Member in (high_owner_count)
| extend timestamp = TimeGenerated, AccountCustomEntity = Member

```

## New Windows Reserved Filenames staged on Office file services

'Identifies when new Windows Reserved Filenames show up on Office services such as SharePoint and OneDrive in relation to the previous 7 days.
List currently includes 'CON', 'PRN', 'AUX', 'NUL', 'COM1', 'COM2', 'COM3', 'COM4', 'COM5', 'COM6',
'COM7', 'COM8', 'COM9', 'LPT1', 'LPT2', 'LPT3', 'LPT4', 'LPT5', 'LPT6', 'LPT7', 'LPT8', 'LPT9' file extensions.
Additionally, identifies when a given user is uploading these files to another users workspace.
This may be indication of a staging location for malware or other malicious activity.
References: https://docs.microsoft.com/windows/win32/fileio/naming-a-file'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1105|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 641ecd2d-27c9-4f05-8433-8205096b09fc |
|DataTypes | OfficeActivity |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/New_WindowsReservedFileNamesOnOfficeFileServices.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = totimespan((endtime-starttime)*7);
// a threshold can be enabled, see commented line below for PrevSeenCount
let threshold = 1;
// Reserved FileNames/Extension for Windows
let Reserved = dynamic(['CON', 'PRN', 'AUX', 'NUL', 'COM1', 'COM2', 'COM3', 'COM4', 'COM5', 'COM6', 'COM7', 'COM8', 'COM9', 'LPT1', 'LPT2', 'LPT3', 'LPT4', 'LPT5', 'LPT6', 'LPT7', 'LPT8', 'LPT9']);
OfficeActivity | where TimeGenerated between(starttime..endtime)
| where isnotempty(SourceFileExtension)
| where SourceFileName !~ SourceFileExtension
| where SourceFileExtension in~ (Reserved) or SourceFileName in~ (Reserved)
| where UserAgent !has "Mac OS"
| project TimeGenerated, OfficeId, OfficeWorkload, RecordType, Operation, UserType, UserKey, UserId, ClientIP, UserAgent, Site_Url, SourceRelativeUrl, SourceFileName, SourceFileExtension
| join kind= leftanti (
OfficeActivity | where TimeGenerated between (ago(lookback)..starttime)
| where isnotempty(SourceFileExtension)
| where SourceFileName !~ SourceFileExtension
| where SourceFileExtension in~ (Reserved) or SourceFileName in~ (Reserved)
| where UserAgent !has "Mac OS"
| summarize SourceRelativeUrl = make_set(SourceRelativeUrl), UserId = make_set(UserId), SourceFileName = make_set(SourceFileName) , PrevSeenCount = count() by SourceFileExtension
// To exclude previous matches when only above a specific count, change threshold above and uncomment the line below
//| where PrevSeenCount > threshold
| mvexpand SourceRelativeUrl, UserId, SourceFileName
| extend SourceRelativeUrl = tostring(SourceRelativeUrl), UserId = tostring(UserId), SourceFileName = tostring(SourceFileName)
) on SourceFileExtension
| extend SiteUrlUserFolder = tolower(split(Site_Url, '/')[-2])
| extend UserIdUserFolderFormat = tolower(replace('@|\\.', '_',UserId))
// identify when UserId is not a match to the specific site url personal folder reference
| extend UserIdDiffThanUserFolder = iff(Site_Url has '/personal/' and SiteUrlUserFolder != UserIdUserFolderFormat, true , false )
| summarize TimeGenerated = make_list(TimeGenerated), StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), Operations = make_list(Operation), UserAgents = make_list(UserAgent),
OfficeIds = make_list(OfficeId), SourceRelativeUrls = make_list(SourceRelativeUrl), FileNames = make_list(SourceFileName)
by OfficeWorkload, RecordType, UserType, UserKey, UserId, ClientIP, Site_Url, SourceFileExtension, SiteUrlUserFolder, UserIdUserFolderFormat, UserIdDiffThanUserFolder
// Use mvexpand on any list items and you can expand out the exact time and other metadata about the hit
| extend timestamp = StartTime, AccountCustomEntity = UserId, IPCustomEntity = ClientIP

```

## SharePointFileOperation via clientIP with previously unseen user agents

'New user agents associated with a clientIP for sharepoint file uploads/downloads.'

|Name | Value |
| --- | --- |
|Tactic | Exfiltration|
|TechniqueId | T1030|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | e8ae1375-4640-430c-ae8e-2514d09c71eb |
|DataTypes | OfficeActivity (SharePoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/sharepoint_downloads.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let historicalUA=
OfficeActivity
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| where TimeGenerated between(lookback..starttime)
| summarize by ClientIP, UserAgent;
let recentUA = OfficeActivity
| where  RecordType == "SharePointFileOperation"
| where Operation in ("FileDownloaded", "FileUploaded")
| where TimeGenerated between(starttime..endtime)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by ClientIP, UserAgent;
recentUA | join kind=leftanti (
   historicalUA
) on ClientIP, UserAgent
// Some OfficeActivity records do not contain ClientIP information - exclude these for fewer results
| where not(isempty(ClientIP))
| extend timestamp = StartTime, IPCustomEntity = ClientIP

```

## Non-owner mailbox login activity

'This will help you determine if mailbox access observed with Admin/Delegate Logontype. 
The logon type indicates mailbox accessed from non-owner user. Exchange allows Admin 
and delegate permissions to access other user's inbox.
If your organization has valid admin, delegate access given to users, you can whitelist those and investigate other results.
References: https://docs.microsoft.com/office/office-365-management-api/office-365-management-activity-api-schema#logontype'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1114|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 0a8f410d-38b5-4d75-90da-32b472b97230 |
|DataTypes | OfficeActivity (Exchange) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/nonowner_MailboxLogin.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity
| where Operation == "MailboxLogin" and Logon_Type != "Owner" 
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by Operation, OrganizationName, UserType, UserId, MailboxOwnerUPN, Logon_Type, ClientIP
| extend timestamp = StartTime, AccountCustomEntity = UserId, IPCustomEntity = ClientIP

```

## Non-owner mailbox login activity

'This will help you determine if mailbox access observed with Admin/Delegate Logontype. 
The logon type indicates mailbox accessed from non-owner user. Exchange allows Admin 
and delegate permissions to access other user's inbox.
If your organization has valid admin, delegate access given to users, you can whitelist those and investigate other results.
References: https://docs.microsoft.com/office/office-365-management-api/office-365-management-activity-api-schema#logontype'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1020|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | 0a8f410d-38b5-4d75-90da-32b472b97230 |
|DataTypes | OfficeActivity (Exchange) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/OfficeActivity/nonowner_MailboxLogin.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

OfficeActivity
| where Operation == "MailboxLogin" and Logon_Type != "Owner" 
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), count() by Operation, OrganizationName, UserType, UserId, MailboxOwnerUPN, Logon_Type, ClientIP
| extend timestamp = StartTime, AccountCustomEntity = UserId, IPCustomEntity = ClientIP

```
