# Rules: 5965-5985

## qakbot-campaign-process-injection

This query was originally published in the threat analytics report, Qakbot blight lingers, seeds ransomware
Qakbot is malware that steals login credentials from banking and financial services. It has been deployed against small businesses as well as major corporations. Some outbreaks have involved targeted ransomware campaigns that use a similar set of techniques. Links to related queries are listed under See also.
The following query detects if Qakbot has injected code into the ping.exe process, to evade security and access credentials.
Reference - https://www.microsoft.com/security/blog/2017/11/06/mitigating-and-eliminating-info-stealing-qakbot-and-emotet-in-corporate-networks/

|Name | Value |
| --- | --- |
|Tactic | Defense evasion|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | c07d24d5-7c97-4ac4-873e-b364695df045 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Defense%20evasion/qakbot-campaign-process-injection.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DeviceProcessEvents
| where FileName == "esentutl.exe"
| where ProcessCommandLine has "WebCache"
| where ProcessCommandLine has_any ("V01", "/s", "/d")
| project ProcessCommandLine, InitiatingProcessParentFileName, 
DeviceId, Timestamp

```

## qakbot-campaign-process-injection

This query was originally published in the threat analytics report, Qakbot blight lingers, seeds ransomware
Qakbot is malware that steals login credentials from banking and financial services. It has been deployed against small businesses as well as major corporations. Some outbreaks have involved targeted ransomware campaigns that use a similar set of techniques. Links to related queries are listed under See also.
The following query detects if Qakbot has injected code into the ping.exe process, to evade security and access credentials.
Reference - https://www.microsoft.com/security/blog/2017/11/06/mitigating-and-eliminating-info-stealing-qakbot-and-emotet-in-corporate-networks/

|Name | Value |
| --- | --- |
|Tactic | Credential Access|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | c07d24d5-7c97-4ac4-873e-b364695df045 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Defense%20evasion/qakbot-campaign-process-injection.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DeviceProcessEvents
| where FileName == "esentutl.exe"
| where ProcessCommandLine has "WebCache"
| where ProcessCommandLine has_any ("V01", "/s", "/d")
| project ProcessCommandLine, InitiatingProcessParentFileName, 
DeviceId, Timestamp

```

## qakbot-campaign-process-injection

This query was originally published in the threat analytics report, Qakbot blight lingers, seeds ransomware
Qakbot is malware that steals login credentials from banking and financial services. It has been deployed against small businesses as well as major corporations. Some outbreaks have involved targeted ransomware campaigns that use a similar set of techniques. Links to related queries are listed under See also.
The following query detects if Qakbot has injected code into the ping.exe process, to evade security and access credentials.
Reference - https://www.microsoft.com/security/blog/2017/11/06/mitigating-and-eliminating-info-stealing-qakbot-and-emotet-in-corporate-networks/

|Name | Value |
| --- | --- |
|Tactic | Credential Access|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | c07d24d5-7c97-4ac4-873e-b364695df045 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Defense%20evasion/qakbot-campaign-process-injection.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
DeviceProcessEvents
| where FileName == "esentutl.exe"
| where ProcessCommandLine has "WebCache"
| where ProcessCommandLine has_any ("V01", "/s", "/d")
| project ProcessCommandLine, InitiatingProcessParentFileName, 
DeviceId, Timestamp

```

## alt-data-streams

This query was originally published in the threat analytics report, Ransomware continues to hit healthcare, critical services. There is also a related blog.
In April of 2020, security researchers observed multiple ransomware campaigns using the same set of techniques.
The following query detects suspicious use of Alternate Data Streams (ADS), which may indicate an attempt to mask malicious activity. These campaigns have been known to deploy ransomware in-memory and exploit ADS.
The See also section below lists more queries related to techniques shared by these campaigns.
References:
https://www.microsoft.com/security/blog/2020/04/28/ransomware-groups-continue-to-target-healthcare-critical-services-heres-how-to-reduce-risk/
https://docs.microsoft.com/sysinternals/downloads/streams

|Name | Value |
| --- | --- |
|Tactic | Defense evasion|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 7d8692e0-e643-43cb-ac77-6efc5a6b7f4d |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Defense%20evasion/alt-data-streams.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Alternate Data Streams execution 
DeviceProcessEvents 
| where Timestamp > ago(7d) 
// Command lines used 
| where ProcessCommandLine startswith "-q -s" and ProcessCommandLine hasprefix "-p" 
// Removing IDE processes 
and not(FolderPath has_any("visual studio", "ide")) 
| summarize make_set(ProcessCommandLine), make_set(FolderPath), 
make_set(InitiatingProcessCommandLine) by DeviceId, bin(Timestamp, 1h)

```

## alt-data-streams

This query was originally published in the threat analytics report, Ransomware continues to hit healthcare, critical services. There is also a related blog.
In April of 2020, security researchers observed multiple ransomware campaigns using the same set of techniques.
The following query detects suspicious use of Alternate Data Streams (ADS), which may indicate an attempt to mask malicious activity. These campaigns have been known to deploy ransomware in-memory and exploit ADS.
The See also section below lists more queries related to techniques shared by these campaigns.
References:
https://www.microsoft.com/security/blog/2020/04/28/ransomware-groups-continue-to-target-healthcare-critical-services-heres-how-to-reduce-risk/
https://docs.microsoft.com/sysinternals/downloads/streams

|Name | Value |
| --- | --- |
|Tactic | Defense evasion|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 7d8692e0-e643-43cb-ac77-6efc5a6b7f4d |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Defense%20evasion/alt-data-streams.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Alternate Data Streams execution 
DeviceProcessEvents 
| where Timestamp > ago(7d) 
// Command lines used 
| where ProcessCommandLine startswith "-q -s" and ProcessCommandLine hasprefix "-p" 
// Removing IDE processes 
and not(FolderPath has_any("visual studio", "ide")) 
| summarize make_set(ProcessCommandLine), make_set(FolderPath), 
make_set(InitiatingProcessCommandLine) by DeviceId, bin(Timestamp, 1h)

```

## ADFSDomainTrustMods[Nobelium]

This query will find when federation trust settings are changed for a domain or when the domain is changed from managed to federated authentication. Results will relate to when a new Active Directory Federated Service (ADFS) TrustedRealm object, such as a signing certificate, is added.
Modification to domain federation settings should be rare, so confirm the added or modified target domain/URL is legitimate administrative behavior.
The actor, Nobelium, was observed modifying domain trust settings to subvert existing mechanisms and cause the domain to accept authorization tokens signed with actor-owned certificates. See Customer Guidance on Recent Nation-State Cyber Attacks.
To understand why an authorized user may update settings for a federated domain in Office 365, Azure, or Intune, see Update or repair the settings of a federated domain in Office 365, Azure, or Intune.
For details on security realms that accept security tokens, see the ADFS Proxy Protocol (MS-ADFSPP) specification: 3.2.5.1.2.4 Security Realm Data.
For further information on AuditLogs, please see Azure AD audit activity reference.
This query is inspired by an Azure Sentinal detection.
References:
https://msrc-blog.microsoft.com/2020/12/13/customer-guidance-on-recent-nation-state-cyber-attacks/
https://docs.microsoft.com/office365/troubleshoot/active-directory/update-federated-domain-office-365
https://docs.microsoft.com/openspecs/windows_protocols/ms-adfspp/e7b9ea73-1980-4318-96a6-da559486664b
https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities
https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/ADFSDomainTrustMods.yaml

|Name | Value |
| --- | --- |
|Tactic | Defense evasion|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8b55db72-9ece-4e93-b551-cd7eb7355104 |
|DataTypes | CloudAppEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Defense%20evasion/ADFSDomainTrustMods[Nobelium].yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let auditLookback = 1d;
(union isfuzzy=true 
    (
    CloudAppEvents
    | where Timestamp > ago(auditLookback)
    | where ActionType =~ "Set federation settings on domain."
    ),
    (
    CloudAppEvents
    | where Timestamp > ago(auditLookback)
    | where ActionType =~ "Set domain authentication."
    | extend modifiedProperties = parse_json(RawEventData).ModifiedProperties
    | mvexpand modifiedProperties
    | extend newDomainValue=tostring(parse_json(modifiedProperties).NewValue)
    | where newDomainValue has "Federated"
    )
)
| extend resultStatus = extractjson("$.ResultStatus", tostring(RawEventData), typeof(string))
| extend targetDisplayName = parse_json(RawEventData).Target[0].ID
| project Timestamp, ActionType, InitiatingUserOrApp=AccountDisplayName, targetDisplayName, resultStatus, InitiatingIPAddress=IPAddress, UserAgent

```

## ADFSDomainTrustMods[Nobelium]

This query will find when federation trust settings are changed for a domain or when the domain is changed from managed to federated authentication. Results will relate to when a new Active Directory Federated Service (ADFS) TrustedRealm object, such as a signing certificate, is added.
Modification to domain federation settings should be rare, so confirm the added or modified target domain/URL is legitimate administrative behavior.
The actor, Nobelium, was observed modifying domain trust settings to subvert existing mechanisms and cause the domain to accept authorization tokens signed with actor-owned certificates. See Customer Guidance on Recent Nation-State Cyber Attacks.
To understand why an authorized user may update settings for a federated domain in Office 365, Azure, or Intune, see Update or repair the settings of a federated domain in Office 365, Azure, or Intune.
For details on security realms that accept security tokens, see the ADFS Proxy Protocol (MS-ADFSPP) specification: 3.2.5.1.2.4 Security Realm Data.
For further information on AuditLogs, please see Azure AD audit activity reference.
This query is inspired by an Azure Sentinal detection.
References:
https://msrc-blog.microsoft.com/2020/12/13/customer-guidance-on-recent-nation-state-cyber-attacks/
https://docs.microsoft.com/office365/troubleshoot/active-directory/update-federated-domain-office-365
https://docs.microsoft.com/openspecs/windows_protocols/ms-adfspp/e7b9ea73-1980-4318-96a6-da559486664b
https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities
https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/ADFSDomainTrustMods.yaml

|Name | Value |
| --- | --- |
|Tactic | Defense evasion|
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 8b55db72-9ece-4e93-b551-cd7eb7355104 |
|DataTypes | CloudAppEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/Defense%20evasion/ADFSDomainTrustMods[Nobelium].yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let auditLookback = 1d;
(union isfuzzy=true 
    (
    CloudAppEvents
    | where Timestamp > ago(auditLookback)
    | where ActionType =~ "Set federation settings on domain."
    ),
    (
    CloudAppEvents
    | where Timestamp > ago(auditLookback)
    | where ActionType =~ "Set domain authentication."
    | extend modifiedProperties = parse_json(RawEventData).ModifiedProperties
    | mvexpand modifiedProperties
    | extend newDomainValue=tostring(parse_json(modifiedProperties).NewValue)
    | where newDomainValue has "Federated"
    )
)
| extend resultStatus = extractjson("$.ResultStatus", tostring(RawEventData), typeof(string))
| extend targetDisplayName = parse_json(RawEventData).Target[0].ID
| project Timestamp, ActionType, InitiatingUserOrApp=AccountDisplayName, targetDisplayName, resultStatus, InitiatingIPAddress=IPAddress, UserAgent

```

## devices_with_vuln_and_users_received_payload (1)

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 9c2ba784-c664-40f1-b0df-8f34c6626be5 |
|DataTypes | DeviceTvmSoftwareVulnerabilities |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload%20(1).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// If these users opened those .mkv files
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
DeviceFileEvents 
| where DeviceName  in (all_computers_with_vlcvln)
| where FileName contains "mkv" 

```

## devices_with_vuln_and_users_received_payload (1)

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 9c2ba784-c664-40f1-b0df-8f34c6626be5 |
|DataTypes | DeviceTvmSoftwareVulnerabilities |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload%20(1).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// If these users opened those .mkv files
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
DeviceFileEvents 
| where DeviceName  in (all_computers_with_vlcvln)
| where FileName contains "mkv" 

```

## devices_with_vuln_and_users_received_payload (1)

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 9c2ba784-c664-40f1-b0df-8f34c6626be5 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload%20(1).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// If these users opened those .mkv files
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
DeviceFileEvents 
| where DeviceName  in (all_computers_with_vlcvln)
| where FileName contains "mkv" 

```

## devices_with_vuln_and_users_received_payload (1)

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 9c2ba784-c664-40f1-b0df-8f34c6626be5 |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload%20(1).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// If these users opened those .mkv files
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
DeviceFileEvents 
| where DeviceName  in (all_computers_with_vlcvln)
| where FileName contains "mkv" 

```

## devices_with_vuln_and_users_received_payload

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | fbcb7ff3-0d5a-4565-9caa-fc454138081f |
|DataTypes | DeviceTvmSoftwareVulnerabilities |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
let all_affected_users=
DeviceInfo
| where DeviceName in (all_computers_with_vlcvln)
| mvexpand todynamic(LoggedOnUsers)
| extend ParsedFields = parsejson(LoggedOnUsers)
| project UserName = ParsedFields.UserName
| summarize makelist(tolower(UserName));
let all_email_addresses_aff_users=
IdentityInfo
| where tolower(AccountName) in (all_affected_users)
| summarize makelist(tolower(EmailAddress));
EmailAttachmentInfo
| where FileName contains ".mkv"
| where tolower(RecipientEmailAddress) in (all_email_addresses_aff_users)

```

## devices_with_vuln_and_users_received_payload

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | fbcb7ff3-0d5a-4565-9caa-fc454138081f |
|DataTypes | DeviceTvmSoftwareVulnerabilities |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
let all_affected_users=
DeviceInfo
| where DeviceName in (all_computers_with_vlcvln)
| mvexpand todynamic(LoggedOnUsers)
| extend ParsedFields = parsejson(LoggedOnUsers)
| project UserName = ParsedFields.UserName
| summarize makelist(tolower(UserName));
let all_email_addresses_aff_users=
IdentityInfo
| where tolower(AccountName) in (all_affected_users)
| summarize makelist(tolower(EmailAddress));
EmailAttachmentInfo
| where FileName contains ".mkv"
| where tolower(RecipientEmailAddress) in (all_email_addresses_aff_users)

```

## devices_with_vuln_and_users_received_payload

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | fbcb7ff3-0d5a-4565-9caa-fc454138081f |
|DataTypes | DeviceInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
let all_affected_users=
DeviceInfo
| where DeviceName in (all_computers_with_vlcvln)
| mvexpand todynamic(LoggedOnUsers)
| extend ParsedFields = parsejson(LoggedOnUsers)
| project UserName = ParsedFields.UserName
| summarize makelist(tolower(UserName));
let all_email_addresses_aff_users=
IdentityInfo
| where tolower(AccountName) in (all_affected_users)
| summarize makelist(tolower(EmailAddress));
EmailAttachmentInfo
| where FileName contains ".mkv"
| where tolower(RecipientEmailAddress) in (all_email_addresses_aff_users)

```

## devices_with_vuln_and_users_received_payload

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | fbcb7ff3-0d5a-4565-9caa-fc454138081f |
|DataTypes | DeviceInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
let all_affected_users=
DeviceInfo
| where DeviceName in (all_computers_with_vlcvln)
| mvexpand todynamic(LoggedOnUsers)
| extend ParsedFields = parsejson(LoggedOnUsers)
| project UserName = ParsedFields.UserName
| summarize makelist(tolower(UserName));
let all_email_addresses_aff_users=
IdentityInfo
| where tolower(AccountName) in (all_affected_users)
| summarize makelist(tolower(EmailAddress));
EmailAttachmentInfo
| where FileName contains ".mkv"
| where tolower(RecipientEmailAddress) in (all_email_addresses_aff_users)

```

## devices_with_vuln_and_users_received_payload

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | fbcb7ff3-0d5a-4565-9caa-fc454138081f |
|DataTypes | IdentityInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
let all_affected_users=
DeviceInfo
| where DeviceName in (all_computers_with_vlcvln)
| mvexpand todynamic(LoggedOnUsers)
| extend ParsedFields = parsejson(LoggedOnUsers)
| project UserName = ParsedFields.UserName
| summarize makelist(tolower(UserName));
let all_email_addresses_aff_users=
IdentityInfo
| where tolower(AccountName) in (all_affected_users)
| summarize makelist(tolower(EmailAddress));
EmailAttachmentInfo
| where FileName contains ".mkv"
| where tolower(RecipientEmailAddress) in (all_email_addresses_aff_users)

```

## devices_with_vuln_and_users_received_payload

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | fbcb7ff3-0d5a-4565-9caa-fc454138081f |
|DataTypes | IdentityInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
let all_affected_users=
DeviceInfo
| where DeviceName in (all_computers_with_vlcvln)
| mvexpand todynamic(LoggedOnUsers)
| extend ParsedFields = parsejson(LoggedOnUsers)
| project UserName = ParsedFields.UserName
| summarize makelist(tolower(UserName));
let all_email_addresses_aff_users=
IdentityInfo
| where tolower(AccountName) in (all_affected_users)
| summarize makelist(tolower(EmailAddress));
EmailAttachmentInfo
| where FileName contains ".mkv"
| where tolower(RecipientEmailAddress) in (all_email_addresses_aff_users)

```

## devices_with_vuln_and_users_received_payload

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | fbcb7ff3-0d5a-4565-9caa-fc454138081f |
|DataTypes | EmailAttachmentInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
let all_affected_users=
DeviceInfo
| where DeviceName in (all_computers_with_vlcvln)
| mvexpand todynamic(LoggedOnUsers)
| extend ParsedFields = parsejson(LoggedOnUsers)
| project UserName = ParsedFields.UserName
| summarize makelist(tolower(UserName));
let all_email_addresses_aff_users=
IdentityInfo
| where tolower(AccountName) in (all_affected_users)
| summarize makelist(tolower(EmailAddress));
EmailAttachmentInfo
| where FileName contains ".mkv"
| where tolower(RecipientEmailAddress) in (all_email_addresses_aff_users)

```

## devices_with_vuln_and_users_received_payload

// Author: jan geisbauer
// @janvonkirchheim
// ------------------------
// 1.	A list of all devices that have this vulnerability
// 2.	A list of all users that uses those devices
// 3.	If these users received .mkv files recently

|Name | Value |
| --- | --- |
|Tactic | |
|TechniqueId | |
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | fbcb7ff3-0d5a-4565-9caa-fc454138081f |
|DataTypes | EmailAttachmentInfo |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/devices_with_vuln_and_users_received_payload.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let all_computers_with_vlcvln=
DeviceTvmSoftwareVulnerabilities 
| where SoftwareName contains "vlc" 
| summarize makelist(DeviceName);
let all_affected_users=
DeviceInfo
| where DeviceName in (all_computers_with_vlcvln)
| mvexpand todynamic(LoggedOnUsers)
| extend ParsedFields = parsejson(LoggedOnUsers)
| project UserName = ParsedFields.UserName
| summarize makelist(tolower(UserName));
let all_email_addresses_aff_users=
IdentityInfo
| where tolower(AccountName) in (all_affected_users)
| summarize makelist(tolower(EmailAddress));
EmailAttachmentInfo
| where FileName contains ".mkv"
| where tolower(RecipientEmailAddress) in (all_email_addresses_aff_users)

```

## Detect CISA Alert (AA22-117A) 2021 Top Routinely Exploited Vulnerabilities

This advanced hunting query detects CISA Alert (AA22-117A) 2021 Top Routinely Exploited Vulnerabilities https://www.cisa.gov/uscert/ncas/alerts/aa22-117a

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 755f0151-223f-4234-b534-9fc74b19903d |
|DataTypes | DeviceTvmSoftwareVulnerabilitiesKB |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/Microsoft%20365%20Defender/TVM/Detect_CISA_Alert_AA22-117A2021_Top_Routinely_Exploited_Vulnerabilities.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// CISA Alert (AA22-117A) 2021 Top Routinely Exploited Vulnerabilities https://www.cisa.gov/uscert/ncas/alerts/aa22-117a
let CISAAlertAA22117A= dynamic(
[
"CVE-2021-44228", // Log4Shell - Apache Log4j - Remote code execution (RCE)
"CVE-2021-40539", // Zoho ManageEngine AD SelfService Plus - RCE
"CVE-2021-34523", // ProxyShell - Microsoft Exchange Server - Elevation of privilege
"CVE-2021-34473", // ProxyShell - Microsoft Exchange Server - RCE
"CVE-2021-31207", // ProxyShell - Microsoft Exchange Server - Security feature bypass
"CVE-2021-27065", // ProxyLogon - Microsoft Exchange Server - RCE
"CVE-2021-26858", // ProxyLogon - Microsoft Exchange Server - RCE
"CVE-2021-26857", // ProxyLogon - Microsoft Exchange Server - RCE
"CVE-2021-26855", // ProxyLogon - Microsoft Exchange Server - RCE
"CVE-2021-26084", // Atlassian Confluence Server and Data Center - Arbitrary code execution
"CVE-2021-21972", // VMware vSphere Client - RCE 
"CVE-2020-1472", // ZeroLogon - Microsoft Netlogon Remote Protocol (MS-NRPC) - Elevation of privilege
"CVE-2020-0688", // Microsoft Exchange Server - RCE
"CVE-2019-11510", // Pulse Secure Pulse Connect Secure - Arbitrary file reading
"CVE-2018-13379", // Fortinet FortiOS and FortiProxy - Path traversal
"CVE-2021-42237", // Sitecore XP - RCE
"CVE-2021-35464", // ForgeRock OpenAM server - RCE
"CVE-2021-27104", // Accellion FTA - OS command execution
"CVE-2021-27103", // Accellion FTA - Server-side request forgery
"CVE-2021-27102", // Accellion FTA - OS command execution
"CVE-2021-27101", // Accellion FTA - SQL injection
"CVE-2021-21985", // SQL injection - RCE
"CVE-2021-20038", // SonicWall Secure Mobile Access (SMA) - RCE
"CVE-2021-40444", // Microsoft MSHTML - RCE
"CVE-2021-34527", // Microsoft Windows Print Spooler - RCE
"CVE-2021-3156", // Suco - Microsoft Windows Print Spooler
"CVE-2021-27852", // Checkbox Survey - Remote arbitrary code execution
"CVE-2021-22893", // Pulse Secure Pulse Connect Secure - Remote arbitrary code execution
"CVE-2021-20016", // SonicWall SSLVPN SMA100 - Improper SQL command neutralization, allowing for credential access
"CVE-2021-1675", // Windows Print Spooler - RCE
"CVE-2020-2509", // QNAP QTS and QuTS hero - Remote arbitrary code execution
"CVE-2019-19781", // Citrix Application Delivery Controller (ADC) and Gateway - Arbitrary code execution
"CVE-2019-18935", // Progress Telerik UI for ASP.NET AJAX - Code execution
"CVE-2018-0171", // Cisco IOS Software and IOS XE Software - Remote arbitrary code execution
"CVE-2017-11882", // Microsoft Office - RCE
"CVE-2017-0199" // Microsoft Office - RCE
 ]
);
DeviceTvmSoftwareVulnerabilitiesKB
| where CveId in(CISAAlertAA22117A)
| join DeviceTvmSoftwareVulnerabilities on CveId
| project-away CveId1, VulnerabilitySeverityLevel1, AffectedSoftware

```
