# Rules: 5104-5124

## Abnormally Large JPEG Filed Downloaded from New Source

'Threat actors can use JPEG files to hide malware, or other malicious code from inspection. This query looks for the downloading of abnormally large JPEG files from a source where large JPEG files have not been downloaded.
  Ref: https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1001.002|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | CEF |
|DetectionId | a2ff777e-46c8-4649-b19a-25a0ac059a18 |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/AbnormallyLargeJPEGFiledDownloadedfromNewSource.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let percentile = 95;
  let lookback_data = materialize(CommonSecurityLog
  | where TimeGenerated between(ago(7d)..ago(1d))
  | where FileType == "Jpeg Files" or RequestURL endswith ".jpg"
  | where isnotempty(RequestURL));
  let domains = lookback_data | summarize by DestinationHostName;
  CommonSecurityLog
  | where TimeGenerated > ago(1d)
  | where FileType =~ "Jpeg Files" or RequestURL endswith ".jpg"
  | where isnotempty(RequestURL)
  | extend filename = split(RequestURL, "/")[-1]
  | where ReceivedBytes > toscalar(lookback_data
  | summarize percentile(ReceivedBytes, percentile))
  | project-reorder TimeGenerated, filename, RequestURL, ReceivedBytes, RequestClientApplication, SourceUserName, DestinationHostName, RequestContext 
  | where DestinationHostName !in (domains) or isempty(DestinationHostName)

```

## Abnormally Large JPEG Filed Downloaded from New Source

'Threat actors can use JPEG files to hide malware, or other malicious code from inspection. This query looks for the downloading of abnormally large JPEG files from a source where large JPEG files have not been downloaded.
  Ref: https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1001.002|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | CEF |
|DetectionId | a2ff777e-46c8-4649-b19a-25a0ac059a18 |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/AbnormallyLargeJPEGFiledDownloadedfromNewSource.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let percentile = 95;
  let lookback_data = materialize(CommonSecurityLog
  | where TimeGenerated between(ago(7d)..ago(1d))
  | where FileType == "Jpeg Files" or RequestURL endswith ".jpg"
  | where isnotempty(RequestURL));
  let domains = lookback_data | summarize by DestinationHostName;
  CommonSecurityLog
  | where TimeGenerated > ago(1d)
  | where FileType =~ "Jpeg Files" or RequestURL endswith ".jpg"
  | where isnotempty(RequestURL)
  | extend filename = split(RequestURL, "/")[-1]
  | where ReceivedBytes > toscalar(lookback_data
  | summarize percentile(ReceivedBytes, percentile))
  | project-reorder TimeGenerated, filename, RequestURL, ReceivedBytes, RequestClientApplication, SourceUserName, DestinationHostName, RequestContext 
  | where DestinationHostName !in (domains) or isempty(DestinationHostName)

```

## Abnormally Large JPEG Filed Downloaded from New Source

'Threat actors can use JPEG files to hide malware, or other malicious code from inspection. This query looks for the downloading of abnormally large JPEG files from a source where large JPEG files have not been downloaded.
  Ref: https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1001.002|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | CEF |
|DetectionId | a2ff777e-46c8-4649-b19a-25a0ac059a18 |
|DataTypes | CommonSecurityLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/AbnormallyLargeJPEGFiledDownloadedfromNewSource.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let percentile = 95;
  let lookback_data = materialize(CommonSecurityLog
  | where TimeGenerated between(ago(7d)..ago(1d))
  | where FileType == "Jpeg Files" or RequestURL endswith ".jpg"
  | where isnotempty(RequestURL));
  let domains = lookback_data | summarize by DestinationHostName;
  CommonSecurityLog
  | where TimeGenerated > ago(1d)
  | where FileType =~ "Jpeg Files" or RequestURL endswith ".jpg"
  | where isnotempty(RequestURL)
  | extend filename = split(RequestURL, "/")[-1]
  | where ReceivedBytes > toscalar(lookback_data
  | summarize percentile(ReceivedBytes, percentile))
  | project-reorder TimeGenerated, filename, RequestURL, ReceivedBytes, RequestClientApplication, SourceUserName, DestinationHostName, RequestContext 
  | where DestinationHostName !in (domains) or isempty(DestinationHostName)

```

## Network Connection to New External LDAP Server

'This hunting query looks for outbound network connections using the LDAP protocol to external IP addresses, where that IP address has not had an LDAP network connection to it in the 14 days preceding the query timeframe. This could indicate someone exploiting a vulnerability such as CVE-2021-44228 to trigger the connection to a malicious LDAP server.
For more details on Apache Log4j Remote Code Execution Vulnerability - https://community.riskiq.com/article/505098fc/description
Find more details on collecting EXECVE data into Microsoft Sentinel - https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-threats-on-linux-with-azure-sentinel/ba-p/1344431'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | CheckPoint |
|DetectionId | bf094505-fd2e-484f-b72a-acd79ee00ce8 |
|DataTypes | CommonSecurityLog (CheckPoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/NetworkConnectionToNewExternalLDAPServer.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let legacy_ldap = (
CommonSecurityLog
| where TimeGenerated between(lookback..starttime)
// Filter to LDAP connections only
| where ApplicationProtocol =~ "ldap"
// Check LDAP server is external
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
// Filter out events where network connection was blocked - change this to expand hunt
| where DeviceAction has_any ("allow", "accept", "allowed")
| summarize by DestinationIP);
CommonSecurityLog
| where TimeGenerated between(starttime..endtime)
| where ApplicationProtocol =~ "ldap"
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
| where DestinationIP !in (legacy_ldap)
| where DeviceAction has_any ("allow", "accept", "allowed")
| project-reorder TimeGenerated, SourceIP, DestinationIP, ApplicationProtocol, DestinationPort, SentBytes, ReceivedBytes, DeviceAction
| extend timestamp = TimeGenerated, IPCustomEntity = SourceIP

```

## Network Connection to New External LDAP Server

'This hunting query looks for outbound network connections using the LDAP protocol to external IP addresses, where that IP address has not had an LDAP network connection to it in the 14 days preceding the query timeframe. This could indicate someone exploiting a vulnerability such as CVE-2021-44228 to trigger the connection to a malicious LDAP server.
For more details on Apache Log4j Remote Code Execution Vulnerability - https://community.riskiq.com/article/505098fc/description
Find more details on collecting EXECVE data into Microsoft Sentinel - https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-threats-on-linux-with-azure-sentinel/ba-p/1344431'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | CheckPoint |
|DetectionId | bf094505-fd2e-484f-b72a-acd79ee00ce8 |
|DataTypes | CommonSecurityLog (CheckPoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/NetworkConnectionToNewExternalLDAPServer.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let legacy_ldap = (
CommonSecurityLog
| where TimeGenerated between(lookback..starttime)
// Filter to LDAP connections only
| where ApplicationProtocol =~ "ldap"
// Check LDAP server is external
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
// Filter out events where network connection was blocked - change this to expand hunt
| where DeviceAction has_any ("allow", "accept", "allowed")
| summarize by DestinationIP);
CommonSecurityLog
| where TimeGenerated between(starttime..endtime)
| where ApplicationProtocol =~ "ldap"
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
| where DestinationIP !in (legacy_ldap)
| where DeviceAction has_any ("allow", "accept", "allowed")
| project-reorder TimeGenerated, SourceIP, DestinationIP, ApplicationProtocol, DestinationPort, SentBytes, ReceivedBytes, DeviceAction
| extend timestamp = TimeGenerated, IPCustomEntity = SourceIP

```

## Network Connection to New External LDAP Server

'This hunting query looks for outbound network connections using the LDAP protocol to external IP addresses, where that IP address has not had an LDAP network connection to it in the 14 days preceding the query timeframe. This could indicate someone exploiting a vulnerability such as CVE-2021-44228 to trigger the connection to a malicious LDAP server.
For more details on Apache Log4j Remote Code Execution Vulnerability - https://community.riskiq.com/article/505098fc/description
Find more details on collecting EXECVE data into Microsoft Sentinel - https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-threats-on-linux-with-azure-sentinel/ba-p/1344431'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | CheckPoint |
|DetectionId | bf094505-fd2e-484f-b72a-acd79ee00ce8 |
|DataTypes | CommonSecurityLog (CheckPoint) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/NetworkConnectionToNewExternalLDAPServer.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let legacy_ldap = (
CommonSecurityLog
| where TimeGenerated between(lookback..starttime)
// Filter to LDAP connections only
| where ApplicationProtocol =~ "ldap"
// Check LDAP server is external
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
// Filter out events where network connection was blocked - change this to expand hunt
| where DeviceAction has_any ("allow", "accept", "allowed")
| summarize by DestinationIP);
CommonSecurityLog
| where TimeGenerated between(starttime..endtime)
| where ApplicationProtocol =~ "ldap"
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
| where DestinationIP !in (legacy_ldap)
| where DeviceAction has_any ("allow", "accept", "allowed")
| project-reorder TimeGenerated, SourceIP, DestinationIP, ApplicationProtocol, DestinationPort, SentBytes, ReceivedBytes, DeviceAction
| extend timestamp = TimeGenerated, IPCustomEntity = SourceIP

```

## Network Connection to New External LDAP Server

'This hunting query looks for outbound network connections using the LDAP protocol to external IP addresses, where that IP address has not had an LDAP network connection to it in the 14 days preceding the query timeframe. This could indicate someone exploiting a vulnerability such as CVE-2021-44228 to trigger the connection to a malicious LDAP server.
For more details on Apache Log4j Remote Code Execution Vulnerability - https://community.riskiq.com/article/505098fc/description
Find more details on collecting EXECVE data into Microsoft Sentinel - https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-threats-on-linux-with-azure-sentinel/ba-p/1344431'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | CiscoASA |
|DetectionId | bf094505-fd2e-484f-b72a-acd79ee00ce8 |
|DataTypes | CommonSecurityLog (Cisco) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/NetworkConnectionToNewExternalLDAPServer.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let legacy_ldap = (
CommonSecurityLog
| where TimeGenerated between(lookback..starttime)
// Filter to LDAP connections only
| where ApplicationProtocol =~ "ldap"
// Check LDAP server is external
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
// Filter out events where network connection was blocked - change this to expand hunt
| where DeviceAction has_any ("allow", "accept", "allowed")
| summarize by DestinationIP);
CommonSecurityLog
| where TimeGenerated between(starttime..endtime)
| where ApplicationProtocol =~ "ldap"
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
| where DestinationIP !in (legacy_ldap)
| where DeviceAction has_any ("allow", "accept", "allowed")
| project-reorder TimeGenerated, SourceIP, DestinationIP, ApplicationProtocol, DestinationPort, SentBytes, ReceivedBytes, DeviceAction
| extend timestamp = TimeGenerated, IPCustomEntity = SourceIP

```

## Network Connection to New External LDAP Server

'This hunting query looks for outbound network connections using the LDAP protocol to external IP addresses, where that IP address has not had an LDAP network connection to it in the 14 days preceding the query timeframe. This could indicate someone exploiting a vulnerability such as CVE-2021-44228 to trigger the connection to a malicious LDAP server.
For more details on Apache Log4j Remote Code Execution Vulnerability - https://community.riskiq.com/article/505098fc/description
Find more details on collecting EXECVE data into Microsoft Sentinel - https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-threats-on-linux-with-azure-sentinel/ba-p/1344431'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | CiscoASA |
|DetectionId | bf094505-fd2e-484f-b72a-acd79ee00ce8 |
|DataTypes | CommonSecurityLog (Cisco) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/NetworkConnectionToNewExternalLDAPServer.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let legacy_ldap = (
CommonSecurityLog
| where TimeGenerated between(lookback..starttime)
// Filter to LDAP connections only
| where ApplicationProtocol =~ "ldap"
// Check LDAP server is external
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
// Filter out events where network connection was blocked - change this to expand hunt
| where DeviceAction has_any ("allow", "accept", "allowed")
| summarize by DestinationIP);
CommonSecurityLog
| where TimeGenerated between(starttime..endtime)
| where ApplicationProtocol =~ "ldap"
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
| where DestinationIP !in (legacy_ldap)
| where DeviceAction has_any ("allow", "accept", "allowed")
| project-reorder TimeGenerated, SourceIP, DestinationIP, ApplicationProtocol, DestinationPort, SentBytes, ReceivedBytes, DeviceAction
| extend timestamp = TimeGenerated, IPCustomEntity = SourceIP

```

## Network Connection to New External LDAP Server

'This hunting query looks for outbound network connections using the LDAP protocol to external IP addresses, where that IP address has not had an LDAP network connection to it in the 14 days preceding the query timeframe. This could indicate someone exploiting a vulnerability such as CVE-2021-44228 to trigger the connection to a malicious LDAP server.
For more details on Apache Log4j Remote Code Execution Vulnerability - https://community.riskiq.com/article/505098fc/description
Find more details on collecting EXECVE data into Microsoft Sentinel - https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-threats-on-linux-with-azure-sentinel/ba-p/1344431'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | CiscoASA |
|DetectionId | bf094505-fd2e-484f-b72a-acd79ee00ce8 |
|DataTypes | CommonSecurityLog (Cisco) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/NetworkConnectionToNewExternalLDAPServer.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let legacy_ldap = (
CommonSecurityLog
| where TimeGenerated between(lookback..starttime)
// Filter to LDAP connections only
| where ApplicationProtocol =~ "ldap"
// Check LDAP server is external
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
// Filter out events where network connection was blocked - change this to expand hunt
| where DeviceAction has_any ("allow", "accept", "allowed")
| summarize by DestinationIP);
CommonSecurityLog
| where TimeGenerated between(starttime..endtime)
| where ApplicationProtocol =~ "ldap"
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
| where DestinationIP !in (legacy_ldap)
| where DeviceAction has_any ("allow", "accept", "allowed")
| project-reorder TimeGenerated, SourceIP, DestinationIP, ApplicationProtocol, DestinationPort, SentBytes, ReceivedBytes, DeviceAction
| extend timestamp = TimeGenerated, IPCustomEntity = SourceIP

```

## Network Connection to New External LDAP Server

'This hunting query looks for outbound network connections using the LDAP protocol to external IP addresses, where that IP address has not had an LDAP network connection to it in the 14 days preceding the query timeframe. This could indicate someone exploiting a vulnerability such as CVE-2021-44228 to trigger the connection to a malicious LDAP server.
For more details on Apache Log4j Remote Code Execution Vulnerability - https://community.riskiq.com/article/505098fc/description
Find more details on collecting EXECVE data into Microsoft Sentinel - https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-threats-on-linux-with-azure-sentinel/ba-p/1344431'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | PaloAltoNetworks |
|DetectionId | bf094505-fd2e-484f-b72a-acd79ee00ce8 |
|DataTypes | CommonSecurityLog (PaloAlto) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/NetworkConnectionToNewExternalLDAPServer.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let legacy_ldap = (
CommonSecurityLog
| where TimeGenerated between(lookback..starttime)
// Filter to LDAP connections only
| where ApplicationProtocol =~ "ldap"
// Check LDAP server is external
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
// Filter out events where network connection was blocked - change this to expand hunt
| where DeviceAction has_any ("allow", "accept", "allowed")
| summarize by DestinationIP);
CommonSecurityLog
| where TimeGenerated between(starttime..endtime)
| where ApplicationProtocol =~ "ldap"
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
| where DestinationIP !in (legacy_ldap)
| where DeviceAction has_any ("allow", "accept", "allowed")
| project-reorder TimeGenerated, SourceIP, DestinationIP, ApplicationProtocol, DestinationPort, SentBytes, ReceivedBytes, DeviceAction
| extend timestamp = TimeGenerated, IPCustomEntity = SourceIP

```

## Network Connection to New External LDAP Server

'This hunting query looks for outbound network connections using the LDAP protocol to external IP addresses, where that IP address has not had an LDAP network connection to it in the 14 days preceding the query timeframe. This could indicate someone exploiting a vulnerability such as CVE-2021-44228 to trigger the connection to a malicious LDAP server.
For more details on Apache Log4j Remote Code Execution Vulnerability - https://community.riskiq.com/article/505098fc/description
Find more details on collecting EXECVE data into Microsoft Sentinel - https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-threats-on-linux-with-azure-sentinel/ba-p/1344431'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | PaloAltoNetworks |
|DetectionId | bf094505-fd2e-484f-b72a-acd79ee00ce8 |
|DataTypes | CommonSecurityLog (PaloAlto) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/NetworkConnectionToNewExternalLDAPServer.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let legacy_ldap = (
CommonSecurityLog
| where TimeGenerated between(lookback..starttime)
// Filter to LDAP connections only
| where ApplicationProtocol =~ "ldap"
// Check LDAP server is external
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
// Filter out events where network connection was blocked - change this to expand hunt
| where DeviceAction has_any ("allow", "accept", "allowed")
| summarize by DestinationIP);
CommonSecurityLog
| where TimeGenerated between(starttime..endtime)
| where ApplicationProtocol =~ "ldap"
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
| where DestinationIP !in (legacy_ldap)
| where DeviceAction has_any ("allow", "accept", "allowed")
| project-reorder TimeGenerated, SourceIP, DestinationIP, ApplicationProtocol, DestinationPort, SentBytes, ReceivedBytes, DeviceAction
| extend timestamp = TimeGenerated, IPCustomEntity = SourceIP

```

## Network Connection to New External LDAP Server

'This hunting query looks for outbound network connections using the LDAP protocol to external IP addresses, where that IP address has not had an LDAP network connection to it in the 14 days preceding the query timeframe. This could indicate someone exploiting a vulnerability such as CVE-2021-44228 to trigger the connection to a malicious LDAP server.
For more details on Apache Log4j Remote Code Execution Vulnerability - https://community.riskiq.com/article/505098fc/description
Find more details on collecting EXECVE data into Microsoft Sentinel - https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-threats-on-linux-with-azure-sentinel/ba-p/1344431'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Linux|
|DetectionType | Hunting |
|ConnectorId | PaloAltoNetworks |
|DetectionId | bf094505-fd2e-484f-b72a-acd79ee00ce8 |
|DataTypes | CommonSecurityLog (PaloAlto) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/CommonSecurityLog/NetworkConnectionToNewExternalLDAPServer.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let starttime = todatetime('{{StartTimeISO}}');
let endtime = todatetime('{{EndTimeISO}}');
let lookback = starttime - 14d;
let legacy_ldap = (
CommonSecurityLog
| where TimeGenerated between(lookback..starttime)
// Filter to LDAP connections only
| where ApplicationProtocol =~ "ldap"
// Check LDAP server is external
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
// Filter out events where network connection was blocked - change this to expand hunt
| where DeviceAction has_any ("allow", "accept", "allowed")
| summarize by DestinationIP);
CommonSecurityLog
| where TimeGenerated between(starttime..endtime)
| where ApplicationProtocol =~ "ldap"
| extend private =  ipv4_is_private(DestinationIP)
| where private == false
| where DestinationIP !in (legacy_ldap)
| where DeviceAction has_any ("allow", "accept", "allowed")
| project-reorder TimeGenerated, SourceIP, DestinationIP, ApplicationProtocol, DestinationPort, SentBytes, ReceivedBytes, DeviceAction
| extend timestamp = TimeGenerated, IPCustomEntity = SourceIP

```

## Storage File Seen on Endpoint

'Finds instances where a file uploaded to blob or file storage and it is seen on an endpoint by Microsoft 365 Defender.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1570|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | c7f03700-8bbe-4838-9e78-4852ef21609b |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AzureStorage/AzureStorageFileOnEndpoint.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

union StorageFileLogs,
StorageBlobLogs
//File upload operations
| where OperationName =~ "PutBlob" or OperationName =~ "PutRange"
//Parse out the uploader IP
| extend ClientIP = tostring(split(CallerIpAddress, ":", 0)[0])
//Extract the filename from the Uri
| extend FileName = extract(@"\/([\w\-. ]+)\?", 1, Uri)
//Base64 decode the MD5 filehash, we will encounter non-ascii hex so string operations don't work
//We can work around this by making it an array then converting it to hex from an int
| extend base64Char = base64_decode_toarray(ResponseMd5)
| mv-expand base64Char
| extend hexChar = tohex(toint(base64Char))
| extend hexChar = iff(strlen(hexChar) < 2, strcat("0", hexChar), hexChar)
| extend SourceTable = iff(OperationName has "range", "StorageFileLogs", "StorageBlobLogs")
| summarize make_list(hexChar) by CorrelationId, ResponseMd5, FileName, AccountName, TimeGenerated, RequestBodySize, ClientIP, SourceTable
| extend Md5Hash = strcat_array(list_hexChar, "")
| project-away list_hexChar, ResponseMd5
| join (
  DeviceFileEvents
  | where ActionType =~ "FileCreated"
  | where isnotempty(MD5)
  | extend p = pack("FileCreateTime", TimeGenerated, "Device", DeviceName, "DeviceId", DeviceId, "FileName", FileName, "InititatingProcess", InitiatingProcessFileName)
  | summarize make_bag(p), dcount(DeviceName) by MD5
) on $left.Md5Hash == $right.MD5
| project TimeGenerated, FileName, FileHashCustomEntity=Md5Hash, AccountName, SourceTable, DevicesImpacted=dcount_DeviceName, Entitites=bag_p

```

## Storage File Seen on Endpoint

'Finds instances where a file uploaded to blob or file storage and it is seen on an endpoint by Microsoft 365 Defender.'

|Name | Value |
| --- | --- |
|Tactic | LateralMovement|
|TechniqueId | T1570|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | c7f03700-8bbe-4838-9e78-4852ef21609b |
|DataTypes | DeviceFileEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AzureStorage/AzureStorageFileOnEndpoint.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

union StorageFileLogs,
StorageBlobLogs
//File upload operations
| where OperationName =~ "PutBlob" or OperationName =~ "PutRange"
//Parse out the uploader IP
| extend ClientIP = tostring(split(CallerIpAddress, ":", 0)[0])
//Extract the filename from the Uri
| extend FileName = extract(@"\/([\w\-. ]+)\?", 1, Uri)
//Base64 decode the MD5 filehash, we will encounter non-ascii hex so string operations don't work
//We can work around this by making it an array then converting it to hex from an int
| extend base64Char = base64_decode_toarray(ResponseMd5)
| mv-expand base64Char
| extend hexChar = tohex(toint(base64Char))
| extend hexChar = iff(strlen(hexChar) < 2, strcat("0", hexChar), hexChar)
| extend SourceTable = iff(OperationName has "range", "StorageFileLogs", "StorageBlobLogs")
| summarize make_list(hexChar) by CorrelationId, ResponseMd5, FileName, AccountName, TimeGenerated, RequestBodySize, ClientIP, SourceTable
| extend Md5Hash = strcat_array(list_hexChar, "")
| project-away list_hexChar, ResponseMd5
| join (
  DeviceFileEvents
  | where ActionType =~ "FileCreated"
  | where isnotempty(MD5)
  | extend p = pack("FileCreateTime", TimeGenerated, "Device", DeviceName, "DeviceId", DeviceId, "FileName", FileName, "InititatingProcess", InitiatingProcessFileName)
  | summarize make_bag(p), dcount(DeviceName) by MD5
) on $left.Md5Hash == $right.MD5
| project TimeGenerated, FileName, FileHashCustomEntity=Md5Hash, AccountName, SourceTable, DevicesImpacted=dcount_DeviceName, Entitites=bag_p

```

## User Account Linked to Storage Account File Upload

'This hunting query will try to identify the user account used to perform a file upload to blob storage.
This query can be used to match all file upload events, or filtering can be applied on filename to search for a specific upload.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1528|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | bee57113-7b9d-4158-958c-a7f3d534c6c4 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AzureStorage/AzureStorageUploadLinkAccount.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

//Period of time to look back in signin logs
let lookback = 1m;
let TargetFile = "mimikatz.exe"; //Example
union
StorageFileLogs,
StorageBlobLogs
//Collect file uploads
| where StatusText =~ "Success"
| where OperationName =~ "PutBlob" or OperationName =~ "PutRange"
| extend FileName = extract(@"\/([\w\-. ]+)\?", 1, Uri)
//Uncomment below to enable file specific matching
//| where FileName =~ TargetFile
//Caller IP has the port appended, remove it
| extend CallerIpAddress = tostring(split(CallerIpAddress, ":", 0)[0])
| extend FileUploadTime = TimeGenerated
| extend WindowStart = FileUploadTime - lookback
| join (
    SigninLogs
    | project AzureLoginTime=TimeGenerated, UserPrincipalName, IPAddress, LoginUserAgent=UserAgent
) on $left.CallerIpAddress == $right.IPAddress
//Look back in the signinlogs for the most recent login
| where AzureLoginTime between (WindowStart .. FileUploadTime)
| project AccountUsed=UserPrincipalName, AzureLoginTime, OperationName, FileUploadPath=Uri, CallerIpAddress, LoginUserAgent, UploadUserAgent=UserAgentHeader
//Optional user agent check
| where LoginUserAgent =~ UploadUserAgent
//Pack and summarise the matching login events by the upload event
| extend p = pack("AccountUsed", AccountUsed, "IPUsed", CallerIpAddress, "AzureLoginTime", AzureLoginTime, "UserAgent", LoginUserAgent)
| summarize LoginEvents=make_bag(p) by FileUploadPath, OperationName, UploadUserAgent

```

## User Account Linked to Storage Account File Upload

'This hunting query will try to identify the user account used to perform a file upload to blob storage.
This query can be used to match all file upload events, or filtering can be applied on filename to search for a specific upload.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1528|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | bee57113-7b9d-4158-958c-a7f3d534c6c4 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/AzureStorage/AzureStorageUploadLinkAccount.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

//Period of time to look back in signin logs
let lookback = 1m;
let TargetFile = "mimikatz.exe"; //Example
union
StorageFileLogs,
StorageBlobLogs
//Collect file uploads
| where StatusText =~ "Success"
| where OperationName =~ "PutBlob" or OperationName =~ "PutRange"
| extend FileName = extract(@"\/([\w\-. ]+)\?", 1, Uri)
//Uncomment below to enable file specific matching
//| where FileName =~ TargetFile
//Caller IP has the port appended, remove it
| extend CallerIpAddress = tostring(split(CallerIpAddress, ":", 0)[0])
| extend FileUploadTime = TimeGenerated
| extend WindowStart = FileUploadTime - lookback
| join (
    SigninLogs
    | project AzureLoginTime=TimeGenerated, UserPrincipalName, IPAddress, LoginUserAgent=UserAgent
) on $left.CallerIpAddress == $right.IPAddress
//Look back in the signinlogs for the most recent login
| where AzureLoginTime between (WindowStart .. FileUploadTime)
| project AccountUsed=UserPrincipalName, AzureLoginTime, OperationName, FileUploadPath=Uri, CallerIpAddress, LoginUserAgent, UploadUserAgent=UserAgentHeader
//Optional user agent check
| where LoginUserAgent =~ UploadUserAgent
//Pack and summarise the matching login events by the upload event
| extend p = pack("AccountUsed", AccountUsed, "IPUsed", CallerIpAddress, "AzureLoginTime", AzureLoginTime, "UserAgent", LoginUserAgent)
| summarize LoginEvents=make_bag(p) by FileUploadPath, OperationName, UploadUserAgent

```

## Download of New File Using Curl

'Threat actors may use tools such as Curl to download additional files, communicate with C2 infrastructure, or exfiltrate data. This query looks for new files being downloaded using Curl. Curl also has legitimate uses files and hosts should be reviewed to identify potentially malicious activity.
  Ref: https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 96066361-e101-4c8a-ad37-b0f58d75cd2b |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/DownloadofNewFileUsingCurl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let known_files = DeviceNetworkEvents
  | where TimeGenerated between (ago(7d)..ago(1d))
  | where InitiatingProcessFileName has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,InitiatingProcessCommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, InitiatingProcessCommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip)
  | union (SecurityEvent
  | where TimeGenerated between (ago(7d)..ago(1d))
  | where EventID == 4688
  | where CommandLine has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,CommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, CommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip))
  | summarize by remote_file;
  DeviceNetworkEvents
  | where TimeGenerated > ago(1d)
  | where InitiatingProcessFileName has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,InitiatingProcessCommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, InitiatingProcessCommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip)
  | union (SecurityEvent
  | where EventID == 4688
  | where CommandLine has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,CommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, CommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip))
  | where remote_file !in (known_files)

```

## Download of New File Using Curl

'Threat actors may use tools such as Curl to download additional files, communicate with C2 infrastructure, or exfiltrate data. This query looks for new files being downloaded using Curl. Curl also has legitimate uses files and hosts should be reviewed to identify potentially malicious activity.
  Ref: https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 96066361-e101-4c8a-ad37-b0f58d75cd2b |
|DataTypes | DeviceNetworkEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/DownloadofNewFileUsingCurl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let known_files = DeviceNetworkEvents
  | where TimeGenerated between (ago(7d)..ago(1d))
  | where InitiatingProcessFileName has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,InitiatingProcessCommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, InitiatingProcessCommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip)
  | union (SecurityEvent
  | where TimeGenerated between (ago(7d)..ago(1d))
  | where EventID == 4688
  | where CommandLine has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,CommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, CommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip))
  | summarize by remote_file;
  DeviceNetworkEvents
  | where TimeGenerated > ago(1d)
  | where InitiatingProcessFileName has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,InitiatingProcessCommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, InitiatingProcessCommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip)
  | union (SecurityEvent
  | where EventID == 4688
  | where CommandLine has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,CommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, CommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip))
  | where remote_file !in (known_files)

```

## Download of New File Using Curl

'Threat actors may use tools such as Curl to download additional files, communicate with C2 infrastructure, or exfiltrate data. This query looks for new files being downloaded using Curl. Curl also has legitimate uses files and hosts should be reviewed to identify potentially malicious activity.
  Ref: https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/'

|Name | Value |
| --- | --- |
|Tactic | CommandAndControl|
|TechniqueId | T1071|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 96066361-e101-4c8a-ad37-b0f58d75cd2b |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/DownloadofNewFileUsingCurl.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let known_files = DeviceNetworkEvents
  | where TimeGenerated between (ago(7d)..ago(1d))
  | where InitiatingProcessFileName has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,InitiatingProcessCommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, InitiatingProcessCommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip)
  | union (SecurityEvent
  | where TimeGenerated between (ago(7d)..ago(1d))
  | where EventID == 4688
  | where CommandLine has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,CommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, CommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip))
  | summarize by remote_file;
  DeviceNetworkEvents
  | where TimeGenerated > ago(1d)
  | where InitiatingProcessFileName has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,InitiatingProcessCommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, InitiatingProcessCommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip)
  | union (SecurityEvent
  | where EventID == 4688
  | where CommandLine has "curl"
  | extend url = extract("http[s]?:\\/\\/(?:[a-zA-Z]|[0-9]|[$-_@.&+]|[!*\\(\\),]|(?:%[0-9a-fA-F][0-9a-fA-F]))+", 0,CommandLine)
  | extend ip = extract("(\\b25[0-5]|\\b2[0-4][0-9]|\\b[01]?[0-9][0-9]?)(\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}[^ ]*", 0, CommandLine)
  | extend remote_file = iif(isnotempty(url), url, ip))
  | where remote_file !in (known_files)

```

## SQL Alert Correlation with CommonSecurityLogs and AuditLogs

'This query combines different SQL alerts with CommonSecurityLogs and AuditLogs helping analysts /investigate any possible SQL related attacks faster
 thus reducing Mean Time To Respond'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureSecurityCenter |
|DetectionId | dc5adcc9-70ab-4fba-8690-f57767e8ca02 |
|DataTypes | SecurityAlert (ASC) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/SQLAlertCorrelationwithCommonSecurityLogsandAuditLogs.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Potential SQL Injection', 'A possible vulnerability to SQL Injection')
| extend EntitiesDynamicArray = parse_json(Entities)
| mv-expand EntitiesDynamicArray
| extend EntityType = tostring(parse_json(EntitiesDynamicArray).Type), EntityAddress = tostring(EntitiesDynamicArray.Address)
| extend IpAddress = iif(EntityType == 'ip', EntityAddress, '')
| where isnotempty(IpAddress) 
| join kind=inner (
CommonSecurityLog 
| where DeviceVendor =~ "Palo Alto Networks" and Activity =~ "TRAFFIC" and DeviceAction != "deny"
| summarize count() by DeviceName, SourceIP, DestinationIP, DestinationPort, Protocol, SourcePort
)
on $left.IpAddress == $right.SourceIP
| join kind=inner (
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "RoleManagement"
| extend IpAddress = case(
isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.user)).ipAddress), 
isnotempty(tostring(parse_json(tostring(InitiatedBy.app)).ipAddress)) and tostring(parse_json(tostring(InitiatedBy.app)).ipAddress) != 'null', tostring(parse_json(tostring(InitiatedBy.app)).ipAddress),'Not Available')
| extend InitiatedBy = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName)), UserRoles = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
| extend TargetResourceName = tolower(tostring(TargetResources.[0].displayName))  
) on IpAddress
| summarize count () by TimeGenerated,IpAddress,UserRoles,SourcePort,DestinationPort,AccountCustomEntity=InitiatedBy

```
