# Rules: 5524-5544

## Exploit and Pentest Framework User Agent

'There are several exploit and pen test frameworks that are being used by pen testers as well as attackers to 
compromise an environment and achieve their objective. The query tries to detect suspicious user agent strings 
used by these frameworks in some of the data sources that contain UserAgent field. 
This is based out of sigma rules described in references.
References: https://github.com/Neo23x0/sigma/blob/master/rules/proxy/proxy_ua_frameworks.yml'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1189|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureMonitor(IIS) |
|DetectionId | df75ac6c-7b0b-40d2-82e4-191c012f1a07 |
|DataTypes | W3CIISLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/UseragentExploitPentest.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let UserAgentList = "Internet Explorer |Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1; SV1; InfoPath\\.2\\)|Mozilla/5\\.0 \\(Windows NT 10\\.0; Win32; x32; rv:60\\.0\\)|Mozilla/4\\.0 \\(compatible; Metasploit RSPEC\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.1; Windows NT\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1\\)|Mozilla/4\\.0 \\(compatible; MSIE 8\\.0; Windows NT 6\\.0; Trident/4\\.0\\)|Mozilla/4\\.0 \\(compatible; MSIE 7\\.0; Windows NT 6\\.0; Trident/4\\.0; SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E}; SLCC1; \\.N|Mozilla/5\\.0 \\(Windows; U; Windows NT 5\\.1; en-US\\) AppleWebKit/525\\.13 \\(KHTML, like Gecko\\) Chrome/4\\.0\\.221\\.6 Safari/525\\.13|Mozilla/5\\.0 \\(compatible; MSIE 9\\.0; Windows NT 6\\.1; WOW64; Trident/5\\.0; MAAU\\)|Mozilla/5\\.0[^\\s]|Mozilla/4\\.0 \\(compatible; SPIPE/1\\.0|Mozilla/5\\.0 \\(Windows NT 6\\.3; rv:39\\.0\\) Gecko/20100101 Firefox/35\\.0|Sametime Community Agent|X-FORWARDED-FOR|DotDotPwn v2\\.1|SIPDROID|wordpress hash grabber|exploit|okhttp/";
// Excluding for IIS, as the main malicious usage for okhttp that we have seen was in the OfficeActivity logs and this can create noise for IIS.
let ExcludeIIS = "okhttp/";
(union isfuzzy=true
(OfficeActivity
| where ExtendedProperties has "UserAgent"
| extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
| where UserAgent matches regex UserAgentList
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
W3CIISLog
| extend UserAgent = replace('\\+', ' ', csUserAgent) 
| where UserAgent matches regex UserAgentList
| where UserAgent !startswith ExcludeIIS
| extend SourceIP = cIP
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
AWSCloudTrail
| where UserAgent matches regex UserAgentList
| extend SourceIP = SourceIpAddress
| project TimeGenerated, Type, UserAgent, SourceIP
))
| summarize min(TimeGenerated), max(TimeGenerated), count() by Type, UserAgent, SourceIP
| extend timestamp = min_TimeGenerated, IPCustomEntity = SourceIP

```

## Exploit and Pentest Framework User Agent

'There are several exploit and pen test frameworks that are being used by pen testers as well as attackers to 
compromise an environment and achieve their objective. The query tries to detect suspicious user agent strings 
used by these frameworks in some of the data sources that contain UserAgent field. 
This is based out of sigma rules described in references.
References: https://github.com/Neo23x0/sigma/blob/master/rules/proxy/proxy_ua_frameworks.yml'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1071|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | df75ac6c-7b0b-40d2-82e4-191c012f1a07 |
|DataTypes | OfficeActivity |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/UseragentExploitPentest.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let UserAgentList = "Internet Explorer |Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1; SV1; InfoPath\\.2\\)|Mozilla/5\\.0 \\(Windows NT 10\\.0; Win32; x32; rv:60\\.0\\)|Mozilla/4\\.0 \\(compatible; Metasploit RSPEC\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.1; Windows NT\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1\\)|Mozilla/4\\.0 \\(compatible; MSIE 8\\.0; Windows NT 6\\.0; Trident/4\\.0\\)|Mozilla/4\\.0 \\(compatible; MSIE 7\\.0; Windows NT 6\\.0; Trident/4\\.0; SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E}; SLCC1; \\.N|Mozilla/5\\.0 \\(Windows; U; Windows NT 5\\.1; en-US\\) AppleWebKit/525\\.13 \\(KHTML, like Gecko\\) Chrome/4\\.0\\.221\\.6 Safari/525\\.13|Mozilla/5\\.0 \\(compatible; MSIE 9\\.0; Windows NT 6\\.1; WOW64; Trident/5\\.0; MAAU\\)|Mozilla/5\\.0[^\\s]|Mozilla/4\\.0 \\(compatible; SPIPE/1\\.0|Mozilla/5\\.0 \\(Windows NT 6\\.3; rv:39\\.0\\) Gecko/20100101 Firefox/35\\.0|Sametime Community Agent|X-FORWARDED-FOR|DotDotPwn v2\\.1|SIPDROID|wordpress hash grabber|exploit|okhttp/";
// Excluding for IIS, as the main malicious usage for okhttp that we have seen was in the OfficeActivity logs and this can create noise for IIS.
let ExcludeIIS = "okhttp/";
(union isfuzzy=true
(OfficeActivity
| where ExtendedProperties has "UserAgent"
| extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
| where UserAgent matches regex UserAgentList
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
W3CIISLog
| extend UserAgent = replace('\\+', ' ', csUserAgent) 
| where UserAgent matches regex UserAgentList
| where UserAgent !startswith ExcludeIIS
| extend SourceIP = cIP
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
AWSCloudTrail
| where UserAgent matches regex UserAgentList
| extend SourceIP = SourceIpAddress
| project TimeGenerated, Type, UserAgent, SourceIP
))
| summarize min(TimeGenerated), max(TimeGenerated), count() by Type, UserAgent, SourceIP
| extend timestamp = min_TimeGenerated, IPCustomEntity = SourceIP

```

## Exploit and Pentest Framework User Agent

'There are several exploit and pen test frameworks that are being used by pen testers as well as attackers to 
compromise an environment and achieve their objective. The query tries to detect suspicious user agent strings 
used by these frameworks in some of the data sources that contain UserAgent field. 
This is based out of sigma rules described in references.
References: https://github.com/Neo23x0/sigma/blob/master/rules/proxy/proxy_ua_frameworks.yml'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1071|
|Platform | AWS|
|DetectionType | Hunting |
|ConnectorId | AWS |
|DetectionId | df75ac6c-7b0b-40d2-82e4-191c012f1a07 |
|DataTypes | AWSCloudTrail |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/UseragentExploitPentest.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let UserAgentList = "Internet Explorer |Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1; SV1; InfoPath\\.2\\)|Mozilla/5\\.0 \\(Windows NT 10\\.0; Win32; x32; rv:60\\.0\\)|Mozilla/4\\.0 \\(compatible; Metasploit RSPEC\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.1; Windows NT\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1\\)|Mozilla/4\\.0 \\(compatible; MSIE 8\\.0; Windows NT 6\\.0; Trident/4\\.0\\)|Mozilla/4\\.0 \\(compatible; MSIE 7\\.0; Windows NT 6\\.0; Trident/4\\.0; SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E}; SLCC1; \\.N|Mozilla/5\\.0 \\(Windows; U; Windows NT 5\\.1; en-US\\) AppleWebKit/525\\.13 \\(KHTML, like Gecko\\) Chrome/4\\.0\\.221\\.6 Safari/525\\.13|Mozilla/5\\.0 \\(compatible; MSIE 9\\.0; Windows NT 6\\.1; WOW64; Trident/5\\.0; MAAU\\)|Mozilla/5\\.0[^\\s]|Mozilla/4\\.0 \\(compatible; SPIPE/1\\.0|Mozilla/5\\.0 \\(Windows NT 6\\.3; rv:39\\.0\\) Gecko/20100101 Firefox/35\\.0|Sametime Community Agent|X-FORWARDED-FOR|DotDotPwn v2\\.1|SIPDROID|wordpress hash grabber|exploit|okhttp/";
// Excluding for IIS, as the main malicious usage for okhttp that we have seen was in the OfficeActivity logs and this can create noise for IIS.
let ExcludeIIS = "okhttp/";
(union isfuzzy=true
(OfficeActivity
| where ExtendedProperties has "UserAgent"
| extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
| where UserAgent matches regex UserAgentList
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
W3CIISLog
| extend UserAgent = replace('\\+', ' ', csUserAgent) 
| where UserAgent matches regex UserAgentList
| where UserAgent !startswith ExcludeIIS
| extend SourceIP = cIP
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
AWSCloudTrail
| where UserAgent matches regex UserAgentList
| extend SourceIP = SourceIpAddress
| project TimeGenerated, Type, UserAgent, SourceIP
))
| summarize min(TimeGenerated), max(TimeGenerated), count() by Type, UserAgent, SourceIP
| extend timestamp = min_TimeGenerated, IPCustomEntity = SourceIP

```

## Exploit and Pentest Framework User Agent

'There are several exploit and pen test frameworks that are being used by pen testers as well as attackers to 
compromise an environment and achieve their objective. The query tries to detect suspicious user agent strings 
used by these frameworks in some of the data sources that contain UserAgent field. 
This is based out of sigma rules described in references.
References: https://github.com/Neo23x0/sigma/blob/master/rules/proxy/proxy_ua_frameworks.yml'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1071|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureMonitor(IIS) |
|DetectionId | df75ac6c-7b0b-40d2-82e4-191c012f1a07 |
|DataTypes | W3CIISLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/UseragentExploitPentest.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let UserAgentList = "Internet Explorer |Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1; SV1; InfoPath\\.2\\)|Mozilla/5\\.0 \\(Windows NT 10\\.0; Win32; x32; rv:60\\.0\\)|Mozilla/4\\.0 \\(compatible; Metasploit RSPEC\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.1; Windows NT\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1\\)|Mozilla/4\\.0 \\(compatible; MSIE 8\\.0; Windows NT 6\\.0; Trident/4\\.0\\)|Mozilla/4\\.0 \\(compatible; MSIE 7\\.0; Windows NT 6\\.0; Trident/4\\.0; SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E}; SLCC1; \\.N|Mozilla/5\\.0 \\(Windows; U; Windows NT 5\\.1; en-US\\) AppleWebKit/525\\.13 \\(KHTML, like Gecko\\) Chrome/4\\.0\\.221\\.6 Safari/525\\.13|Mozilla/5\\.0 \\(compatible; MSIE 9\\.0; Windows NT 6\\.1; WOW64; Trident/5\\.0; MAAU\\)|Mozilla/5\\.0[^\\s]|Mozilla/4\\.0 \\(compatible; SPIPE/1\\.0|Mozilla/5\\.0 \\(Windows NT 6\\.3; rv:39\\.0\\) Gecko/20100101 Firefox/35\\.0|Sametime Community Agent|X-FORWARDED-FOR|DotDotPwn v2\\.1|SIPDROID|wordpress hash grabber|exploit|okhttp/";
// Excluding for IIS, as the main malicious usage for okhttp that we have seen was in the OfficeActivity logs and this can create noise for IIS.
let ExcludeIIS = "okhttp/";
(union isfuzzy=true
(OfficeActivity
| where ExtendedProperties has "UserAgent"
| extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
| where UserAgent matches regex UserAgentList
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
W3CIISLog
| extend UserAgent = replace('\\+', ' ', csUserAgent) 
| where UserAgent matches regex UserAgentList
| where UserAgent !startswith ExcludeIIS
| extend SourceIP = cIP
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
AWSCloudTrail
| where UserAgent matches regex UserAgentList
| extend SourceIP = SourceIpAddress
| project TimeGenerated, Type, UserAgent, SourceIP
))
| summarize min(TimeGenerated), max(TimeGenerated), count() by Type, UserAgent, SourceIP
| extend timestamp = min_TimeGenerated, IPCustomEntity = SourceIP

```

## Exploit and Pentest Framework User Agent

'There are several exploit and pen test frameworks that are being used by pen testers as well as attackers to 
compromise an environment and achieve their objective. The query tries to detect suspicious user agent strings 
used by these frameworks in some of the data sources that contain UserAgent field. 
This is based out of sigma rules described in references.
References: https://github.com/Neo23x0/sigma/blob/master/rules/proxy/proxy_ua_frameworks.yml'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1203|
|Platform | Office 365|
|DetectionType | Hunting |
|ConnectorId | Office365 |
|DetectionId | df75ac6c-7b0b-40d2-82e4-191c012f1a07 |
|DataTypes | OfficeActivity |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/UseragentExploitPentest.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let UserAgentList = "Internet Explorer |Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1; SV1; InfoPath\\.2\\)|Mozilla/5\\.0 \\(Windows NT 10\\.0; Win32; x32; rv:60\\.0\\)|Mozilla/4\\.0 \\(compatible; Metasploit RSPEC\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.1; Windows NT\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1\\)|Mozilla/4\\.0 \\(compatible; MSIE 8\\.0; Windows NT 6\\.0; Trident/4\\.0\\)|Mozilla/4\\.0 \\(compatible; MSIE 7\\.0; Windows NT 6\\.0; Trident/4\\.0; SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E}; SLCC1; \\.N|Mozilla/5\\.0 \\(Windows; U; Windows NT 5\\.1; en-US\\) AppleWebKit/525\\.13 \\(KHTML, like Gecko\\) Chrome/4\\.0\\.221\\.6 Safari/525\\.13|Mozilla/5\\.0 \\(compatible; MSIE 9\\.0; Windows NT 6\\.1; WOW64; Trident/5\\.0; MAAU\\)|Mozilla/5\\.0[^\\s]|Mozilla/4\\.0 \\(compatible; SPIPE/1\\.0|Mozilla/5\\.0 \\(Windows NT 6\\.3; rv:39\\.0\\) Gecko/20100101 Firefox/35\\.0|Sametime Community Agent|X-FORWARDED-FOR|DotDotPwn v2\\.1|SIPDROID|wordpress hash grabber|exploit|okhttp/";
// Excluding for IIS, as the main malicious usage for okhttp that we have seen was in the OfficeActivity logs and this can create noise for IIS.
let ExcludeIIS = "okhttp/";
(union isfuzzy=true
(OfficeActivity
| where ExtendedProperties has "UserAgent"
| extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
| where UserAgent matches regex UserAgentList
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
W3CIISLog
| extend UserAgent = replace('\\+', ' ', csUserAgent) 
| where UserAgent matches regex UserAgentList
| where UserAgent !startswith ExcludeIIS
| extend SourceIP = cIP
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
AWSCloudTrail
| where UserAgent matches regex UserAgentList
| extend SourceIP = SourceIpAddress
| project TimeGenerated, Type, UserAgent, SourceIP
))
| summarize min(TimeGenerated), max(TimeGenerated), count() by Type, UserAgent, SourceIP
| extend timestamp = min_TimeGenerated, IPCustomEntity = SourceIP

```

## Exploit and Pentest Framework User Agent

'There are several exploit and pen test frameworks that are being used by pen testers as well as attackers to 
compromise an environment and achieve their objective. The query tries to detect suspicious user agent strings 
used by these frameworks in some of the data sources that contain UserAgent field. 
This is based out of sigma rules described in references.
References: https://github.com/Neo23x0/sigma/blob/master/rules/proxy/proxy_ua_frameworks.yml'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1203|
|Platform | AWS|
|DetectionType | Hunting |
|ConnectorId | AWS |
|DetectionId | df75ac6c-7b0b-40d2-82e4-191c012f1a07 |
|DataTypes | AWSCloudTrail |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/UseragentExploitPentest.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let UserAgentList = "Internet Explorer |Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1; SV1; InfoPath\\.2\\)|Mozilla/5\\.0 \\(Windows NT 10\\.0; Win32; x32; rv:60\\.0\\)|Mozilla/4\\.0 \\(compatible; Metasploit RSPEC\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.1; Windows NT\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1\\)|Mozilla/4\\.0 \\(compatible; MSIE 8\\.0; Windows NT 6\\.0; Trident/4\\.0\\)|Mozilla/4\\.0 \\(compatible; MSIE 7\\.0; Windows NT 6\\.0; Trident/4\\.0; SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E}; SLCC1; \\.N|Mozilla/5\\.0 \\(Windows; U; Windows NT 5\\.1; en-US\\) AppleWebKit/525\\.13 \\(KHTML, like Gecko\\) Chrome/4\\.0\\.221\\.6 Safari/525\\.13|Mozilla/5\\.0 \\(compatible; MSIE 9\\.0; Windows NT 6\\.1; WOW64; Trident/5\\.0; MAAU\\)|Mozilla/5\\.0[^\\s]|Mozilla/4\\.0 \\(compatible; SPIPE/1\\.0|Mozilla/5\\.0 \\(Windows NT 6\\.3; rv:39\\.0\\) Gecko/20100101 Firefox/35\\.0|Sametime Community Agent|X-FORWARDED-FOR|DotDotPwn v2\\.1|SIPDROID|wordpress hash grabber|exploit|okhttp/";
// Excluding for IIS, as the main malicious usage for okhttp that we have seen was in the OfficeActivity logs and this can create noise for IIS.
let ExcludeIIS = "okhttp/";
(union isfuzzy=true
(OfficeActivity
| where ExtendedProperties has "UserAgent"
| extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
| where UserAgent matches regex UserAgentList
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
W3CIISLog
| extend UserAgent = replace('\\+', ' ', csUserAgent) 
| where UserAgent matches regex UserAgentList
| where UserAgent !startswith ExcludeIIS
| extend SourceIP = cIP
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
AWSCloudTrail
| where UserAgent matches regex UserAgentList
| extend SourceIP = SourceIpAddress
| project TimeGenerated, Type, UserAgent, SourceIP
))
| summarize min(TimeGenerated), max(TimeGenerated), count() by Type, UserAgent, SourceIP
| extend timestamp = min_TimeGenerated, IPCustomEntity = SourceIP

```

## Exploit and Pentest Framework User Agent

'There are several exploit and pen test frameworks that are being used by pen testers as well as attackers to 
compromise an environment and achieve their objective. The query tries to detect suspicious user agent strings 
used by these frameworks in some of the data sources that contain UserAgent field. 
This is based out of sigma rules described in references.
References: https://github.com/Neo23x0/sigma/blob/master/rules/proxy/proxy_ua_frameworks.yml'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1203|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureMonitor(IIS) |
|DetectionId | df75ac6c-7b0b-40d2-82e4-191c012f1a07 |
|DataTypes | W3CIISLog |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/UseragentExploitPentest.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let UserAgentList = "Internet Explorer |Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1; SV1; InfoPath\\.2\\)|Mozilla/5\\.0 \\(Windows NT 10\\.0; Win32; x32; rv:60\\.0\\)|Mozilla/4\\.0 \\(compatible; Metasploit RSPEC\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.1; Windows NT\\)|Mozilla/4\\.0 \\(compatible; MSIE 6\\.0; Windows NT 5\\.1\\)|Mozilla/4\\.0 \\(compatible; MSIE 8\\.0; Windows NT 6\\.0; Trident/4\\.0\\)|Mozilla/4\\.0 \\(compatible; MSIE 7\\.0; Windows NT 6\\.0; Trident/4\\.0; SIMBAR={7DB0F6DE-8DE7-4841-9084-28FA914B0F2E}; SLCC1; \\.N|Mozilla/5\\.0 \\(Windows; U; Windows NT 5\\.1; en-US\\) AppleWebKit/525\\.13 \\(KHTML, like Gecko\\) Chrome/4\\.0\\.221\\.6 Safari/525\\.13|Mozilla/5\\.0 \\(compatible; MSIE 9\\.0; Windows NT 6\\.1; WOW64; Trident/5\\.0; MAAU\\)|Mozilla/5\\.0[^\\s]|Mozilla/4\\.0 \\(compatible; SPIPE/1\\.0|Mozilla/5\\.0 \\(Windows NT 6\\.3; rv:39\\.0\\) Gecko/20100101 Firefox/35\\.0|Sametime Community Agent|X-FORWARDED-FOR|DotDotPwn v2\\.1|SIPDROID|wordpress hash grabber|exploit|okhttp/";
// Excluding for IIS, as the main malicious usage for okhttp that we have seen was in the OfficeActivity logs and this can create noise for IIS.
let ExcludeIIS = "okhttp/";
(union isfuzzy=true
(OfficeActivity
| where ExtendedProperties has "UserAgent"
| extend UserAgent = extractjson("$[0].Value", ExtendedProperties, typeof(string))
| where UserAgent matches regex UserAgentList
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
W3CIISLog
| extend UserAgent = replace('\\+', ' ', csUserAgent) 
| where UserAgent matches regex UserAgentList
| where UserAgent !startswith ExcludeIIS
| extend SourceIP = cIP
| project TimeGenerated, Type, UserAgent, SourceIP
| extend IPCustomEntity = SourceIP
),
(
AWSCloudTrail
| where UserAgent matches regex UserAgentList
| extend SourceIP = SourceIpAddress
| project TimeGenerated, Type, UserAgent, SourceIP
))
| summarize min(TimeGenerated), max(TimeGenerated), count() by Type, UserAgent, SourceIP
| extend timestamp = min_TimeGenerated, IPCustomEntity = SourceIP

```

## Failed Login Attempt by Expired account

'This query looks at Account Logon events found through Windows Event Id's as well as SigninLogs to discover 
login attempts by accounts that have expired.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 562900b1-39c4-4baf-a050-9cad1641db35 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/LogonwithExpiredAccount.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

(union isfuzzy=true
(SecurityEvent 
| where EventID == 4625
//4625: An account failed to log on
| where AccountType == 'User' 
| where SubStatus == '0xc0000193' 
| extend Reason = 
case
( SubStatus == '0xc0000193', 'Windows EventID (4625) - Account has expired', "Unknown")
| project Computer, Account,  Reason , TimeGenerated
),
(
SecurityEvent 
| where EventID == 4769
//4769: A Kerberos service ticket was requested ( Kerberos Auth)
| parse EventData with * 'Status">' Status "<" *
| parse EventData with * 'TargetUserName">' TargetUserName "<" *
| where Status == '0x12'
| where TargetUserName !has "$" and isnotempty(TargetUserName)
| extend Reason = 
case(
Status == '0x12', 'Windows EventID (4769) - Account disabled, expired, locked out',
'Unknown'), Account = TargetUserName 
| project Computer, Account, Reason , TimeGenerated
),
(
SecurityEvent
| where EventID == 4776 
// 4776: The domain controller attempted to validate the credentials for an account ( NTLM Auth)
| where Status == "0xc0000193"
| extend Reason = 
case(
ErrorCode == '0xc0000193', 'Windows EventID (4776) - Account has expired',
'Unknown'), Account = TargetAccount 
| parse EventData with * 'Workstation">' Workstation "<" *
| extend Workstation = trim_start(@"[\\]*", Workstation)
| extend Computer = iff(isnotempty(Workstation), Workstation, Computer ) 
| project Computer, Account, Reason , TimeGenerated
) ,
(
SigninLogs 
| where ResultType == "50057" 
| extend Reason = 
case(
ResultType == '50057', 'SigninLogs( Result Code- 50057) - User account is disabled. The account has been disabled by an administrator.',
'Unknown'), Account = UserPrincipalName 
| project Computer, Account, Reason , TimeGenerated
) )
| summarize StartTimeUtc = min(TimeGenerated), EndTImeUtc = max(TimeGenerated), EventCount = count() by Computer, Account, Reason
| extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer
| order by EventCount desc 

```

## Failed Login Attempt by Expired account

'This query looks at Account Logon events found through Windows Event Id's as well as SigninLogs to discover 
login attempts by accounts that have expired.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 562900b1-39c4-4baf-a050-9cad1641db35 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/LogonwithExpiredAccount.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

(union isfuzzy=true
(SecurityEvent 
| where EventID == 4625
//4625: An account failed to log on
| where AccountType == 'User' 
| where SubStatus == '0xc0000193' 
| extend Reason = 
case
( SubStatus == '0xc0000193', 'Windows EventID (4625) - Account has expired', "Unknown")
| project Computer, Account,  Reason , TimeGenerated
),
(
SecurityEvent 
| where EventID == 4769
//4769: A Kerberos service ticket was requested ( Kerberos Auth)
| parse EventData with * 'Status">' Status "<" *
| parse EventData with * 'TargetUserName">' TargetUserName "<" *
| where Status == '0x12'
| where TargetUserName !has "$" and isnotempty(TargetUserName)
| extend Reason = 
case(
Status == '0x12', 'Windows EventID (4769) - Account disabled, expired, locked out',
'Unknown'), Account = TargetUserName 
| project Computer, Account, Reason , TimeGenerated
),
(
SecurityEvent
| where EventID == 4776 
// 4776: The domain controller attempted to validate the credentials for an account ( NTLM Auth)
| where Status == "0xc0000193"
| extend Reason = 
case(
ErrorCode == '0xc0000193', 'Windows EventID (4776) - Account has expired',
'Unknown'), Account = TargetAccount 
| parse EventData with * 'Workstation">' Workstation "<" *
| extend Workstation = trim_start(@"[\\]*", Workstation)
| extend Computer = iff(isnotempty(Workstation), Workstation, Computer ) 
| project Computer, Account, Reason , TimeGenerated
) ,
(
SigninLogs 
| where ResultType == "50057" 
| extend Reason = 
case(
ResultType == '50057', 'SigninLogs( Result Code- 50057) - User account is disabled. The account has been disabled by an administrator.',
'Unknown'), Account = UserPrincipalName 
| project Computer, Account, Reason , TimeGenerated
) )
| summarize StartTimeUtc = min(TimeGenerated), EndTImeUtc = max(TimeGenerated), EventCount = count() by Computer, Account, Reason
| extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer
| order by EventCount desc 

```

## Failed Login Attempt by Expired account

'This query looks at Account Logon events found through Windows Event Id's as well as SigninLogs to discover 
login attempts by accounts that have expired.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 562900b1-39c4-4baf-a050-9cad1641db35 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/LogonwithExpiredAccount.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

(union isfuzzy=true
(SecurityEvent 
| where EventID == 4625
//4625: An account failed to log on
| where AccountType == 'User' 
| where SubStatus == '0xc0000193' 
| extend Reason = 
case
( SubStatus == '0xc0000193', 'Windows EventID (4625) - Account has expired', "Unknown")
| project Computer, Account,  Reason , TimeGenerated
),
(
SecurityEvent 
| where EventID == 4769
//4769: A Kerberos service ticket was requested ( Kerberos Auth)
| parse EventData with * 'Status">' Status "<" *
| parse EventData with * 'TargetUserName">' TargetUserName "<" *
| where Status == '0x12'
| where TargetUserName !has "$" and isnotempty(TargetUserName)
| extend Reason = 
case(
Status == '0x12', 'Windows EventID (4769) - Account disabled, expired, locked out',
'Unknown'), Account = TargetUserName 
| project Computer, Account, Reason , TimeGenerated
),
(
SecurityEvent
| where EventID == 4776 
// 4776: The domain controller attempted to validate the credentials for an account ( NTLM Auth)
| where Status == "0xc0000193"
| extend Reason = 
case(
ErrorCode == '0xc0000193', 'Windows EventID (4776) - Account has expired',
'Unknown'), Account = TargetAccount 
| parse EventData with * 'Workstation">' Workstation "<" *
| extend Workstation = trim_start(@"[\\]*", Workstation)
| extend Computer = iff(isnotempty(Workstation), Workstation, Computer ) 
| project Computer, Account, Reason , TimeGenerated
) ,
(
SigninLogs 
| where ResultType == "50057" 
| extend Reason = 
case(
ResultType == '50057', 'SigninLogs( Result Code- 50057) - User account is disabled. The account has been disabled by an administrator.',
'Unknown'), Account = UserPrincipalName 
| project Computer, Account, Reason , TimeGenerated
) )
| summarize StartTimeUtc = min(TimeGenerated), EndTImeUtc = max(TimeGenerated), EventCount = count() by Computer, Account, Reason
| extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer
| order by EventCount desc 

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureSecurityCenter |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | SecurityAlert (ASC) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | SaaS|
|DetectionType | Hunting |
|ConnectorId | AzureSecurityCenter |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | SecurityAlert (ASC) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | WindowsSecurityEvents |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | WindowsForwardedEvents |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | WindowsEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureSecurityCenter |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | SecurityAlert (ASC) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | SaaS|
|DetectionType | Hunting |
|ConnectorId | AzureSecurityCenter |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | SecurityAlert (ASC) |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | SecurityEvents |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | SecurityEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | WindowsSecurityEvents |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```

## Recon Activity with Interactive Logon Correlation

'This query looks at correlating different reconnaissance alerts with interactive logon logs to help analysts investigate initial possible compromise activity'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | WindowsForwardedEvents |
|DetectionId | 346d36c9-2e79-4d8f-8c14-1eef73d38737 |
|DataTypes | WindowsEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/ReconActivitywithInteractiveLogonCorrelation.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityAlert
| where AlertName has_any ('Atypical travel','Unfamiliar sign-in properties','Anonymous IP address','Malware linked IP address','Malicious IP address','Password Spray','Targeted port scans')
| summarize count(),make_set(AlertName) by WorkspaceSubscriptionId,CompromisedEntity= toupper(CompromisedEntity),TimeGenerated
| extend number_alerts = array_length(set_AlertName)
| join kind=inner
(
SecurityEvent
| where EventID == 4624 and LogonType == 10
  | project  Account = tolower(Account), Computer = toupper(Computer), IpAddress, AccountType, Activity, LogonTypeName,Interactivelogontime=TimeGenerated
  ) on  $left.CompromisedEntity==$right.Computer
  | project TimeGenerated,Interactivelogontime,AccountCustomEntity=Account,AccountType,CompromisedEntity,Activity,IpAddress
  | extend TimeWindow = TimeGenerated + 15m
  | where Interactivelogontime between (TimeGenerated .. TimeWindow)

```
