# Rules: 85-105

## Modified domain federation trust settings

'This will alert when a user or application modifies the federation settings on the domain or Update domain authentication from Managed to Federated.
For example, this alert will trigger when a new Active Directory Federated Service (ADFS) TrustedRealm object, such as a signing certificate, is added to the domain.
Modification to domain federation settings should be rare. Confirm the added or modified target domain/URL is legitimate administrator behavior.
To understand why an authorized user may update settings for a federated domain in Office 365, Azure, or Intune, see: https://docs.microsoft.com/office365/troubleshoot/active-directory/update-federated-domain-office-365.
For details on security realms that accept security tokens, see the ADFS Proxy Protocol (MS-ADFSPP) specification: https://docs.microsoft.com/openspecs/windows_protocols/ms-adfspp/e7b9ea73-1980-4318-96a6-da559486664b.
For further information on AuditLogs please see https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | |
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 95dc4ae3-e0f2-48bd-b996-cdd22b90f9af |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/ADFSDomainTrustMods.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
(union isfuzzy=true
(
AuditLogs
| where OperationName =~ "Set federation settings on domain"
//| where Result =~ "success"   // commenting out, as it may be interesting to capture failed attempts
| mv-expand TargetResources
| extend modifiedProperties = parse_json(TargetResources).modifiedProperties
| mv-expand modifiedProperties
| extend targetDisplayName = tostring(parse_json(modifiedProperties).displayName)
| mv-expand AdditionalDetails
),
(
AuditLogs
| where OperationName =~ "Set domain authentication"
//| where Result =~ "success"   // commenting out, as it may be interesting to capture failed attempts
| mv-expand TargetResources
| extend modifiedProperties = parse_json(TargetResources).modifiedProperties
| mv-expand modifiedProperties
| extend targetDisplayName = tostring(parse_json(modifiedProperties).displayName), NewDomainValue=tostring(parse_json(modifiedProperties).newValue)
| where NewDomainValue has "Federated"
)
)
| extend UserAgent = iff(AdditionalDetails.key == "User-Agent",tostring(AdditionalDetails.value),"")
| extend InitiatingUserOrApp = iff(isnotempty(InitiatedBy.user.userPrincipalName),tostring(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.app.displayName))
| extend InitiatingIpAddress = iff(isnotempty(InitiatedBy.user.ipAddress), tostring(InitiatedBy.user.ipAddress), tostring(InitiatedBy.app.ipAddress))
| project-reorder TimeGenerated, OperationName, InitiatingUserOrApp, AADOperationType, targetDisplayName, Result, InitiatingIpAddress, UserAgent, CorrelationId, TenantId, AADTenantId
| extend timestamp = TimeGenerated, AccountCustomEntity = InitiatingUserOrApp, IPCustomEntity = InitiatingIpAddress

```

## Azure AD Role Management Permission Grant

'Identifies when the Microsoft Graph RoleManagement.ReadWrite.Directory (Delegated or Application) permission is granted to a service principal.
This permission allows an application to read and manage the role-based access control (RBAC) settings for your company's directory.
An adversary could use this permission to add an Azure AD object to an Admin directory role and escalate privileges.
Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions
Ref : https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098.003|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 1ff56009-db01-4615-8211-d4fda21da02d |
|DataTypes | AuditLogs |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/AzureADRoleManagementPermissionGrant.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "ApplicationManagement"
| where AADOperationType =~ "Assign"
| where ActivityDisplayName has_any ("Add delegated permission grant","Add app role assignment to service principal")
| mv-expand TargetResources
| mv-expand TargetResources.modifiedProperties
| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
| where displayName_ has_any ("AppRole.Value","DelegatedPermissionGrant.Scope")
| extend Permission = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
| where Permission has "RoleManagement.ReadWrite.Directory"
| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target = tostring(parse_json(tostring(TargetResources.modifiedProperties[4].newValue)))
| extend TargetId = iif(displayName_ =~ 'DelegatedPermissionGrant.Scope',
  tostring(parse_json(tostring(TargetResources.modifiedProperties[2].newValue))),
  tostring(parse_json(tostring(TargetResources.modifiedProperties[3].newValue))))
| summarize by bin(TimeGenerated, 1h), OperationName, Initiator, Target, TargetId, Result

```

## Azure AD Role Management Permission Grant

'Identifies when the Microsoft Graph RoleManagement.ReadWrite.Directory (Delegated or Application) permission is granted to a service principal.
This permission allows an application to read and manage the role-based access control (RBAC) settings for your company's directory.
An adversary could use this permission to add an Azure AD object to an Admin directory role and escalate privileges.
Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions
Ref : https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098.003|
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 1ff56009-db01-4615-8211-d4fda21da02d |
|DataTypes | AuditLogs |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/AzureADRoleManagementPermissionGrant.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "ApplicationManagement"
| where AADOperationType =~ "Assign"
| where ActivityDisplayName has_any ("Add delegated permission grant","Add app role assignment to service principal")
| mv-expand TargetResources
| mv-expand TargetResources.modifiedProperties
| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
| where displayName_ has_any ("AppRole.Value","DelegatedPermissionGrant.Scope")
| extend Permission = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
| where Permission has "RoleManagement.ReadWrite.Directory"
| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target = tostring(parse_json(tostring(TargetResources.modifiedProperties[4].newValue)))
| extend TargetId = iif(displayName_ =~ 'DelegatedPermissionGrant.Scope',
  tostring(parse_json(tostring(TargetResources.modifiedProperties[2].newValue))),
  tostring(parse_json(tostring(TargetResources.modifiedProperties[3].newValue))))
| summarize by bin(TimeGenerated, 1h), OperationName, Initiator, Target, TargetId, Result

```

## Azure AD Role Management Permission Grant

'Identifies when the Microsoft Graph RoleManagement.ReadWrite.Directory (Delegated or Application) permission is granted to a service principal.
This permission allows an application to read and manage the role-based access control (RBAC) settings for your company's directory.
An adversary could use this permission to add an Azure AD object to an Admin directory role and escalate privileges.
Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions
Ref : https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1078.004|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 1ff56009-db01-4615-8211-d4fda21da02d |
|DataTypes | AuditLogs |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/AzureADRoleManagementPermissionGrant.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "ApplicationManagement"
| where AADOperationType =~ "Assign"
| where ActivityDisplayName has_any ("Add delegated permission grant","Add app role assignment to service principal")
| mv-expand TargetResources
| mv-expand TargetResources.modifiedProperties
| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
| where displayName_ has_any ("AppRole.Value","DelegatedPermissionGrant.Scope")
| extend Permission = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
| where Permission has "RoleManagement.ReadWrite.Directory"
| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target = tostring(parse_json(tostring(TargetResources.modifiedProperties[4].newValue)))
| extend TargetId = iif(displayName_ =~ 'DelegatedPermissionGrant.Scope',
  tostring(parse_json(tostring(TargetResources.modifiedProperties[2].newValue))),
  tostring(parse_json(tostring(TargetResources.modifiedProperties[3].newValue))))
| summarize by bin(TimeGenerated, 1h), OperationName, Initiator, Target, TargetId, Result

```

## Azure AD Role Management Permission Grant

'Identifies when the Microsoft Graph RoleManagement.ReadWrite.Directory (Delegated or Application) permission is granted to a service principal.
This permission allows an application to read and manage the role-based access control (RBAC) settings for your company's directory.
An adversary could use this permission to add an Azure AD object to an Admin directory role and escalate privileges.
Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions
Ref : https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1078.004|
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 1ff56009-db01-4615-8211-d4fda21da02d |
|DataTypes | AuditLogs |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/AzureADRoleManagementPermissionGrant.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "ApplicationManagement"
| where AADOperationType =~ "Assign"
| where ActivityDisplayName has_any ("Add delegated permission grant","Add app role assignment to service principal")
| mv-expand TargetResources
| mv-expand TargetResources.modifiedProperties
| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
| where displayName_ has_any ("AppRole.Value","DelegatedPermissionGrant.Scope")
| extend Permission = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
| where Permission has "RoleManagement.ReadWrite.Directory"
| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target = tostring(parse_json(tostring(TargetResources.modifiedProperties[4].newValue)))
| extend TargetId = iif(displayName_ =~ 'DelegatedPermissionGrant.Scope',
  tostring(parse_json(tostring(TargetResources.modifiedProperties[2].newValue))),
  tostring(parse_json(tostring(TargetResources.modifiedProperties[3].newValue))))
| summarize by bin(TimeGenerated, 1h), OperationName, Initiator, Target, TargetId, Result

```

## Azure AD Role Management Permission Grant

'Identifies when the Microsoft Graph RoleManagement.ReadWrite.Directory (Delegated or Application) permission is granted to a service principal.
This permission allows an application to read and manage the role-based access control (RBAC) settings for your company's directory.
An adversary could use this permission to add an Azure AD object to an Admin directory role and escalate privileges.
Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions
Ref : https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1098.003|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 1ff56009-db01-4615-8211-d4fda21da02d |
|DataTypes | AuditLogs |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/AzureADRoleManagementPermissionGrant.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "ApplicationManagement"
| where AADOperationType =~ "Assign"
| where ActivityDisplayName has_any ("Add delegated permission grant","Add app role assignment to service principal")
| mv-expand TargetResources
| mv-expand TargetResources.modifiedProperties
| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
| where displayName_ has_any ("AppRole.Value","DelegatedPermissionGrant.Scope")
| extend Permission = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
| where Permission has "RoleManagement.ReadWrite.Directory"
| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target = tostring(parse_json(tostring(TargetResources.modifiedProperties[4].newValue)))
| extend TargetId = iif(displayName_ =~ 'DelegatedPermissionGrant.Scope',
  tostring(parse_json(tostring(TargetResources.modifiedProperties[2].newValue))),
  tostring(parse_json(tostring(TargetResources.modifiedProperties[3].newValue))))
| summarize by bin(TimeGenerated, 1h), OperationName, Initiator, Target, TargetId, Result

```

## Azure AD Role Management Permission Grant

'Identifies when the Microsoft Graph RoleManagement.ReadWrite.Directory (Delegated or Application) permission is granted to a service principal.
This permission allows an application to read and manage the role-based access control (RBAC) settings for your company's directory.
An adversary could use this permission to add an Azure AD object to an Admin directory role and escalate privileges.
Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions
Ref : https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1098.003|
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 1ff56009-db01-4615-8211-d4fda21da02d |
|DataTypes | AuditLogs |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/AzureADRoleManagementPermissionGrant.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "ApplicationManagement"
| where AADOperationType =~ "Assign"
| where ActivityDisplayName has_any ("Add delegated permission grant","Add app role assignment to service principal")
| mv-expand TargetResources
| mv-expand TargetResources.modifiedProperties
| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
| where displayName_ has_any ("AppRole.Value","DelegatedPermissionGrant.Scope")
| extend Permission = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
| where Permission has "RoleManagement.ReadWrite.Directory"
| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target = tostring(parse_json(tostring(TargetResources.modifiedProperties[4].newValue)))
| extend TargetId = iif(displayName_ =~ 'DelegatedPermissionGrant.Scope',
  tostring(parse_json(tostring(TargetResources.modifiedProperties[2].newValue))),
  tostring(parse_json(tostring(TargetResources.modifiedProperties[3].newValue))))
| summarize by bin(TimeGenerated, 1h), OperationName, Initiator, Target, TargetId, Result

```

## Azure AD Role Management Permission Grant

'Identifies when the Microsoft Graph RoleManagement.ReadWrite.Directory (Delegated or Application) permission is granted to a service principal.
This permission allows an application to read and manage the role-based access control (RBAC) settings for your company's directory.
An adversary could use this permission to add an Azure AD object to an Admin directory role and escalate privileges.
Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions
Ref : https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1078.004|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 1ff56009-db01-4615-8211-d4fda21da02d |
|DataTypes | AuditLogs |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/AzureADRoleManagementPermissionGrant.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "ApplicationManagement"
| where AADOperationType =~ "Assign"
| where ActivityDisplayName has_any ("Add delegated permission grant","Add app role assignment to service principal")
| mv-expand TargetResources
| mv-expand TargetResources.modifiedProperties
| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
| where displayName_ has_any ("AppRole.Value","DelegatedPermissionGrant.Scope")
| extend Permission = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
| where Permission has "RoleManagement.ReadWrite.Directory"
| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target = tostring(parse_json(tostring(TargetResources.modifiedProperties[4].newValue)))
| extend TargetId = iif(displayName_ =~ 'DelegatedPermissionGrant.Scope',
  tostring(parse_json(tostring(TargetResources.modifiedProperties[2].newValue))),
  tostring(parse_json(tostring(TargetResources.modifiedProperties[3].newValue))))
| summarize by bin(TimeGenerated, 1h), OperationName, Initiator, Target, TargetId, Result

```

## Azure AD Role Management Permission Grant

'Identifies when the Microsoft Graph RoleManagement.ReadWrite.Directory (Delegated or Application) permission is granted to a service principal.
This permission allows an application to read and manage the role-based access control (RBAC) settings for your company's directory.
An adversary could use this permission to add an Azure AD object to an Admin directory role and escalate privileges.
Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions
Ref : https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1078.004|
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 1ff56009-db01-4615-8211-d4fda21da02d |
|DataTypes | AuditLogs |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/AzureADRoleManagementPermissionGrant.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "ApplicationManagement"
| where AADOperationType =~ "Assign"
| where ActivityDisplayName has_any ("Add delegated permission grant","Add app role assignment to service principal")
| mv-expand TargetResources
| mv-expand TargetResources.modifiedProperties
| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
| where displayName_ has_any ("AppRole.Value","DelegatedPermissionGrant.Scope")
| extend Permission = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
| where Permission has "RoleManagement.ReadWrite.Directory"
| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target = tostring(parse_json(tostring(TargetResources.modifiedProperties[4].newValue)))
| extend TargetId = iif(displayName_ =~ 'DelegatedPermissionGrant.Scope',
  tostring(parse_json(tostring(TargetResources.modifiedProperties[2].newValue))),
  tostring(parse_json(tostring(TargetResources.modifiedProperties[3].newValue))))
| summarize by bin(TimeGenerated, 1h), OperationName, Initiator, Target, TargetId, Result

```

## Service Principal Assigned App Role With Sensitive Access

'Detects a Service Principal being assigned an app role that has sensitive access such as Mail.Read.
  A threat actor who compromises a Service Principal may assign it an app role to allow it to access sensitive data, or to perform other actions.
  Ensure that any assignment to a Service Principal is valid and appropriate.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-applications#application-granted-highly-privileged-permissions'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078.004|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | dd78a122-d377-415a-afe9-f22e08d2112c |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/ServicePrincipalAssignedAppRoleWithSensitiveAccess.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Add other permissions to this list as needed
  let permissions = dynamic(["Mail.Read", "offline_access", "Files.Read", "Notes.Read", "ChannelMessage.Read", "Chat.Read", "TeamsActivity.Read",
  "Group.Read", "EWS.AccessAsUser.All", "EAS.AccessAsUser.All"]);
  AuditLogs
  | where OperationName =~ "Add app role assignment to service principal"
  | mv-expand TargetResources[0].modifiedProperties
  | extend TargetResources_0_modifiedProperties = columnifexists("TargetResources_0_modifiedProperties", '')
  | where isnotempty(TargetResources_0_modifiedProperties)
  | where TargetResources_0_modifiedProperties.displayName =~ "AppRole.Value" or TargetResources_0_modifiedProperties.displayName =~ "DelegatedPermissionGrant.Scope"
  | extend Permissions = split((parse_json(tostring(TargetResources_0_modifiedProperties.newValue))), " ")
  | where Permissions has_any (permissions)
  | summarize AddedPermissions=make_set(Permissions) by CorrelationId
  | join kind=inner (AuditLogs
  | where OperationName =~ "Add app role assignment to service principal") on CorrelationId
  | extend InitiatedBy = tostring(iff(isnotempty(InitiatedBy.user.userPrincipalName),InitiatedBy.user.userPrincipalName, InitiatedBy.app.displayName))
  | extend ServicePrincipal = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[4].newValue)))
  | extend SPID = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[6].newValue)))
  | extend InitiatedBy = pack("User", InitiatedBy, "UA", UserAgent, "IPAddress", IpAddress)
  | mv-expand kind=array AddedPermissions
  | summarize FirstSeen = min(TimeGenerated), LastSeen = max(TimeGenerated), make_set(InitiatedBy), make_set(AddedPermissions) by SPID, ServicePrincipal

```

## Service Principal Assigned App Role With Sensitive Access

'Detects a Service Principal being assigned an app role that has sensitive access such as Mail.Read.
  A threat actor who compromises a Service Principal may assign it an app role to allow it to access sensitive data, or to perform other actions.
  Ensure that any assignment to a Service Principal is valid and appropriate.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-applications#application-granted-highly-privileged-permissions'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078.004|
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | dd78a122-d377-415a-afe9-f22e08d2112c |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/ServicePrincipalAssignedAppRoleWithSensitiveAccess.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Add other permissions to this list as needed
  let permissions = dynamic(["Mail.Read", "offline_access", "Files.Read", "Notes.Read", "ChannelMessage.Read", "Chat.Read", "TeamsActivity.Read",
  "Group.Read", "EWS.AccessAsUser.All", "EAS.AccessAsUser.All"]);
  AuditLogs
  | where OperationName =~ "Add app role assignment to service principal"
  | mv-expand TargetResources[0].modifiedProperties
  | extend TargetResources_0_modifiedProperties = columnifexists("TargetResources_0_modifiedProperties", '')
  | where isnotempty(TargetResources_0_modifiedProperties)
  | where TargetResources_0_modifiedProperties.displayName =~ "AppRole.Value" or TargetResources_0_modifiedProperties.displayName =~ "DelegatedPermissionGrant.Scope"
  | extend Permissions = split((parse_json(tostring(TargetResources_0_modifiedProperties.newValue))), " ")
  | where Permissions has_any (permissions)
  | summarize AddedPermissions=make_set(Permissions) by CorrelationId
  | join kind=inner (AuditLogs
  | where OperationName =~ "Add app role assignment to service principal") on CorrelationId
  | extend InitiatedBy = tostring(iff(isnotempty(InitiatedBy.user.userPrincipalName),InitiatedBy.user.userPrincipalName, InitiatedBy.app.displayName))
  | extend ServicePrincipal = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[4].newValue)))
  | extend SPID = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[6].newValue)))
  | extend InitiatedBy = pack("User", InitiatedBy, "UA", UserAgent, "IPAddress", IpAddress)
  | mv-expand kind=array AddedPermissions
  | summarize FirstSeen = min(TimeGenerated), LastSeen = max(TimeGenerated), make_set(InitiatedBy), make_set(AddedPermissions) by SPID, ServicePrincipal

```

## Application ID URI Changed

'Detects changes to an Application ID URI.
  Monitor these changes to make sure that they were authorized.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-applications#appid-uri-added-modified-or-removed'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1078.004|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 9fb2ee72-959f-4c2b-bc38-483affc539e4 |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/ApplicationIDURIChanged.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
  | where Category == "ApplicationManagement"
  | where OperationName has_any ("Update Application", "Update Service principal")
  | extend appName = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
  | extend UPN = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | extend UpdatedBy = iif(isnotempty(appName), appName, UPN)
  | extend mod_props = TargetResources[0].modifiedProperties
  | extend AppName = tostring(TargetResources[0].displayName)
  | mv-expand mod_props
  | where mod_props.displayName has "AppIdentifierUri"
  | extend OldURI = tostring(mod_props.oldValue)
  | extend NewURI = tostring(mod_props.newValue)
  | project-reorder TimeGenerated, OperationName, AppName, OldURI, NewURI, UpdatedBy

```

## Application ID URI Changed

'Detects changes to an Application ID URI.
  Monitor these changes to make sure that they were authorized.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-applications#appid-uri-added-modified-or-removed'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1078.004|
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 9fb2ee72-959f-4c2b-bc38-483affc539e4 |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/ApplicationIDURIChanged.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
  | where Category == "ApplicationManagement"
  | where OperationName has_any ("Update Application", "Update Service principal")
  | extend appName = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
  | extend UPN = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | extend UpdatedBy = iif(isnotempty(appName), appName, UPN)
  | extend mod_props = TargetResources[0].modifiedProperties
  | extend AppName = tostring(TargetResources[0].displayName)
  | mv-expand mod_props
  | where mod_props.displayName has "AppIdentifierUri"
  | extend OldURI = tostring(mod_props.oldValue)
  | extend NewURI = tostring(mod_props.newValue)
  | project-reorder TimeGenerated, OperationName, AppName, OldURI, NewURI, UpdatedBy

```

## Application ID URI Changed

'Detects changes to an Application ID URI.
  Monitor these changes to make sure that they were authorized.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-applications#appid-uri-added-modified-or-removed'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078.004|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 9fb2ee72-959f-4c2b-bc38-483affc539e4 |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/ApplicationIDURIChanged.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
  | where Category == "ApplicationManagement"
  | where OperationName has_any ("Update Application", "Update Service principal")
  | extend appName = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
  | extend UPN = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | extend UpdatedBy = iif(isnotempty(appName), appName, UPN)
  | extend mod_props = TargetResources[0].modifiedProperties
  | extend AppName = tostring(TargetResources[0].displayName)
  | mv-expand mod_props
  | where mod_props.displayName has "AppIdentifierUri"
  | extend OldURI = tostring(mod_props.oldValue)
  | extend NewURI = tostring(mod_props.newValue)
  | project-reorder TimeGenerated, OperationName, AppName, OldURI, NewURI, UpdatedBy

```

## Application ID URI Changed

'Detects changes to an Application ID URI.
  Monitor these changes to make sure that they were authorized.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-applications#appid-uri-added-modified-or-removed'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078.004|
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 9fb2ee72-959f-4c2b-bc38-483affc539e4 |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/ApplicationIDURIChanged.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
  | where Category == "ApplicationManagement"
  | where OperationName has_any ("Update Application", "Update Service principal")
  | extend appName = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
  | extend UPN = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | extend UpdatedBy = iif(isnotempty(appName), appName, UPN)
  | extend mod_props = TargetResources[0].modifiedProperties
  | extend AppName = tostring(TargetResources[0].displayName)
  | mv-expand mod_props
  | where mod_props.displayName has "AppIdentifierUri"
  | extend OldURI = tostring(mod_props.oldValue)
  | extend NewURI = tostring(mod_props.newValue)
  | project-reorder TimeGenerated, OperationName, AppName, OldURI, NewURI, UpdatedBy

```

## User Account Created Using Incorrect Naming Format

'This query looks for accounts being created where the name does not match a defined pattern.
  Attackers may attempt to add accounts as a means of establishing persistant access to an environment, looking for anomalies in created accounts may help identify illegitimately created accounts.
  Created accounts should be investigated to ensure they were legitimated created.
  The user_regex field in the query needs to be populated with the expected pattern for the environment before deployment.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#accounts-not-following-naming-policies'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1136.003|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | ee55dc85-d2da-48c1-a6c0-3eaee62a8d56 |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/UserAccountCreatedUsingIncorrectNamingFormat.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Add the environments expected username format regex below before deploying
  let user_regex = "";
  AuditLogs
  | where OperationName =~ "Add user"
  | where Result =~ "success"
  | extend userAgent = tostring(AdditionalDetails[0].value)
  | extend addingUser = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | extend addingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
  | extend AddedBy = iif(isnotempty(addingUser), addingUser, addingApp)
  | extend ipAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
  | extend AddedUser = tostring(TargetResources[0].userPrincipalName)
  | where AddedUser matches regex user_regex

```

## User Account Created Using Incorrect Naming Format

'This query looks for accounts being created where the name does not match a defined pattern.
  Attackers may attempt to add accounts as a means of establishing persistant access to an environment, looking for anomalies in created accounts may help identify illegitimately created accounts.
  Created accounts should be investigated to ensure they were legitimated created.
  The user_regex field in the query needs to be populated with the expected pattern for the environment before deployment.
  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-user-accounts#accounts-not-following-naming-policies'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1136.003|
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | ee55dc85-d2da-48c1-a6c0-3eaee62a8d56 |
|DataTypes | AuditLogs |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/UserAccountCreatedUsingIncorrectNamingFormat.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
// Add the environments expected username format regex below before deploying
  let user_regex = "";
  AuditLogs
  | where OperationName =~ "Add user"
  | where Result =~ "success"
  | extend userAgent = tostring(AdditionalDetails[0].value)
  | extend addingUser = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
  | extend addingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
  | extend AddedBy = iif(isnotempty(addingUser), addingUser, addingApp)
  | extend ipAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress)
  | extend AddedUser = tostring(TargetResources[0].userPrincipalName)
  | where AddedUser matches regex user_regex

```

## NRT Modified domain federation trust settings

'This will alert when a user or application modifies the federation settings on the domain or Update domain authentication from Managed to Federated.
For example, this alert will trigger when a new Active Directory Federated Service (ADFS) TrustedRealm object, such as a signing certificate, is added to the domain.
Modification to domain federation settings should be rare. Confirm the added or modified target domain/URL is legitimate administrator behavior.
To understand why an authorized user may update settings for a federated domain in Office 365, Azure, or Intune, see: https://docs.microsoft.com/office365/troubleshoot/active-directory/update-federated-domain-office-365.
For details on security realms that accept security tokens, see the ADFS Proxy Protocol (MS-ADFSPP) specification: https://docs.microsoft.com/openspecs/windows_protocols/ms-adfspp/e7b9ea73-1980-4318-96a6-da559486664b.
For further information on AuditLogs please see https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | |
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 8540c842-5bbc-4a24-9fb2-a836c0e55a51 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/NRT_ADFSDomainTrustMods.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where OperationName =~ "Set federation settings on domain" or OperationName =~ "Set domain authentication"
//| where Result =~ "success"   // commenting out, as it may be interesting to capture failed attempts
| mv-expand TargetResources
| extend modifiedProperties = parse_json(TargetResources).modifiedProperties
| mv-expand modifiedProperties
| extend targetDisplayName = tostring(parse_json(modifiedProperties).displayName), NewDomainValue=tostring(parse_json(modifiedProperties).newValue)
| extend Federated = iif(OperationName =~ "Set domain authentication", iif(NewDomainValue has "Federated", True, False), True)
| where Federated == True
| mv-expand AdditionalDetails
| extend UserAgent = iff(AdditionalDetails.key == "User-Agent",tostring(AdditionalDetails.value),"")
| extend InitiatingUserOrApp = iff(isnotempty(InitiatedBy.user.userPrincipalName),tostring(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.app.displayName))
| extend InitiatingIpAddress = iff(isnotempty(InitiatedBy.user.ipAddress), tostring(InitiatedBy.user.ipAddress), tostring(InitiatedBy.app.ipAddress))
| project-reorder TimeGenerated, OperationName, InitiatingUserOrApp, AADOperationType, targetDisplayName, Result, InitiatingIpAddress, UserAgent, CorrelationId, TenantId, AADTenantId

```

## NRT Modified domain federation trust settings

'This will alert when a user or application modifies the federation settings on the domain or Update domain authentication from Managed to Federated.
For example, this alert will trigger when a new Active Directory Federated Service (ADFS) TrustedRealm object, such as a signing certificate, is added to the domain.
Modification to domain federation settings should be rare. Confirm the added or modified target domain/URL is legitimate administrator behavior.
To understand why an authorized user may update settings for a federated domain in Office 365, Azure, or Intune, see: https://docs.microsoft.com/office365/troubleshoot/active-directory/update-federated-domain-office-365.
For details on security realms that accept security tokens, see the ADFS Proxy Protocol (MS-ADFSPP) specification: https://docs.microsoft.com/openspecs/windows_protocols/ms-adfspp/e7b9ea73-1980-4318-96a6-da559486664b.
For further information on AuditLogs please see https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-audit-activities.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | |
|Platform | Azure AD|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 8540c842-5bbc-4a24-9fb2-a836c0e55a51 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/NRT_ADFSDomainTrustMods.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where OperationName =~ "Set federation settings on domain" or OperationName =~ "Set domain authentication"
//| where Result =~ "success"   // commenting out, as it may be interesting to capture failed attempts
| mv-expand TargetResources
| extend modifiedProperties = parse_json(TargetResources).modifiedProperties
| mv-expand modifiedProperties
| extend targetDisplayName = tostring(parse_json(modifiedProperties).displayName), NewDomainValue=tostring(parse_json(modifiedProperties).newValue)
| extend Federated = iif(OperationName =~ "Set domain authentication", iif(NewDomainValue has "Federated", True, False), True)
| where Federated == True
| mv-expand AdditionalDetails
| extend UserAgent = iff(AdditionalDetails.key == "User-Agent",tostring(AdditionalDetails.value),"")
| extend InitiatingUserOrApp = iff(isnotempty(InitiatedBy.user.userPrincipalName),tostring(InitiatedBy.user.userPrincipalName), tostring(InitiatedBy.app.displayName))
| extend InitiatingIpAddress = iff(isnotempty(InitiatedBy.user.ipAddress), tostring(InitiatedBy.user.ipAddress), tostring(InitiatedBy.app.ipAddress))
| project-reorder TimeGenerated, OperationName, InitiatingUserOrApp, AADOperationType, targetDisplayName, Result, InitiatingIpAddress, UserAgent, CorrelationId, TenantId, AADTenantId

```

## Admin promotion after Role Management Application Permission Grant

'This rule looks for a service principal being granted the Microsoft Graph RoleManagement.ReadWrite.Directory (application) permission before being used to add an Azure AD object or user account to an Admin directory role (i.e. Global Administrators).
This is a known attack path that is usually abused when a service principal already has the AppRoleAssignment.ReadWrite.All permission granted. This permission Allows an app to manage permission grants for application permissions to any API.
A service principal can promote itself or other service principals to admin roles (i.e. Global Administrators). This would be considered a privilege escalation technique.
Ref : https://docs.microsoft.com/graph/permissions-reference#role-management-permissions, https://docs.microsoft.com/graph/api/directoryrole-post-members?view=graph-rest-1.0&tabs=http'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1098.003|
|Platform | Azure|
|DetectionType | Analytics |
|ConnectorId | AzureActiveDirectory |
|DetectionId | f80d951a-eddc-4171-b9d0-d616bb83efdc |
|DataTypes | AuditLogs |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/AuditLogs/AdminPromoAfterRoleMgmtAppPermissionGrant.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
AuditLogs
| where LoggedByService =~ "Core Directory"
| where Category =~ "ApplicationManagement"
| where AADOperationType =~ "Assign"
| where ActivityDisplayName =~ "Add app role assignment to service principal"
| mv-expand TargetResources
| mv-expand TargetResources.modifiedProperties
| extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
| where displayName_ =~ "AppRole.Value"
| extend AppRole = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
| where AppRole has "RoleManagement.ReadWrite.Directory"
| extend InitiatingApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| extend Initiator = iif(isnotempty(InitiatingApp), InitiatingApp, tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName))
| extend Target = tostring(parse_json(tostring(TargetResources.modifiedProperties[4].newValue)))
| extend TargetId = tostring(parse_json(tostring(TargetResources.modifiedProperties[3].newValue)))
| project TimeGenerated, OperationName, Initiator, Target, TargetId, Result
| join kind=innerunique (
  AuditLogs
  | where LoggedByService =~ "Core Directory"
  | where Category =~ "RoleManagement"
  | where AADOperationType in ("Assign", "AssignEligibleRole")
  | where ActivityDisplayName has_any ("Add eligible member to role", "Add member to role")
  | mv-expand TargetResources
  | mv-expand TargetResources.modifiedProperties
  | extend displayName_ = tostring(TargetResources_modifiedProperties.displayName)
  | where displayName_ =~ "Role.DisplayName"
  | extend RoleName = tostring(parse_json(tostring(TargetResources_modifiedProperties.newValue)))
  | where RoleName contains "Admin"
  | extend Initiator = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
  | extend InitiatorId = tostring(parse_json(tostring(InitiatedBy.app)).servicePrincipalId)
  | extend TargetUser = tostring(TargetResources.userPrincipalName)
  | extend Target = iif(isnotempty(TargetUser), TargetUser, tostring(TargetResources.displayName))
  | extend TargetType = tostring(TargetResources.type)
  | extend TargetId = tostring(TargetResources.id)
  | project TimeGenerated, OperationName,  RoleName, Initiator, InitiatorId, Target, TargetId, TargetType, Result
) on $left.TargetId == $right.InitiatorId
| extend TimeRoleMgGrant = TimeGenerated, TimeAdminPromo = TimeGenerated1, ServicePrincipal = Initiator1, ServicePrincipalId = InitiatorId,
  TargetObject = Target1, TargetObjectId = TargetId1, TargetObjectType = TargetType
| where TimeRoleMgGrant < TimeAdminPromo
| project TimeRoleMgGrant, TimeAdminPromo, RoleName, ServicePrincipal, ServicePrincipalId, TargetObject, TargetObjectId, TargetObjectType

```
