# Rules: 5818-5838

## SolarWinds Inventory

'Beyond your internal software management systems, it is possible you may not have visibility into your entire footprint of SolarWinds installations.  This is intended to help use process exection information to discovery any systems that have SolarWinds processes'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1072|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 278592b5-612b-48a4-bb38-4c01ff8ee2a5 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/SolarWindsInventory.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

(union isfuzzy=true 
( 
SecurityEvent  
| where EventID == '4688' 
| where tolower(NewProcessName) has 'solarwinds' 
| extend MachineName = Computer , Process = NewProcessName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account) by Process, Type
), 
( 
WindowsEvent  
| where EventID == '4688' and EventData has "solarwinds"
| extend NewProcessName = tostring(EventData.NewProcessName)
| where tolower(NewProcessName) has 'solarwinds' 
| extend MachineName = Computer , Process = NewProcessName
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account) by Process, Type
), 
( 
DeviceProcessEvents 
| where tolower(InitiatingProcessFolderPath) has 'solarwinds' 
| extend MachineName = DeviceName , Process = InitiatingProcessFolderPath, Account = AccountName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account)  by Process, Type
), 
( 
Event 
| where Source == "Microsoft-Windows-Sysmon" 
| where EventID == 1 
| extend Image = EventDetail.[4].["#text"] 
| where tolower(Image) has 'solarwinds' 
| extend MachineName = Computer , Process = Image, Account = UserName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account)  by Process, Type
) 
) 

```

## SolarWinds Inventory

'Beyond your internal software management systems, it is possible you may not have visibility into your entire footprint of SolarWinds installations.  This is intended to help use process exection information to discovery any systems that have SolarWinds processes'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1072|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | MicrosoftThreatProtection |
|DetectionId | 278592b5-612b-48a4-bb38-4c01ff8ee2a5 |
|DataTypes | DeviceProcessEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/SolarWindsInventory.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

(union isfuzzy=true 
( 
SecurityEvent  
| where EventID == '4688' 
| where tolower(NewProcessName) has 'solarwinds' 
| extend MachineName = Computer , Process = NewProcessName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account) by Process, Type
), 
( 
WindowsEvent  
| where EventID == '4688' and EventData has "solarwinds"
| extend NewProcessName = tostring(EventData.NewProcessName)
| where tolower(NewProcessName) has 'solarwinds' 
| extend MachineName = Computer , Process = NewProcessName
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account) by Process, Type
), 
( 
DeviceProcessEvents 
| where tolower(InitiatingProcessFolderPath) has 'solarwinds' 
| extend MachineName = DeviceName , Process = InitiatingProcessFolderPath, Account = AccountName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account)  by Process, Type
), 
( 
Event 
| where Source == "Microsoft-Windows-Sysmon" 
| where EventID == 1 
| extend Image = EventDetail.[4].["#text"] 
| where tolower(Image) has 'solarwinds' 
| extend MachineName = Computer , Process = Image, Account = UserName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account)  by Process, Type
) 
) 

```

## SolarWinds Inventory

'Beyond your internal software management systems, it is possible you may not have visibility into your entire footprint of SolarWinds installations.  This is intended to help use process exection information to discovery any systems that have SolarWinds processes'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1072|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | WindowsSecurityEvents |
|DetectionId | 278592b5-612b-48a4-bb38-4c01ff8ee2a5 |
|DataTypes | SecurityEvents |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/SolarWindsInventory.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

(union isfuzzy=true 
( 
SecurityEvent  
| where EventID == '4688' 
| where tolower(NewProcessName) has 'solarwinds' 
| extend MachineName = Computer , Process = NewProcessName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account) by Process, Type
), 
( 
WindowsEvent  
| where EventID == '4688' and EventData has "solarwinds"
| extend NewProcessName = tostring(EventData.NewProcessName)
| where tolower(NewProcessName) has 'solarwinds' 
| extend MachineName = Computer , Process = NewProcessName
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account) by Process, Type
), 
( 
DeviceProcessEvents 
| where tolower(InitiatingProcessFolderPath) has 'solarwinds' 
| extend MachineName = DeviceName , Process = InitiatingProcessFolderPath, Account = AccountName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account)  by Process, Type
), 
( 
Event 
| where Source == "Microsoft-Windows-Sysmon" 
| where EventID == 1 
| extend Image = EventDetail.[4].["#text"] 
| where tolower(Image) has 'solarwinds' 
| extend MachineName = Computer , Process = Image, Account = UserName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account)  by Process, Type
) 
) 

```

## SolarWinds Inventory

'Beyond your internal software management systems, it is possible you may not have visibility into your entire footprint of SolarWinds installations.  This is intended to help use process exection information to discovery any systems that have SolarWinds processes'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1072|
|Platform | |
|DetectionType | Hunting |
|ConnectorId | WindowsForwardedEvents |
|DetectionId | 278592b5-612b-48a4-bb38-4c01ff8ee2a5 |
|DataTypes | WindowsEvent |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/MultipleDataSources/SolarWindsInventory.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

(union isfuzzy=true 
( 
SecurityEvent  
| where EventID == '4688' 
| where tolower(NewProcessName) has 'solarwinds' 
| extend MachineName = Computer , Process = NewProcessName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account) by Process, Type
), 
( 
WindowsEvent  
| where EventID == '4688' and EventData has "solarwinds"
| extend NewProcessName = tostring(EventData.NewProcessName)
| where tolower(NewProcessName) has 'solarwinds' 
| extend MachineName = Computer , Process = NewProcessName
| extend Account =  strcat(tostring(EventData.SubjectDomainName),"\\", tostring(EventData.SubjectUserName))
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account) by Process, Type
), 
( 
DeviceProcessEvents 
| where tolower(InitiatingProcessFolderPath) has 'solarwinds' 
| extend MachineName = DeviceName , Process = InitiatingProcessFolderPath, Account = AccountName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account)  by Process, Type
), 
( 
Event 
| where Source == "Microsoft-Windows-Sysmon" 
| where EventID == 1 
| extend Image = EventDetail.[4].["#text"] 
| where tolower(Image) has 'solarwinds' 
| extend MachineName = Computer , Process = Image, Account = UserName
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), MachineCount = dcount(MachineName), AccountCount = dcount(Account), MachineNames = make_set(MachineName), Accounts = make_set(Account)  by Process, Type
) 
) 

```

## Anomalous Password Reset

'Adversaries may interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users. Accounts may be deleted, locked, or manipulated (ex: changed credentials) to remove access to accounts. LockerGoga, for example, has been observed changing account passwords and logging off current users. The query below generates an output of all users performing Reset user password where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1531|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 22b0262c-b6b5-4f15-82a4-93663e9965d7 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Password%20Reset.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Reset user password"
| where ActivityInsights has "True"
| join (
AuditLogs
) on $left.SourceRecordId == $right._ItemId
| mv-expand TargetResources
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| sort by TimeGenerated desc
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Password Reset

'Adversaries may interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users. Accounts may be deleted, locked, or manipulated (ex: changed credentials) to remove access to accounts. LockerGoga, for example, has been observed changing account passwords and logging off current users. The query below generates an output of all users performing Reset user password where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1531|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 22b0262c-b6b5-4f15-82a4-93663e9965d7 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Password%20Reset.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Reset user password"
| where ActivityInsights has "True"
| join (
AuditLogs
) on $left.SourceRecordId == $right._ItemId
| mv-expand TargetResources
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| sort by TimeGenerated desc
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Password Reset

'Adversaries may interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users. Accounts may be deleted, locked, or manipulated (ex: changed credentials) to remove access to accounts. LockerGoga, for example, has been observed changing account passwords and logging off current users. The query below generates an output of all users performing Reset user password where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1531|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 22b0262c-b6b5-4f15-82a4-93663e9965d7 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Password%20Reset.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Reset user password"
| where ActivityInsights has "True"
| join (
AuditLogs
) on $left.SourceRecordId == $right._ItemId
| mv-expand TargetResources
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| sort by TimeGenerated desc
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Password Reset

'Adversaries may interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users. Accounts may be deleted, locked, or manipulated (ex: changed credentials) to remove access to accounts. LockerGoga, for example, has been observed changing account passwords and logging off current users. The query below generates an output of all users performing Reset user password where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1531|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 22b0262c-b6b5-4f15-82a4-93663e9965d7 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Password%20Reset.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Reset user password"
| where ActivityInsights has "True"
| join (
AuditLogs
) on $left.SourceRecordId == $right._ItemId
| mv-expand TargetResources
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| sort by TimeGenerated desc
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Password Reset

'Adversaries may interrupt availability of system and network resources by inhibiting access to accounts utilized by legitimate users. Accounts may be deleted, locked, or manipulated (ex: changed credentials) to remove access to accounts. LockerGoga, for example, has been observed changing account passwords and logging off current users. The query below generates an output of all users performing Reset user password where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Impact|
|TechniqueId | T1531|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | 22b0262c-b6b5-4f15-82a4-93663e9965d7 |
|DataTypes | AuditLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Password%20Reset.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Reset user password"
| where ActivityInsights has "True"
| join (
AuditLogs
) on $left.SourceRecordId == $right._ItemId
| mv-expand TargetResources
| extend Target =  iff(tostring(TargetResources.userPrincipalName) has "#EXT#",replace("_","@",tostring(split(TargetResources.userPrincipalName, "#")[0])),TargetResources.userPrincipalName),tostring(TargetResources.userPrincipalName)
| extend UserPrincipalName = iff(UserPrincipalName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName has "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| sort by TimeGenerated desc
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["TargetUser"]=Target, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Geo Location Logon

'Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. APT33, for example, has used valid accounts for initial access. The query below generates an output of successful Sign-in performed by a user from a new geo location he has never connected from before, and none of his peers as well.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | eeea7fb9-21cf-4023-91dc-3f55d7548d14 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Geo%20Location%20Logon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Sign-in"
| where ActivityInsights.FirstTimeConnectionFromCountryObservedInTenant == True and ActivityInsights.CountryUncommonlyConnectedFromAmongPeers == True
    | join (
SigninLogs
) on $left.SourceRecordId == $right._ItemId
| extend UserPrincipalName = iff(UserPrincipalName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["Evidence"]=ActivityInsights, ResourceDisplayName, AppDisplayName, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Geo Location Logon

'Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. APT33, for example, has used valid accounts for initial access. The query below generates an output of successful Sign-in performed by a user from a new geo location he has never connected from before, and none of his peers as well.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | eeea7fb9-21cf-4023-91dc-3f55d7548d14 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Geo%20Location%20Logon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Sign-in"
| where ActivityInsights.FirstTimeConnectionFromCountryObservedInTenant == True and ActivityInsights.CountryUncommonlyConnectedFromAmongPeers == True
    | join (
SigninLogs
) on $left.SourceRecordId == $right._ItemId
| extend UserPrincipalName = iff(UserPrincipalName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["Evidence"]=ActivityInsights, ResourceDisplayName, AppDisplayName, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Geo Location Logon

'Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. APT33, for example, has used valid accounts for initial access. The query below generates an output of successful Sign-in performed by a user from a new geo location he has never connected from before, and none of his peers as well.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | eeea7fb9-21cf-4023-91dc-3f55d7548d14 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Geo%20Location%20Logon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Sign-in"
| where ActivityInsights.FirstTimeConnectionFromCountryObservedInTenant == True and ActivityInsights.CountryUncommonlyConnectedFromAmongPeers == True
    | join (
SigninLogs
) on $left.SourceRecordId == $right._ItemId
| extend UserPrincipalName = iff(UserPrincipalName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["Evidence"]=ActivityInsights, ResourceDisplayName, AppDisplayName, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Geo Location Logon

'Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. APT33, for example, has used valid accounts for initial access. The query below generates an output of successful Sign-in performed by a user from a new geo location he has never connected from before, and none of his peers as well.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | eeea7fb9-21cf-4023-91dc-3f55d7548d14 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Geo%20Location%20Logon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Sign-in"
| where ActivityInsights.FirstTimeConnectionFromCountryObservedInTenant == True and ActivityInsights.CountryUncommonlyConnectedFromAmongPeers == True
    | join (
SigninLogs
) on $left.SourceRecordId == $right._ItemId
| extend UserPrincipalName = iff(UserPrincipalName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["Evidence"]=ActivityInsights, ResourceDisplayName, AppDisplayName, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Geo Location Logon

'Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. APT33, for example, has used valid accounts for initial access. The query below generates an output of successful Sign-in performed by a user from a new geo location he has never connected from before, and none of his peers as well.'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | AzureActiveDirectory |
|DetectionId | eeea7fb9-21cf-4023-91dc-3f55d7548d14 |
|DataTypes | SigninLogs |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Geo%20Location%20Logon.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where ActionType == "Sign-in"
| where ActivityInsights.FirstTimeConnectionFromCountryObservedInTenant == True and ActivityInsights.CountryUncommonlyConnectedFromAmongPeers == True
    | join (
SigninLogs
) on $left.SourceRecordId == $right._ItemId
| extend UserPrincipalName = iff(UserPrincipalName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserPrincipalName),
UserName = iff(UserName contains "#EXT#",replace("_","@",tostring(split(UserPrincipalName, "#")[0])),UserName)
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ["Evidence"]=ActivityInsights, ResourceDisplayName, AppDisplayName, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights, ResourceId
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress, ResourceCustomEntity = ResourceId

```

## Anomalous Login to Devices

'Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. APT33, for example, has used valid accounts for initial access and privilege escalation. The query below generates an output of all administator users performing an interactive logon (4624:2) where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 2e20ec77-8d50-4959-a70d-79c341ee2c37 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Login%20to%20Devices.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where UsersInsights.IsDormantAccount == true
| where DevicesInsights.IsLocalAdmin == true
| where ActivityType == "LogOn"
| where ActionType == "InteractiveLogon"
| where ActivityInsights contains "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Login to Devices

'Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. APT33, for example, has used valid accounts for initial access and privilege escalation. The query below generates an output of all administator users performing an interactive logon (4624:2) where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 2e20ec77-8d50-4959-a70d-79c341ee2c37 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Login%20to%20Devices.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where UsersInsights.IsDormantAccount == true
| where DevicesInsights.IsLocalAdmin == true
| where ActivityType == "LogOn"
| where ActionType == "InteractiveLogon"
| where ActivityInsights contains "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Login to Devices

'Adversaries may steal the credentials of a specific user or service account using Credential Access techniques or capture credentials earlier in their reconnaissance process through social engineering for means of gaining Initial Access. APT33, for example, has used valid accounts for initial access and privilege escalation. The query below generates an output of all administator users performing an interactive logon (4624:2) where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 2e20ec77-8d50-4959-a70d-79c341ee2c37 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Login%20to%20Devices.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

BehaviorAnalytics
| where UsersInsights.IsDormantAccount == true
| where DevicesInsights.IsLocalAdmin == true
| where ActivityType == "LogOn"
| where ActionType == "InteractiveLogon"
| where ActivityInsights contains "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Data Access

'Adversaries may access data objects from cloud storage.  The query below generates an output of all users performing a "read" operation regarding data or files, where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1530|
|Platform | Azure AD|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 8cf3c78e-cd10-4bfb-bd69-d62dc7f375f1 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Data%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let operations = dynamic(['Export an existing database']);
BehaviorAnalytics
| where ActionType in(operations)
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Data Access

'Adversaries may access data objects from cloud storage.  The query below generates an output of all users performing a "read" operation regarding data or files, where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1530|
|Platform | Azure|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 8cf3c78e-cd10-4bfb-bd69-d62dc7f375f1 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Data%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let operations = dynamic(['Export an existing database']);
BehaviorAnalytics
| where ActionType in(operations)
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```

## Anomalous Data Access

'Adversaries may access data objects from cloud storage.  The query below generates an output of all users performing a "read" operation regarding data or files, where one or more features of the activitiy deviates from the user, his peers or the tenant profile.'

|Name | Value |
| --- | --- |
|Tactic | Collection|
|TechniqueId | T1530|
|Platform | Windows|
|DetectionType | Hunting |
|ConnectorId | BehaviorAnalytics |
|DetectionId | 8cf3c78e-cd10-4bfb-bd69-d62dc7f375f1 |
|DataTypes | BehaviorAnalytics |
|QueryFrequency |  |
|QueryPeriod |  |
|TriggerOperator |  |
|TriggerThreshold |  |
|DetectionSeverity |  |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Hunting%20Queries/BehaviorAnalytics/Anomalous%20Data%20Access.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let operations = dynamic(['Export an existing database']);
BehaviorAnalytics
| where ActionType in(operations)
| where ActivityInsights has "True"
| project TimeGenerated, UserName, UserPrincipalName, UsersInsights, ActivityType, ActionType, ActivityInsights, SourceIPAddress, SourceIPLocation, SourceDevice, DevicesInsights
| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName, IPCustomEntity = SourceIPAddress

```
