# Rules: 7729-7749

## Vulnerable Machines related to log4j CVE-2021-44228

'This query uses the Azure Defender Security Nested Recommendations data to find machines vulnerable to log4j CVE-2021-44228. Log4j is an open-source Apache logging library that is used in 
 many Java-based applications. Security Nested Recommendations data is sent to Microsoft Sentinel using the continuous export feature of Azure Defender(refrence link below).
 Reference: https://msrc-blog.microsoft.com/2021/12/11/microsofts-response-to-cve-2021-44228-apache-log4j2/
 Reference: https://docs.microsoft.com/azure/security-center/continuous-export?tabs=azure-portal
 Reference: https://techcommunity.microsoft.com/t5/microsoft-defender-for-cloud/how-defender-for-cloud-displays-machines-affected-by-log4j/ba-p/3037271'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1203|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 3d71fc38-f249-454e-8479-0a358382ef9a |
|DataTypes | SecurityNestedRecommendation_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityNestedRecommendation/Log4jVulnerableMachines.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityNestedRecommendation
| where RemediationDescription has 'CVE-2021-44228'
| parse ResourceDetails with * 'virtualMachines/' VirtualMAchine '"' *
| summarize arg_min(TimeGenerated, *) by TenantId, RecommendationSubscriptionId, VirtualMAchine, RecommendationName,Description,RemediationDescription, tostring(AdditionalData),VulnerabilityId
| extend Timestamp = TimeGenerated, HostCustomEntity = VirtualMAchine

```

## Vulnerable Machines related to log4j CVE-2021-44228

'This query uses the Azure Defender Security Nested Recommendations data to find machines vulnerable to log4j CVE-2021-44228. Log4j is an open-source Apache logging library that is used in 
 many Java-based applications. Security Nested Recommendations data is sent to Microsoft Sentinel using the continuous export feature of Azure Defender(refrence link below).
 Reference: https://msrc-blog.microsoft.com/2021/12/11/microsofts-response-to-cve-2021-44228-apache-log4j2/
 Reference: https://docs.microsoft.com/azure/security-center/continuous-export?tabs=azure-portal
 Reference: https://techcommunity.microsoft.com/t5/microsoft-defender-for-cloud/how-defender-for-cloud-displays-machines-affected-by-log4j/ba-p/3037271'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1190|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 3d71fc38-f249-454e-8479-0a358382ef9a |
|DataTypes | SecurityNestedRecommendation_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityNestedRecommendation/Log4jVulnerableMachines.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityNestedRecommendation
| where RemediationDescription has 'CVE-2021-44228'
| parse ResourceDetails with * 'virtualMachines/' VirtualMAchine '"' *
| summarize arg_min(TimeGenerated, *) by TenantId, RecommendationSubscriptionId, VirtualMAchine, RecommendationName,Description,RemediationDescription, tostring(AdditionalData),VulnerabilityId
| extend Timestamp = TimeGenerated, HostCustomEntity = VirtualMAchine

```

## Vulnerable Machines related to log4j CVE-2021-44228

'This query uses the Azure Defender Security Nested Recommendations data to find machines vulnerable to log4j CVE-2021-44228. Log4j is an open-source Apache logging library that is used in 
 many Java-based applications. Security Nested Recommendations data is sent to Microsoft Sentinel using the continuous export feature of Azure Defender(refrence link below).
 Reference: https://msrc-blog.microsoft.com/2021/12/11/microsofts-response-to-cve-2021-44228-apache-log4j2/
 Reference: https://docs.microsoft.com/azure/security-center/continuous-export?tabs=azure-portal
 Reference: https://techcommunity.microsoft.com/t5/microsoft-defender-for-cloud/how-defender-for-cloud-displays-machines-affected-by-log4j/ba-p/3037271'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1203|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 3d71fc38-f249-454e-8479-0a358382ef9a |
|DataTypes | SecurityNestedRecommendation_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityNestedRecommendation/Log4jVulnerableMachines.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityNestedRecommendation
| where RemediationDescription has 'CVE-2021-44228'
| parse ResourceDetails with * 'virtualMachines/' VirtualMAchine '"' *
| summarize arg_min(TimeGenerated, *) by TenantId, RecommendationSubscriptionId, VirtualMAchine, RecommendationName,Description,RemediationDescription, tostring(AdditionalData),VulnerabilityId
| extend Timestamp = TimeGenerated, HostCustomEntity = VirtualMAchine

```

## Vulnerable Machines related to OMIGOD CVE-2021-38647

'This query uses the Azure Defender Security Nested Recommendations data to find machines vulnerable to OMIGOD CVE-2021-38647. OMI is the Linux equivalent of Windows WMI and 
 helps users manage configurations across remote and local environments. The query aims to find machines that have this OMI vulnerability (CVE-2021-38647).
 Security Nested Recommendations data is sent to Microsoft Sentinel using the continuous export feature of Azure Defender(refrence link below).
 Reference: https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
 Reference: https://docs.microsoft.com/azure/security-center/continuous-export?tabs=azure-portal'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 4d94d4a9-dc96-450a-9dea-4d4d4594199b |
|DataTypes | SecurityNestedRecommendation_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityNestedRecommendation/OMIGODVulnerableMachines.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityNestedRecommendation
| where RemediationDescription has 'CVE-2021-38647'
| parse ResourceDetails with * 'virtualMachines/' VirtualMAchine '"' *
| summarize arg_min(TimeGenerated, *) by TenantId, RecommendationSubscriptionId, VirtualMAchine, RecommendationName,Description,RemediationDescription, tostring(AdditionalData),VulnerabilityId
| extend Timestamp = TimeGenerated, HostCustomEntity = VirtualMAchine

```

## Vulnerable Machines related to OMIGOD CVE-2021-38647

'This query uses the Azure Defender Security Nested Recommendations data to find machines vulnerable to OMIGOD CVE-2021-38647. OMI is the Linux equivalent of Windows WMI and 
 helps users manage configurations across remote and local environments. The query aims to find machines that have this OMI vulnerability (CVE-2021-38647).
 Security Nested Recommendations data is sent to Microsoft Sentinel using the continuous export feature of Azure Defender(refrence link below).
 Reference: https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
 Reference: https://docs.microsoft.com/azure/security-center/continuous-export?tabs=azure-portal'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1203|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 4d94d4a9-dc96-450a-9dea-4d4d4594199b |
|DataTypes | SecurityNestedRecommendation_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityNestedRecommendation/OMIGODVulnerableMachines.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityNestedRecommendation
| where RemediationDescription has 'CVE-2021-38647'
| parse ResourceDetails with * 'virtualMachines/' VirtualMAchine '"' *
| summarize arg_min(TimeGenerated, *) by TenantId, RecommendationSubscriptionId, VirtualMAchine, RecommendationName,Description,RemediationDescription, tostring(AdditionalData),VulnerabilityId
| extend Timestamp = TimeGenerated, HostCustomEntity = VirtualMAchine

```

## Vulnerable Machines related to OMIGOD CVE-2021-38647

'This query uses the Azure Defender Security Nested Recommendations data to find machines vulnerable to OMIGOD CVE-2021-38647. OMI is the Linux equivalent of Windows WMI and 
 helps users manage configurations across remote and local environments. The query aims to find machines that have this OMI vulnerability (CVE-2021-38647).
 Security Nested Recommendations data is sent to Microsoft Sentinel using the continuous export feature of Azure Defender(refrence link below).
 Reference: https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
 Reference: https://docs.microsoft.com/azure/security-center/continuous-export?tabs=azure-portal'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1190|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 4d94d4a9-dc96-450a-9dea-4d4d4594199b |
|DataTypes | SecurityNestedRecommendation_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityNestedRecommendation/OMIGODVulnerableMachines.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityNestedRecommendation
| where RemediationDescription has 'CVE-2021-38647'
| parse ResourceDetails with * 'virtualMachines/' VirtualMAchine '"' *
| summarize arg_min(TimeGenerated, *) by TenantId, RecommendationSubscriptionId, VirtualMAchine, RecommendationName,Description,RemediationDescription, tostring(AdditionalData),VulnerabilityId
| extend Timestamp = TimeGenerated, HostCustomEntity = VirtualMAchine

```

## Vulnerable Machines related to OMIGOD CVE-2021-38647

'This query uses the Azure Defender Security Nested Recommendations data to find machines vulnerable to OMIGOD CVE-2021-38647. OMI is the Linux equivalent of Windows WMI and 
 helps users manage configurations across remote and local environments. The query aims to find machines that have this OMI vulnerability (CVE-2021-38647).
 Security Nested Recommendations data is sent to Microsoft Sentinel using the continuous export feature of Azure Defender(refrence link below).
 Reference: https://www.wiz.io/blog/omigod-critical-vulnerabilities-in-omi-azure
 Reference: https://docs.microsoft.com/azure/security-center/continuous-export?tabs=azure-portal'

|Name | Value |
| --- | --- |
|Tactic | Execution|
|TechniqueId | T1203|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 4d94d4a9-dc96-450a-9dea-4d4d4594199b |
|DataTypes | SecurityNestedRecommendation_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | High |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityNestedRecommendation/OMIGODVulnerableMachines.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
SecurityNestedRecommendation
| where RemediationDescription has 'CVE-2021-38647'
| parse ResourceDetails with * 'virtualMachines/' VirtualMAchine '"' *
| summarize arg_min(TimeGenerated, *) by TenantId, RecommendationSubscriptionId, VirtualMAchine, RecommendationName,Description,RemediationDescription, tostring(AdditionalData),VulnerabilityId
| extend Timestamp = TimeGenerated, HostCustomEntity = VirtualMAchine

```

## HAFNIUM Suspicious UM Service Error

'This query looks for errors that may indicate that an attacker is attempting to exploit a vulnerability in the service. 
Reference: https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 0625fcce-6d52-491e-8c68-1d9b801d25b9 |
|DataTypes | SecurityEvent_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityEvent/HAFNIUMSuspiciousUMServiceError.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
Event
| where EventLog =~ "Application"
| where Source startswith "MSExchange"
| where EventLevelName =~ "error"
| where (RenderedDescription startswith "Watson report" and RenderedDescription contains "umworkerprocess" and RenderedDescription contains "TextFormattingRunProperties") or RenderedDescription startswith "An unhandled exception occurred in a UM worker process" or RenderedDescription startswith "The Microsoft Exchange Unified Messaging service" or RenderedDescription contains "MSExchange Unified Messaging"
| where RenderedDescription !contains "System.OutOfMemoryException"
| extend timestamp = TimeGenerated, HostCustomEntity = Computer

```

## Wazuh - Large Number of Web errors from an IP

'Identifies instances where Wazuh logged over 400 '403' Web Errors from one IP Address. To onboard Wazuh data into Sentinel please view: https://github.com/wazuh/wazuh-documentation/blob/master/source/azure/monitoring%20activity.rst'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | |
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 2790795b-7dba-483e-853f-44aa0bc9c985 |
|DataTypes | CommonSecurityLog_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/CommonSecurityLog/Wazuh-Large%20Number%20of%20Web%20errors%20from%20an%20IP.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

CommonSecurityLog
| where DeviceProduct =~ "Wazuh"
| where Activity has "Web server 400 error code."
| where Message has "403"
| extend HostName=substring(split(DeviceCustomString1,")")[0],1)
| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), NumberOfErrors = dcount(SourceIP) by HostName, SourceIP
| where NumberOfErrors > 400
| sort by NumberOfErrors desc
| extend timestamp = StartTime, HostCustomEntity = HostName, IPCustomEntity = SourceIP

```

## HAFNIUM Suspicious File Downloads.

'This query looks for messages related to file downloads of suspicious file types. This query uses the Exchange HttpProxy AOBGeneratorLog, you will need to onboard this log as a custom log under the table http_proxy_oab_CL before using this query. 
Reference: https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1190|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 03e04c97-8cae-48b3-9d2f-4ab262e4ffff |
|DataTypes | http_proxy_oab_CL_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/http_proxy_oab_CL/HAFNIUMSuspiciousFileDownloads.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
let scriptExtensions = dynamic([".php", ".jsp", ".js", ".aspx", ".asmx", ".asax", ".cfm", ".shtml"]);
http_proxy_oab_CL
| where RawData contains "Download failed and temporary file"
| extend File = extract("([^\\\\]*)(\\\\[^']*)",2,RawData)
| extend Extension = strcat(".",split(File, ".")[-1])
| extend InteractiveFile = iif(Extension in (scriptExtensions), "Yes", "No")
// Uncomment the following line to alert only on interactive file download type
//| where InteractiveFile =~ "Yes"
| extend timestamp = TimeGenerated, HostCustomEntity = Computer

```

## Potential Fodhelper UAC Bypass (ASIM Version)

'This detection looks for the steps required to conduct a UAC bypass using Fodhelper.exe. By default this detection looks for the setting of the required registry keys and the invoking of the process within 1 hour - this can be tweaked as required.'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1548.002|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | ac9e233e-44d4-45eb-b522-6e47445f6582 |
|DataTypes | MultipleDataSources_CL |
|QueryFrequency | 2h |
|QueryPeriod | 2h |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/PotentialFodhelperUACBypass(ASIMVersion).yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql
imRegistry
  | where EventType in ("RegistryValueSet", "RegistryKeyCreated")
  | where RegistryKey has "Software\\Classes\\ms-settings\\shell\\open\\command"
  | extend TimeKey = bin(TimeGenerated, 1h)
  | join (imProcess
  | where Process endswith "fodhelper.exe"
  | where ParentProcessName endswith "cmd.exe" or ParentProcessName endswith "powershell.exe" or ParentProcessName endswith "powershell_ise.exe"
  | extend TimeKey = bin(TimeGenerated, 1h)) on TimeKey, Dvc

```

## External User Access Enabled

'This alerts when the account setting is changed to allow either external domain access or anonymous access to meetings.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1098|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 8e267e91-6bda-4b3c-bf68-9f5cbdd103a3 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ZoomLogs/ExternalUserAccess.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

ZoomLogs
| where Event =~ "account.settings_updated" 
| extend EnforceLogin = columnifexists("payload_object_settings_schedule_meeting_enfore_login_b", "") 
| extend EnforceLoginDomain = columnifexists("payload_object_settings_schedule_meeting_enfore_login_b", "") 
| extend GuestAlerts = columnifexists("payload_object_settings_in_meeting_alert_guest_join_b", "") 
| where EnforceLogin == 'false' or EnforceLoginDomain == 'false' or GuestAlerts == 'false' 
| extend SettingChanged = case(EnforceLogin == 'false' and EnforceLoginDomain == 'false' and GuestAlerts == 'false', "All settings changed", 
                            EnforceLogin == 'false' and EnforceLoginDomain == 'false', "Enforced Logons and Restricted Domains Changed", 
                            EnforceLoginDomain == 'false' and GuestAlerts == 'false', "Enforced Domains Changed", 
                            EnforceLoginDomain == 'false', "Enfored Domains Changed", 
                            GuestAlerts == 'false', "Guest Join Alerts Changed", 
                            EnforceLogin == 'false', "Enforced Logins Changed", 
                            "No Changes")
| extend timestamp = TimeGenerated, AccountCustomEntity = User

```

## External User Access Enabled

'This alerts when the account setting is changed to allow either external domain access or anonymous access to meetings.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1556|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 8e267e91-6bda-4b3c-bf68-9f5cbdd103a3 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ZoomLogs/ExternalUserAccess.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

ZoomLogs
| where Event =~ "account.settings_updated" 
| extend EnforceLogin = columnifexists("payload_object_settings_schedule_meeting_enfore_login_b", "") 
| extend EnforceLoginDomain = columnifexists("payload_object_settings_schedule_meeting_enfore_login_b", "") 
| extend GuestAlerts = columnifexists("payload_object_settings_in_meeting_alert_guest_join_b", "") 
| where EnforceLogin == 'false' or EnforceLoginDomain == 'false' or GuestAlerts == 'false' 
| extend SettingChanged = case(EnforceLogin == 'false' and EnforceLoginDomain == 'false' and GuestAlerts == 'false', "All settings changed", 
                            EnforceLogin == 'false' and EnforceLoginDomain == 'false', "Enforced Logons and Restricted Domains Changed", 
                            EnforceLoginDomain == 'false' and GuestAlerts == 'false', "Enforced Domains Changed", 
                            EnforceLoginDomain == 'false', "Enfored Domains Changed", 
                            GuestAlerts == 'false', "Guest Join Alerts Changed", 
                            EnforceLogin == 'false', "Enforced Logins Changed", 
                            "No Changes")
| extend timestamp = TimeGenerated, AccountCustomEntity = User

```

## External User Access Enabled

'This alerts when the account setting is changed to allow either external domain access or anonymous access to meetings.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1098|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 8e267e91-6bda-4b3c-bf68-9f5cbdd103a3 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ZoomLogs/ExternalUserAccess.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

ZoomLogs
| where Event =~ "account.settings_updated" 
| extend EnforceLogin = columnifexists("payload_object_settings_schedule_meeting_enfore_login_b", "") 
| extend EnforceLoginDomain = columnifexists("payload_object_settings_schedule_meeting_enfore_login_b", "") 
| extend GuestAlerts = columnifexists("payload_object_settings_in_meeting_alert_guest_join_b", "") 
| where EnforceLogin == 'false' or EnforceLoginDomain == 'false' or GuestAlerts == 'false' 
| extend SettingChanged = case(EnforceLogin == 'false' and EnforceLoginDomain == 'false' and GuestAlerts == 'false', "All settings changed", 
                            EnforceLogin == 'false' and EnforceLoginDomain == 'false', "Enforced Logons and Restricted Domains Changed", 
                            EnforceLoginDomain == 'false' and GuestAlerts == 'false', "Enforced Domains Changed", 
                            EnforceLoginDomain == 'false', "Enfored Domains Changed", 
                            GuestAlerts == 'false', "Guest Join Alerts Changed", 
                            EnforceLogin == 'false', "Enforced Logins Changed", 
                            "No Changes")
| extend timestamp = TimeGenerated, AccountCustomEntity = User

```

## External User Access Enabled

'This alerts when the account setting is changed to allow either external domain access or anonymous access to meetings.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | T1556|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 8e267e91-6bda-4b3c-bf68-9f5cbdd103a3 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ZoomLogs/ExternalUserAccess.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

ZoomLogs
| where Event =~ "account.settings_updated" 
| extend EnforceLogin = columnifexists("payload_object_settings_schedule_meeting_enfore_login_b", "") 
| extend EnforceLoginDomain = columnifexists("payload_object_settings_schedule_meeting_enfore_login_b", "") 
| extend GuestAlerts = columnifexists("payload_object_settings_in_meeting_alert_guest_join_b", "") 
| where EnforceLogin == 'false' or EnforceLoginDomain == 'false' or GuestAlerts == 'false' 
| extend SettingChanged = case(EnforceLogin == 'false' and EnforceLoginDomain == 'false' and GuestAlerts == 'false', "All settings changed", 
                            EnforceLogin == 'false' and EnforceLoginDomain == 'false', "Enforced Logons and Restricted Domains Changed", 
                            EnforceLoginDomain == 'false' and GuestAlerts == 'false', "Enforced Domains Changed", 
                            EnforceLoginDomain == 'false', "Enfored Domains Changed", 
                            GuestAlerts == 'false', "Guest Join Alerts Changed", 
                            EnforceLogin == 'false', "Enforced Logins Changed", 
                            "No Changes")
| extend timestamp = TimeGenerated, AccountCustomEntity = User

```

## User joining Zoom meeting from suspicious timezone

'The alert shows users that join a Zoom meeting from a time zone other than the one the meeting was created in.
You can also whitelist known good time zones in the tz_whitelist value using the tz database name format https://en.wikipedia.org/wiki/List_of_tz_database_time_zones'

|Name | Value |
| --- | --- |
|Tactic | InitialAccess|
|TechniqueId | T1078|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 58fc0170-0877-4ea8-a9ff-d805e361cfae |
|DataTypes | ZoomLogs_CL |
|QueryFrequency | 1d |
|QueryPeriod | 14d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ZoomLogs/JoiningMeetingFromAnotherTimeZone.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let schedule_lookback = 14d; 
let join_lookback = 1d; 
// If you want to whitelist specific timezones include them in a list here
let tz_whitelist = dynamic([]);
let meetings = ( 
ZoomLogs 
| where TimeGenerated >= ago(schedule_lookback) 
| where Event =~ "meeting.created" 
| extend MeetingId = tostring(parse_json(MeetingEvents).MeetingId)  
| extend SchedTimezone = tostring(parse_json(MeetingEvents).Timezone)); 
ZoomLogs 
| where TimeGenerated >= ago(join_lookback) 
| where Event =~ "meeting.participant_joined" 
| extend JoinedTimeZone = tostring(parse_json(MeetingEvents).Timezone) 
| extend MeetingName = tostring(parse_json(MeetingEvents).MeetingName) 
| extend MeetingId = tostring(parse_json(MeetingEvents).MeetingId) 
| where JoinedTimeZone !in (tz_whitelist)
| join (meetings) on MeetingId 
| where SchedTimezone != JoinedTimeZone 
| project TimeGenerated, MeetingName, JoiningUser=payload_object_participant_user_name_s, JoinedTimeZone, SchedTimezone, MeetingScheduler=User1 
| extend timestamp = TimeGenerated, AccountCustomEntity = JoiningUser

```

## User joining Zoom meeting from suspicious timezone

'The alert shows users that join a Zoom meeting from a time zone other than the one the meeting was created in.
You can also whitelist known good time zones in the tz_whitelist value using the tz database name format https://en.wikipedia.org/wiki/List_of_tz_database_time_zones'

|Name | Value |
| --- | --- |
|Tactic | PrivilegeEscalation|
|TechniqueId | T1078|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 58fc0170-0877-4ea8-a9ff-d805e361cfae |
|DataTypes | ZoomLogs_CL |
|QueryFrequency | 1d |
|QueryPeriod | 14d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ZoomLogs/JoiningMeetingFromAnotherTimeZone.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let schedule_lookback = 14d; 
let join_lookback = 1d; 
// If you want to whitelist specific timezones include them in a list here
let tz_whitelist = dynamic([]);
let meetings = ( 
ZoomLogs 
| where TimeGenerated >= ago(schedule_lookback) 
| where Event =~ "meeting.created" 
| extend MeetingId = tostring(parse_json(MeetingEvents).MeetingId)  
| extend SchedTimezone = tostring(parse_json(MeetingEvents).Timezone)); 
ZoomLogs 
| where TimeGenerated >= ago(join_lookback) 
| where Event =~ "meeting.participant_joined" 
| extend JoinedTimeZone = tostring(parse_json(MeetingEvents).Timezone) 
| extend MeetingName = tostring(parse_json(MeetingEvents).MeetingName) 
| extend MeetingId = tostring(parse_json(MeetingEvents).MeetingId) 
| where JoinedTimeZone !in (tz_whitelist)
| join (meetings) on MeetingId 
| where SchedTimezone != JoinedTimeZone 
| project TimeGenerated, MeetingName, JoiningUser=payload_object_participant_user_name_s, JoinedTimeZone, SchedTimezone, MeetingScheduler=User1 
| extend timestamp = TimeGenerated, AccountCustomEntity = JoiningUser

```

## Suspicious link sharing pattern

'Alerts in links that have been shared across multiple Zoom chat channels by the same user in a short space if time. 
Adjust the threshold figure to change the number of channels a message needs to be posted in before an alert is raised.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | |
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 1218175f-c534-421c-8070-5dcaabf28067 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ZoomLogs/SupiciousLinkSharing.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 3; 
ZoomLogs 
| where Event =~ "chat_message.sent" 
| extend Channel = tostring(parse_json(ChatEvents).Channel)  
| extend Message = tostring(parse_json(ChatEvents).Message) 
| where Message matches regex "http(s?):\\/\\/" 
| summarize Channels = makeset(Channel), StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Message, User, UserId
| extend ChannelCount = arraylength(Channels) 
| where ChannelCount > threshold
| extend timestamp = StartTime, AccountCustomEntity = User

```

## Suspicious link sharing pattern

'Alerts in links that have been shared across multiple Zoom chat channels by the same user in a short space if time. 
Adjust the threshold figure to change the number of channels a message needs to be posted in before an alert is raised.'

|Name | Value |
| --- | --- |
|Tactic | Persistence|
|TechniqueId | |
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | 1218175f-c534-421c-8070-5dcaabf28067 |
|DataTypes | ZoomLogs_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Low |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ZoomLogs/SupiciousLinkSharing.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

let threshold = 3; 
ZoomLogs 
| where Event =~ "chat_message.sent" 
| extend Channel = tostring(parse_json(ChatEvents).Channel)  
| extend Message = tostring(parse_json(ChatEvents).Message) 
| where Message matches regex "http(s?):\\/\\/" 
| summarize Channels = makeset(Channel), StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Message, User, UserId
| extend ChannelCount = arraylength(Channels) 
| where ChannelCount > threshold
| extend timestamp = StartTime, AccountCustomEntity = User

```

## Zoom E2E Encryption Disabled

'This alerts when end to end encryption is disabled for Zoom meetings.'

|Name | Value |
| --- | --- |
|Tactic | CredentialAccess|
|TechniqueId | T1040|
|Platform | |
|DetectionType | Analytics |
|ConnectorId | CustomConnector |
|DetectionId | e4779bdc-397a-4b71-be28-59e6a1e1d16b |
|DataTypes | ZoomLogs_CL |
|QueryFrequency | 1d |
|QueryPeriod | 1d |
|TriggerOperator | gt |
|TriggerThreshold | 0.0 |
|DetectionSeverity | Medium |
|DetectionUrl | https://github.com/Azure/Azure-Sentinel/blob/master/Detections/ZoomLogs/E2EEDisbaled.yaml |
|IngestedDate | 2022-08-07 |

### KQL
```kql

ZoomLogs
| where Event =~ "account.settings_updated"
| extend NewE2ESetting = columnifexists("payload_object_settings_in_meeting_e2e_encryption_b", "")
| extend OldE2ESetting = columnifexists("payload_old_object_settings_in_meeting_e2e_encryption_b", "")
| where OldE2ESetting =~ 'false' and NewE2ESetting =~ 'true'
| extend timestamp = TimeGenerated, AccountCustomEntity = User

```
